{
  "entries": [
    {
      "id": "pistis",
      "category": "faith",
      "greek": "πίστις",
      "transliteration": "pistis",
      "strongs": "G4102",
      "shortDef": "faith, belief, trust, faithfulness",
      "title": "Faith as Trust and Faithfulness",
      "summary": "Πίστις is one of the most theologically loaded terms in the NT. While often translated simply as 'faith' or 'belief,' it encompasses trust, confidence, faithfulness, and the content of what is believed. In Paul especially, it becomes the central term for humanity's proper response to God's grace.",
      "classicalGreek": "In classical Greek, πίστις primarily meant 'trust' or 'confidence' in persons or things. It could refer to the reliability that evokes trust, hence 'faithfulness' or 'trustworthiness.' In commercial contexts, it meant 'credit' or 'guarantee.' The verb πιστεύω meant 'to trust' or 'to believe someone.'",
      "lxxBackground": "The LXX uses πίστις to translate Hebrew אֱמוּנָה (ʾemunah), which fundamentally means 'firmness' or 'reliability.' In Habakkuk 2:4 ('the righteous shall live by his faith/faithfulness'), the term connects to covenant fidelity. The OT emphasis is on God's faithfulness (Deut 32:4) and the corresponding human response of trusting faithfulness.",
      "intertestamental": "In Second Temple Judaism, πίστις took on additional nuances. In 1 Maccabees, it often means 'loyalty' or 'fidelity.' In Philo, it becomes more philosophical - the highest virtue by which the soul clings to God. The Qumran community emphasized 'faith' as commitment to the community's interpretation of Torah.",
      "ntUsage": "Paul transforms πίστις into the central soteriological term. In Romans and Galatians, faith is set against works of the law as the means of justification (Rom 3:28; Gal 2:16). Yet it is never mere intellectual assent - it involves trust, commitment, and ongoing faithfulness. The 'obedience of faith' (Rom 1:5; 16:26) shows that genuine faith produces obedience. In Hebrews 11, πίστις is defined as 'the substance of things hoped for, the evidence of things not seen' - an active confidence that shapes life. James insists that faith without works is dead (Jas 2:17), emphasizing that genuine πίστις necessarily produces action.",
      "keyPassages": [
        {
          "reference": "Romans 3:22",
          "greek": "δικαιοσύνη δὲ θεοῦ διὰ πίστεως Ἰησοῦ Χριστοῦ",
          "significance": "The righteousness of God comes 'through faith in/of Jesus Christ.' The genitive πίστεως Ἰησοῦ Χριστοῦ is debated - is it faith IN Christ (objective genitive) or Christ's own faithfulness (subjective genitive)? Either way, Christ is central to faith."
        },
        {
          "reference": "Galatians 2:20",
          "greek": "ζῶ δὲ οὐκέτι ἐγώ, ζῇ δὲ ἐν ἐμοὶ Χριστός· ὃ δὲ νῦν ζῶ ἐν σαρκί, ἐν πίστει ζῶ τῇ τοῦ υἱοῦ τοῦ θεοῦ",
          "significance": "Faith is not just initial belief but the ongoing principle of Christian life. Paul lives 'by faith in the Son of God' - faith shapes the whole of existence."
        },
        {
          "reference": "Hebrews 11:1",
          "greek": "Ἔστιν δὲ πίστις ἐλπιζομένων ὑπόστασις, πραγμάτων ἔλεγχος οὐ βλεπομένων",
          "significance": "Faith is defined as substantive reality (ὑπόστασις) and proof (ἔλεγχος) - not wishful thinking but confident assurance that grasps unseen realities."
        }
      ],
      "theologicalSignificance": "Πίστις in the NT represents humanity's proper response to God's self-revelation in Christ. It is the empty hand that receives grace, yet it is never passive - genuine faith transforms life and produces obedience. The Reformers rightly emphasized that we are justified by faith alone (sola fide), but this faith is never alone - it works through love (Gal 5:6). Faith unites the believer to Christ, so that His righteousness becomes ours. In this sense, faith is not a meritorious work but the God-given means by which we receive Christ and all His benefits.",
      "relatedWords": [
        {
          "greek": "πιστεύω",
          "transliteration": "pisteuō",
          "relationship": "Verb form: 'to believe, trust, have faith'"
        },
        {
          "greek": "πιστός",
          "transliteration": "pistos",
          "relationship": "Adjective: 'faithful, believing, trustworthy'"
        },
        {
          "greek": "ἀπιστία",
          "transliteration": "apistia",
          "relationship": "Negation: 'unbelief, unfaithfulness'"
        }
      ],
      "tags": ["essential", "pauline", "reformation", "soteriology"],
      "volume": 6,
      "pages": "174-228"
    },
    {
      "id": "dikaiosyne",
      "category": "salvation",
      "greek": "δικαιοσύνη",
      "transliteration": "dikaiosynē",
      "strongs": "G1343",
      "shortDef": "righteousness, justice, justification",
      "title": "The Righteousness of God",
      "summary": "Δικαιοσύνη is the NT term for righteousness or justice. In Paul, 'the righteousness of God' (δικαιοσύνη θεοῦ) becomes the heart of the gospel - both God's own righteous character and the right standing He gives to believers through Christ.",
      "classicalGreek": "In classical Greek, δικαιοσύνη was the cardinal virtue of giving to each their due. For Plato, it was the harmony of the soul's parts; for Aristotle, the virtue of proper social relations. It encompassed legal justice, fairness, and moral rectitude.",
      "lxxBackground": "The LXX uses δικαιοσύνη primarily for צְדָקָה (tsedaqah), which in Hebrew thought is essentially relational - right standing within the covenant. God's righteousness is His faithfulness to His covenant promises and His saving action on behalf of His people (Ps 98:2; Isa 46:13). Human righteousness is covenant faithfulness.",
      "intertestamental": "In Second Temple Judaism, righteousness became increasingly associated with Torah observance. The Qumran community spoke of 'the Teacher of Righteousness' and emphasized righteous living according to their strict interpretation. 4 Ezra struggles with how humans can be righteous before a holy God.",
      "ntUsage": "Paul's doctrine of righteousness revolutionizes the concept. In Romans 1:17, 'the righteousness of God' is revealed in the gospel - not primarily as a condemning standard but as a saving gift. Romans 3:21-26 explains that God demonstrates His righteousness by justifying sinners through Christ's atoning sacrifice. This righteousness is received 'by faith' (Rom 3:22) and 'apart from law' (Rom 3:21). The result is that believers are 'declared righteous' (justified) - they receive a right standing with God not based on their own works but on Christ's perfect obedience. Yet this forensic declaration leads to actual righteousness of life (Rom 6:13, 18).",
      "keyPassages": [
        {
          "reference": "Romans 1:17",
          "greek": "δικαιοσύνη γὰρ θεοῦ ἐν αὐτῷ ἀποκαλύπτεται ἐκ πίστεως εἰς πίστιν",
          "significance": "The righteousness of God is 'revealed' in the gospel - this was Luther's breakthrough. It is not merely demanded but given, received by faith."
        },
        {
          "reference": "Romans 3:21-22",
          "greek": "νυνὶ δὲ χωρὶς νόμου δικαιοσύνη θεοῦ πεφανέρωται... διὰ πίστεως Ἰησοῦ Χριστοῦ",
          "significance": "God's righteousness is manifested 'apart from the law' - a new age has dawned where righteousness comes through Christ, not Torah."
        },
        {
          "reference": "2 Corinthians 5:21",
          "greek": "τὸν μὴ γνόντα ἁμαρτίαν ὑπὲρ ἡμῶν ἁμαρτίαν ἐποίησεν, ἵνα ἡμεῖς γενώμεθα δικαιοσύνη θεοῦ ἐν αὐτῷ",
          "significance": "The great exchange: Christ became sin so that we might become 'the righteousness of God' in Him. Union with Christ is the basis of imputed righteousness."
        }
      ],
      "theologicalSignificance": "The δικαιοσύνη θεοῦ encompasses both God's own righteous character and His gift of right standing to believers. God is both 'just and the justifier' (Rom 3:26). This righteousness is forensic (a legal declaration) but not fictional - it is grounded in Christ's actual obedience and creates real transformation. The Reformation recovered this truth: sinners are justified not by infused righteousness but by Christ's righteousness imputed to them through faith. Yet justified sinners are also being sanctified - declared righteous and made righteous.",
      "relatedWords": [
        {
          "greek": "δικαιόω",
          "transliteration": "dikaioō",
          "relationship": "Verb: 'to justify, declare righteous'"
        },
        {
          "greek": "δίκαιος",
          "transliteration": "dikaios",
          "relationship": "Adjective: 'righteous, just'"
        },
        {
          "greek": "δικαίωσις",
          "transliteration": "dikaiōsis",
          "relationship": "The act of justifying, acquittal"
        }
      ],
      "tags": ["essential", "pauline", "reformation", "soteriology"],
      "volume": 2,
      "pages": "192-210"
    },
    {
      "id": "charis",
      "category": "salvation",
      "greek": "χάρις",
      "transliteration": "charis",
      "strongs": "G5485",
      "shortDef": "grace, favor, kindness, gift",
      "title": "Grace: God's Unmerited Favor",
      "summary": "Χάρις is the distinctively Christian term for God's undeserved favor toward sinners. While the word existed in Greek culture, Paul fills it with new meaning: grace is not just divine goodwill but God's active, saving power that rescues the undeserving and transforms them.",
      "classicalGreek": "In classical Greek, χάρις had a range of meanings: 'grace' or 'charm' (as a quality that pleases), 'goodwill' or 'favor' (from a superior to an inferior), 'gratitude' (the response to favor), and 'a gift' or 'benefit.' The Graces (Χάριτες) were goddesses of charm and beauty. The term implied reciprocity - favor given expected favor returned.",
      "lxxBackground": "The LXX uses χάρις primarily for Hebrew חֵן (chen), meaning 'favor' or 'grace.' It describes finding favor in someone's eyes (Gen 6:8; 18:3). However, the LXX also uses χάρις for חֶסֶד (chesed), God's covenant love and faithfulness. The OT emphasis is on God's gracious initiative in choosing and redeeming Israel despite their unworthiness.",
      "intertestamental": "Sirach uses χάρις extensively for divine favor and human gratitude. The Qumran Hodayot (thanksgiving hymns) emphasize that salvation is entirely by God's grace. 4 Ezra wrestles with whether God's grace or human merit determines salvation. These texts show the tension that Paul's gospel would resolve.",
      "ntUsage": "Paul makes χάρις the central category for understanding salvation. Grace is God's favor shown to sinners who deserve only wrath (Rom 3:24; Eph 2:8-9). It is the opposite of works - if by grace, then not by works (Rom 11:6). Yet grace is not merely an attitude but a power that reigns (Rom 5:21), teaches believers to live godly (Titus 2:11-12), and is sufficient for every need (2 Cor 12:9). Believers stand in grace (Rom 5:2), grow in grace (2 Pet 3:18), and must not receive it in vain (2 Cor 6:1). The gospel itself is called 'the gospel of the grace of God' (Acts 20:24).",
      "keyPassages": [
        {
          "reference": "Ephesians 2:8-9",
          "greek": "τῇ γὰρ χάριτί ἐστε σεσῳσμένοι διὰ πίστεως· καὶ τοῦτο οὐκ ἐξ ὑμῶν, θεοῦ τὸ δῶρον· οὐκ ἐξ ἔργων, ἵνα μή τις καυχήσηται",
          "significance": "The definitive statement: salvation is by grace through faith, not from ourselves but God's gift, not by works. All boasting is excluded."
        },
        {
          "reference": "Romans 5:20-21",
          "greek": "οὗ δὲ ἐπλεόνασεν ἡ ἁμαρτία, ὑπερεπερίσσευσεν ἡ χάρις... ἡ χάρις βασιλεύσῃ διὰ δικαιοσύνης",
          "significance": "Grace 'super-abounds' over sin and 'reigns' through righteousness. Grace is not just sufficient but overwhelming, not passive but powerful."
        },
        {
          "reference": "2 Corinthians 12:9",
          "greek": "ἀρκεῖ σοι ἡ χάρις μου· ἡ γὰρ δύναμις ἐν ἀσθενείᾳ τελεῖται",
          "significance": "Grace is sufficient and is perfected in weakness. This shows grace as ongoing power for Christian living, not just initial salvation."
        }
      ],
      "theologicalSignificance": "Χάρις demolishes all human boasting and establishes God's sovereignty in salvation. It is not a response to human merit but its very opposite - given to the undeserving. Yet grace is not cheap; it cost Christ everything. Grace received produces gratitude and transformation, not license (Rom 6:1-2). The Reformation slogans sola gratia (grace alone) and soli Deo gloria (to God alone be glory) capture the NT teaching: salvation is entirely God's gracious work, and He alone deserves credit.",
      "relatedWords": [
        {
          "greek": "χαρίζομαι",
          "transliteration": "charizomai",
          "relationship": "Verb: 'to give freely, forgive, grant'"
        },
        {
          "greek": "χάρισμα",
          "transliteration": "charisma",
          "relationship": "A gift of grace, spiritual gift"
        },
        {
          "greek": "εὐχαριστία",
          "transliteration": "eucharistia",
          "relationship": "Thanksgiving, gratitude (response to grace)"
        }
      ],
      "tags": ["essential", "pauline", "reformation", "soteriology"],
      "volume": 9,
      "pages": "372-402"
    },
    {
      "id": "agape",
      "category": "ethics",
      "greek": "ἀγάπη",
      "transliteration": "agapē",
      "strongs": "G26",
      "shortDef": "love (divine, selfless, unconditional)",
      "title": "Divine Love in Action",
      "summary": "Ἀγάπη is the distinctively Christian word for love. While it existed before Christianity, the NT fills it with new meaning: the self-giving, sacrificial love of God shown in Christ, which becomes the model and power for Christian love toward God and neighbor.",
      "classicalGreek": "In classical Greek, ἀγαπάω was the least common of the love words. Ἔρως denoted passionate, romantic love; φιλία described friendship and affection; στοργή meant natural family affection. Ἀγαπάω was colorless by comparison - 'to be content with' or 'to prefer.' It lacked the warmth of φιλέω. The LXX and NT would transform this weakness into a strength.",
      "lxxBackground": "The LXX uses ἀγαπάω/ἀγάπη to translate אָהֵב (ahev), the primary Hebrew word for love. This covers God's love for Israel (Deut 7:8; Hos 11:1), human love for God (Deut 6:5), and love for neighbor (Lev 19:18). The Shema's command to love God 'with all your heart' becomes the foundation for NT teaching. God's ἀγάπη for Israel is electing, covenant-keeping love.",
      "intertestamental": "Philo uses ἀγάπη for love of God and virtue. The Testaments of the Twelve Patriarchs emphasize loving God and neighbor. However, ἀγάπη remained relatively rare. It was Christianity that would make it the supreme term for love.",
      "ntUsage": "The NT revolutionizes ἀγάπη. God's love is definitively revealed in Christ's death for sinners (Rom 5:8; 1 John 4:10). This love is not sentimental but costly - it gives the Son (John 3:16). God's love is the source of salvation (Eph 2:4-5). Believers are commanded to love as they have been loved (John 13:34; 1 John 4:11). Love fulfills the law (Rom 13:10; Gal 5:14). It is the greatest of the virtues (1 Cor 13:13), the bond of perfection (Col 3:14), and the evidence of genuine conversion (1 John 3:14). Without love, even the greatest spiritual gifts are worthless (1 Cor 13:1-3).",
      "keyPassages": [
        {
          "reference": "John 3:16",
          "greek": "οὕτως γὰρ ἠγάπησεν ὁ θεὸς τὸν κόσμον, ὥστε τὸν υἱὸν τὸν μονογενῆ ἔδωκεν",
          "significance": "The summary of the gospel: God's love is measured by His gift of the Son. 'So loved' (οὕτως ἠγάπησεν) emphasizes the manner and extent of divine love."
        },
        {
          "reference": "Romans 5:8",
          "greek": "συνίστησιν δὲ τὴν ἑαυτοῦ ἀγάπην εἰς ἡμᾶς ὁ θεός, ὅτι ἔτι ἁμαρτωλῶν ὄντων ἡμῶν Χριστὸς ὑπὲρ ἡμῶν ἀπέθανεν",
          "significance": "God's love is demonstrated (συνίστησιν - 'commends,' 'proves') in Christ's death for sinners - not the lovable but the unlovely."
        },
        {
          "reference": "1 Corinthians 13:4-7",
          "greek": "ἡ ἀγάπη μακροθυμεῖ, χρηστεύεται ἡ ἀγάπη...",
          "significance": "Love is defined by its actions, not feelings. Paul's description provides a moral portrait that is ultimately a portrait of Christ Himself."
        },
        {
          "reference": "1 John 4:8",
          "greek": "ὁ θεὸς ἀγάπη ἐστίν",
          "significance": "The ultimate statement: 'God is love.' Love is not merely what God does but who He is. His essential nature is self-giving love."
        }
      ],
      "theologicalSignificance": "Ἀγάπη is Christianity's distinctive contribution to ethics. It is not natural affection or romantic passion but deliberate, sacrificial commitment to another's good. This love originates in God, is revealed in Christ, and is poured into believers' hearts by the Spirit (Rom 5:5). It is both gift and command - we love because He first loved us (1 John 4:19), yet we are commanded to love (John 13:34). Christian love extends even to enemies (Matt 5:44) because it imitates God who loved His enemies. Love is the fulfillment of the law and the distinguishing mark of Christ's disciples (John 13:35).",
      "relatedWords": [
        {
          "greek": "ἀγαπάω",
          "transliteration": "agapaō",
          "relationship": "Verb: 'to love' (with deliberate choice)"
        },
        {
          "greek": "ἀγαπητός",
          "transliteration": "agapētos",
          "relationship": "Adjective: 'beloved' (used of Christ and believers)"
        },
        {
          "greek": "φιλέω",
          "transliteration": "phileō",
          "relationship": "Related: 'to love' with affection and friendship"
        }
      ],
      "tags": ["essential", "johannine", "pauline", "ethics"],
      "volume": 1,
      "pages": "21-55"
    },
    {
      "id": "basileia",
      "category": "eschatology",
      "greek": "βασιλεία",
      "transliteration": "basileia",
      "strongs": "G932",
      "shortDef": "kingdom, reign, royal rule",
      "title": "The Kingdom of God",
      "summary": "Βασιλεία τοῦ θεοῦ ('the kingdom of God') is the central theme of Jesus' preaching. It refers primarily not to a realm or territory but to God's dynamic, kingly rule breaking into history through Jesus. The kingdom is both present and future, already inaugurated and not yet consummated.",
      "classicalGreek": "In classical Greek, βασιλεία meant 'kingship,' 'royal rule,' or 'kingdom' (the realm ruled). It emphasized the authority and sovereignty of the king. The word could denote both the abstract concept of royal power and the concrete territory under that power.",
      "lxxBackground": "The LXX uses βασιλεία for Hebrew מַלְכוּת (malkut). God's kingship is eternal (Ps 145:13) and will be manifested over all nations (Ps 22:28). The prophets anticipated a future when God would establish His reign decisively - the Day of the LORD when God would be 'king over all the earth' (Zech 14:9). Daniel 7:14 pictures the Son of Man receiving an everlasting kingdom.",
      "intertestamental": "Second Temple Judaism eagerly anticipated God's kingdom. Some expected a political restoration of Davidic monarchy; others envisioned cosmic transformation. The Qumran community believed they were living in the last days before God's decisive intervention. The Psalms of Solomon pray for God to establish His kingdom through the Messiah. There was no single 'kingdom' expectation but rather a variety of hopes for God's final triumph.",
      "ntUsage": "Jesus announces that the kingdom of God 'has come near' (Mark 1:15). Through His ministry - teaching, healing, casting out demons - God's reign is breaking in (Matt 12:28). Yet the kingdom is also future - believers pray 'Your kingdom come' (Matt 6:10) and will inherit it (Matt 25:34). This 'already/not yet' tension is central: the kingdom is inaugurated in Jesus' first coming but will be consummated at His return. In John, eternal life largely replaces kingdom language but represents the same reality. Paul speaks of inheriting the kingdom (1 Cor 6:9-10; Gal 5:21) and of Christ's kingdom being handed over to the Father (1 Cor 15:24).",
      "keyPassages": [
        {
          "reference": "Mark 1:15",
          "greek": "πεπλήρωται ὁ καιρὸς καὶ ἤγγικεν ἡ βασιλεία τοῦ θεοῦ",
          "significance": "Jesus' programmatic announcement: the time is fulfilled, the kingdom has drawn near. The decisive moment in God's plan has arrived."
        },
        {
          "reference": "Matthew 12:28",
          "greek": "εἰ δὲ ἐν πνεύματι θεοῦ ἐγὼ ἐκβάλλω τὰ δαιμόνια, ἄρα ἔφθασεν ἐφʼ ὑμᾶς ἡ βασιλεία τοῦ θεοῦ",
          "significance": "Jesus' exorcisms prove the kingdom 'has come upon you' (ἔφθασεν). God's reign is present in Jesus' Spirit-empowered ministry."
        },
        {
          "reference": "Luke 17:20-21",
          "greek": "οὐκ ἔρχεται ἡ βασιλεία τοῦ θεοῦ μετὰ παρατηρήσεως... ἰδοὺ γὰρ ἡ βασιλεία τοῦ θεοῦ ἐντὸς ὑμῶν ἐστιν",
          "significance": "The kingdom does not come with observable signs but is 'in your midst' (or 'within you'). It is present where Jesus is present."
        }
      ],
      "theologicalSignificance": "The βασιλεία τοῦ θεοῦ is God's sovereign rule actualized in history through Jesus Christ. It is primarily dynamic (God reigning) rather than static (a territory). Jesus is both the proclaimer and the presence of the kingdom - where He is, God's rule is present. Entry into the kingdom requires repentance and faith (Mark 1:15), new birth (John 3:3), and becomes as a child (Mark 10:15). The kingdom creates a new community living under God's rule now while awaiting its final manifestation. The Lord's Prayer captures the tension: the kingdom is coming and we pray for its full arrival.",
      "relatedWords": [
        {
          "greek": "βασιλεύς",
          "transliteration": "basileus",
          "relationship": "Noun: 'king' - Jesus is the King of this kingdom"
        },
        {
          "greek": "βασιλεύω",
          "transliteration": "basileuō",
          "relationship": "Verb: 'to reign' - both God and Christ reign"
        }
      ],
      "tags": ["essential", "synoptic", "eschatology", "christology"],
      "volume": 1,
      "pages": "564-593"
    },
    {
      "id": "pneuma",
      "category": "pneumatology",
      "greek": "πνεῦμα",
      "transliteration": "pneuma",
      "strongs": "G4151",
      "shortDef": "spirit, Spirit, wind, breath",
      "title": "The Holy Spirit",
      "summary": "Πνεῦμα is used for the Spirit of God, the Holy Spirit, the human spirit, and spirits (angelic or demonic). In the NT, the Holy Spirit is the divine person through whom God acts in creation, revelation, and redemption - the empowering presence of God in believers.",
      "classicalGreek": "In classical Greek, πνεῦμα meant 'wind,' 'breath,' or 'air in motion.' Philosophically, it could refer to the vital principle of life. The Stoics conceived of πνεῦμα as the divine rational principle pervading all things. However, πνεῦμα was not a major religious term in Greek religion.",
      "lxxBackground": "The LXX uses πνεῦμα primarily for רוּחַ (ruach), which means 'wind,' 'breath,' or 'spirit.' God's רוּחַ creates (Gen 1:2; Ps 33:6), gives life (Gen 2:7), empowers leaders (Judg 6:34; 1 Sam 16:13), and inspires prophets (Num 11:25; Ezek 11:5). The prophets promised a future outpouring of the Spirit (Joel 2:28-29; Ezek 36:26-27) that would transform God's people.",
      "intertestamental": "The Wisdom of Solomon personifies God's Spirit. The Dead Sea Scrolls speak of a 'spirit of truth' and 'spirit of falsehood.' There is increasing interest in the Spirit's eschatological role. Generally, however, the Spirit was seen as largely absent in the present age, awaiting the messianic era.",
      "ntUsage": "The NT presents the Spirit's eschatological outpouring as fulfilled. At Pentecost, the Spirit comes in power (Acts 2), marking the new age. The Spirit regenerates (John 3:5-8), indwells believers (1 Cor 6:19), produces fruit (Gal 5:22-23), gives gifts (1 Cor 12:4-11), and guarantees future inheritance (Eph 1:13-14). The Spirit witnesses to Christ (John 15:26), teaches truth (John 16:13), and enables believers to cry 'Abba, Father' (Rom 8:15). Paul's letters develop a rich pneumatology: life in the Spirit versus flesh (Rom 8:1-17), the Spirit as the mode of Christian existence (Gal 5:16-25).",
      "keyPassages": [
        {
          "reference": "John 14:16-17",
          "greek": "κἀγὼ ἐρωτήσω τὸν πατέρα καὶ ἄλλον παράκλητον δώσει ὑμῖν... τὸ πνεῦμα τῆς ἀληθείας",
          "significance": "Jesus promises 'another Advocate' (ἄλλον παράκλητον) - the Spirit is personal and continues Jesus' ministry as 'the Spirit of truth.'"
        },
        {
          "reference": "Acts 2:4",
          "greek": "ἐπλήσθησαν πάντες πνεύματος ἁγίου καὶ ἤρξαντο λαλεῖν ἑτέραις γλώσσαις",
          "significance": "The Spirit's eschatological outpouring fulfills Joel's prophecy. The new covenant age has begun."
        },
        {
          "reference": "Romans 8:14-16",
          "greek": "ὅσοι γὰρ πνεύματι θεοῦ ἄγονται, οὗτοι υἱοὶ θεοῦ εἰσιν... αὐτὸ τὸ πνεῦμα συμμαρτυρεῖ τῷ πνεύματι ἡμῶν ὅτι ἐσμὲν τέκνα θεοῦ",
          "significance": "The Spirit leads believers, witnesses to their adoption, and enables them to call God 'Abba' - intimate relational language."
        }
      ],
      "theologicalSignificance": "The Holy Spirit is the third person of the Trinity, fully divine, co-equal with Father and Son. The Spirit is the agent of application - He applies Christ's work to believers through regeneration, sanctification, and glorification. Life 'in the Spirit' is the normal Christian mode of existence. The Spirit empowers mission (Acts 1:8), creates community (1 Cor 12:13), and produces Christlike character (Gal 5:22-23). The Spirit is the 'down payment' (ἀρραβών) of future glory (2 Cor 1:22; Eph 1:14) - present experience of coming consummation.",
      "relatedWords": [
        {
          "greek": "πνευματικός",
          "transliteration": "pneumatikos",
          "relationship": "Adjective: 'spiritual' - pertaining to the Spirit"
        },
        {
          "greek": "χάρισμα",
          "transliteration": "charisma",
          "relationship": "Spiritual gift given by the Spirit"
        },
        {
          "greek": "παράκλητος",
          "transliteration": "paraklētos",
          "relationship": "Advocate, Helper - title for the Spirit in John"
        }
      ],
      "tags": ["essential", "johannine", "pauline", "pneumatology"],
      "volume": 6,
      "pages": "332-455"
    },
    {
      "id": "ekklesia",
      "category": "ecclesiology",
      "greek": "ἐκκλησία",
      "transliteration": "ekklēsia",
      "strongs": "G1577",
      "shortDef": "church, assembly, congregation",
      "title": "The Church: God's Called-Out Assembly",
      "summary": "Ἐκκλησία, from ἐκ ('out') and καλέω ('to call'), denotes an assembly of people called out. In the NT, it refers to the gathered community of believers in Christ - both local congregations and the universal church comprising all believers.",
      "classicalGreek": "In classical Greek, ἐκκλησία was the regular assembly of citizens in a Greek city-state, summoned by the herald for political deliberation. It was a democratic gathering where citizens discussed and decided matters of public concern. The word carried civic, not primarily religious, connotations.",
      "lxxBackground": "The LXX uses ἐκκλησία to translate קָהָל (qahal), the assembly of Israel gathered before God. Key instances include the 'day of the assembly' at Sinai (Deut 9:10; 18:16), when Israel received the law. The ἐκκλησία κυρίου ('assembly of the LORD') was Israel as the covenant community gathered for worship and hearing God's word.",
      "intertestamental": "The Qumran community saw themselves as the true קָהָל/ἐκκλησία, the remnant of faithful Israel. The term continued to denote the gathered community in contrast to the corrupt majority. Jewish synagogues used different terminology (συναγωγή), though the concepts overlapped.",
      "ntUsage": "Jesus promises to build His ἐκκλησία (Matt 16:18). After Pentecost, believers are called the ἐκκλησία - both local congregations (1 Cor 1:2; Gal 1:2) and the universal body of believers (Eph 1:22-23; Col 1:18). Paul develops rich ecclesiology: the church is Christ's body (1 Cor 12:27), the temple of the Spirit (1 Cor 3:16-17; Eph 2:21-22), Christ's bride (Eph 5:25-27), and God's household (1 Tim 3:15). The church is neither a building nor an institution but the people of God gathered by the gospel.",
      "keyPassages": [
        {
          "reference": "Matthew 16:18",
          "greek": "ἐπὶ ταύτῃ τῇ πέτρᾳ οἰκοδομήσω μου τὴν ἐκκλησίαν",
          "significance": "Jesus' foundational promise: He will build His church, and the gates of Hades will not prevail against it. The church is Christ's own building project."
        },
        {
          "reference": "Ephesians 1:22-23",
          "greek": "αὐτὸν ἔδωκεν κεφαλὴν ὑπὲρ πάντα τῇ ἐκκλησίᾳ, ἥτις ἐστὶν τὸ σῶμα αὐτοῦ",
          "significance": "Christ is head over all things 'for the church,' which is His body, the fullness of Him who fills all in all. Cosmic lordship is for the church's benefit."
        },
        {
          "reference": "Ephesians 5:25-27",
          "greek": "Χριστὸς ἠγάπησεν τὴν ἐκκλησίαν καὶ ἑαυτὸν παρέδωκεν ὑπὲρ αὐτῆς",
          "significance": "Christ loved the church and gave Himself for her - the church as bride, the object of Christ's self-sacrificing love."
        }
      ],
      "theologicalSignificance": "The ἐκκλησία is the new covenant community, the continuation and fulfillment of Israel as God's people (Gal 6:16; 1 Pet 2:9-10). It is both local and universal - every local gathering is the church, yet all believers together constitute one church. Christ is the head; believers are members of His body, mutually interdependent. The church is gathered by the Word, marked by the sacraments, and characterized by mutual love and discipline. It exists between the times - redeemed but not yet perfected, a colony of heaven in a hostile world, witnessing to Christ until He returns.",
      "relatedWords": [
        {
          "greek": "συναγωγή",
          "transliteration": "synagōgē",
          "relationship": "Related term: 'synagogue,' assembly - used for Jewish gatherings"
        },
        {
          "greek": "κοινωνία",
          "transliteration": "koinōnia",
          "relationship": "Fellowship, communion - characteristic of the church"
        },
        {
          "greek": "σῶμα",
          "transliteration": "sōma",
          "relationship": "Body - the church as Christ's body"
        }
      ],
      "tags": ["essential", "pauline", "ecclesiology"],
      "volume": 3,
      "pages": "501-536"
    },
    {
      "id": "hamartia",
      "category": "hamartiology",
      "greek": "ἁμαρτία",
      "transliteration": "hamartia",
      "strongs": "G266",
      "shortDef": "sin, missing the mark, offense",
      "title": "Sin: Missing God's Mark",
      "summary": "Ἁμαρτία is the primary NT word for sin. Originally meaning 'to miss the mark' in archery, it encompasses humanity's failure to meet God's standard, rebellion against His will, and the resulting state of alienation from God. Paul especially develops sin as a power that enslaves humanity.",
      "classicalGreek": "In classical Greek, ἁμαρτάνω meant 'to miss' (a target), 'to fail,' or 'to make a mistake.' It could describe any failure to achieve a goal, including intellectual error. The word did not carry heavy moral or religious weight - it was more about failure than guilt.",
      "lxxBackground": "The LXX uses ἁμαρτία primarily for חַטָּאת (chattat), which covers the whole range of sinful acts and states. The OT presents sin as transgression of God's law (Lev 4-5), rebellion against God's authority (Isa 1:2), and violation of the covenant relationship. Sin brings guilt, defilement, and requires atonement through sacrifice.",
      "intertestamental": "Second Temple literature develops elaborate taxonomies of sin. 1 Enoch explores the origin of sin through fallen angels. 4 Ezra wrestles with sin's origin in Adam and its consequences for all humanity. The Qumran texts emphasize ritual and moral purity, with detailed rules to avoid defilement. There is growing sense that sin is a cosmic problem requiring divine solution.",
      "ntUsage": "Paul radicalizes the doctrine of sin. In Romans 1-3, he demonstrates that all - Gentile and Jew - are 'under sin' (Rom 3:9). Sin is not just individual acts but a power that entered the world through Adam (Rom 5:12), reigns over humanity (Rom 5:21; 6:12), enslaves (Rom 6:6, 17, 20), and brings death (Rom 6:23). The law, unable to save, actually increases sin's trespass (Rom 5:20; 7:7-13). Only Christ's death can deal with sin's power (Rom 8:3). In John, sin is primarily unbelief - rejection of the light that has come into the world (John 16:9). Sin results in bondage (John 8:34), from which only the Son can free.",
      "keyPassages": [
        {
          "reference": "Romans 3:23",
          "greek": "πάντες γὰρ ἥμαρτον καὶ ὑστεροῦνται τῆς δόξης τοῦ θεοῦ",
          "significance": "Universal indictment: all have sinned and fall short of God's glory. The verdict applies to every human being without exception."
        },
        {
          "reference": "Romans 6:23",
          "greek": "τὰ γὰρ ὀψώνια τῆς ἁμαρτίας θάνατος",
          "significance": "Sin pays wages (ὀψώνια) - it is personified as a slave master who compensates servants with death. But God's gift is eternal life."
        },
        {
          "reference": "Romans 7:17",
          "greek": "νυνὶ δὲ οὐκέτι ἐγὼ κατεργάζομαι αὐτὸ ἀλλὰ ἡ οἰκοῦσα ἐν ἐμοὶ ἁμαρτία",
          "significance": "Sin 'dwells' in the person like an alien power. This is not excuse but analysis - sin's power is internal and pervasive."
        }
      ],
      "theologicalSignificance": "Ἁμαρτία in Paul is not just wrong actions but a malignant power that holds humanity captive. It entered through Adam (Rom 5:12), uses the law to provoke rebellion (Rom 7:8), and produces death. This radical diagnosis explains why only a radical remedy - Christ's death - can save. Sin is both act and state, guilt and power. Justification deals with sin's guilt; sanctification addresses its power. Only in the resurrection will sin's presence be finally removed. The doctrine of sin is the dark background against which grace shines most brightly.",
      "relatedWords": [
        {
          "greek": "ἁμαρτάνω",
          "transliteration": "hamartanō",
          "relationship": "Verb: 'to sin, miss the mark'"
        },
        {
          "greek": "ἁμαρτωλός",
          "transliteration": "hamartōlos",
          "relationship": "Noun/adjective: 'sinner, sinful'"
        },
        {
          "greek": "παράβασις",
          "transliteration": "parabasis",
          "relationship": "Transgression - stepping over a known boundary"
        }
      ],
      "tags": ["essential", "pauline", "hamartiology"],
      "volume": 1,
      "pages": "267-339"
    },
    {
      "id": "kyrios",
      "category": "christology",
      "greek": "κύριος",
      "transliteration": "kyrios",
      "strongs": "G2962",
      "shortDef": "lord, master, Lord (divine title)",
      "title": "Jesus as Lord",
      "summary": "Κύριος is the supreme christological title. While it can mean simply 'sir' or 'master,' when applied to Jesus it carries the weight of the divine name YHWH. To confess 'Jesus is Lord' is to acknowledge His divine authority, worship Him, and submit to His reign.",
      "classicalGreek": "In classical Greek, κύριος denoted one with power or authority - an owner, master, or guardian. It was used for those with legal power over property or persons. The feminine κυρία meant 'mistress.' The term implied authority that required submission.",
      "lxxBackground": "The LXX's most significant use of κύριος is as the standard translation of YHWH, God's covenant name. Where the Hebrew has the Tetragrammaton, the LXX typically reads κύριος. Thus κύριος became the Greek equivalent of the divine name. It also translates אָדוֹן (adon, 'lord'), but the primary association is with YHWH Himself.",
      "intertestamental": "Jewish writers continued using κύριος for God while avoiding the divine name. Philo regularly calls God κύριος. The term maintained its association with divine authority. In the Greco-Roman world, κύριος was increasingly used for rulers and emperors, setting up the conflict between 'Caesar is Lord' and 'Jesus is Lord.'",
      "ntUsage": "The earliest Christian confession was Κύριος Ἰησοῦς - 'Jesus is Lord' (Rom 10:9; 1 Cor 12:3). Paul applies OT κύριος texts directly to Jesus (Rom 10:13 quoting Joel 2:32; Phil 2:10-11 quoting Isa 45:23). Jesus has 'the name above every name' (Phil 2:9). The confession is salvific (Rom 10:9) and must be Spirit-enabled (1 Cor 12:3). As Lord, Jesus is worthy of worship, prayer, and absolute obedience. His lordship encompasses all creation (Phil 2:10-11) and will be fully manifest at His return.",
      "keyPassages": [
        {
          "reference": "Romans 10:9",
          "greek": "ἐὰν ὁμολογήσῃς ἐν τῷ στόματί σου κύριον Ἰησοῦν καὶ πιστεύσῃς ἐν τῇ καρδίᾳ σου... σωθήσῃ",
          "significance": "Confession that Jesus is Lord, combined with heart-faith in resurrection, brings salvation. This is the foundational Christian confession."
        },
        {
          "reference": "Philippians 2:9-11",
          "greek": "διὸ καὶ ὁ θεὸς αὐτὸν ὑπερύψωσεν... ἵνα πᾶσα γλῶσσα ἐξομολογήσηται ὅτι κύριος Ἰησοῦς Χριστός",
          "significance": "God exalted Jesus and gave Him the name (κύριος = YHWH) so that every tongue will confess His lordship - quoting Isaiah 45:23 about YHWH."
        },
        {
          "reference": "1 Corinthians 8:6",
          "greek": "ἡμῖν εἷς θεὸς ὁ πατὴρ... καὶ εἷς κύριος Ἰησοῦς Χριστός",
          "significance": "Reformulating the Shema: one God, the Father; one Lord, Jesus Christ. Jesus is included in the divine identity as κύριος."
        }
      ],
      "theologicalSignificance": "The confession Κύριος Ἰησοῦς is nothing less than the acknowledgment of Christ's deity. By applying YHWH texts to Jesus, the NT writers include Him in the unique divine identity. He shares the divine name, receives divine worship, and exercises divine authority. The title demands total allegiance - one cannot confess Jesus as Lord while living as though Caesar (or self, or anything else) is lord. His lordship is cosmic in scope and will be universally acknowledged at the eschaton.",
      "relatedWords": [
        {
          "greek": "κυριότης",
          "transliteration": "kyriotēs",
          "relationship": "Lordship, dominion - the authority of the Lord"
        },
        {
          "greek": "κυριεύω",
          "transliteration": "kyrieuō",
          "relationship": "Verb: 'to rule, be lord over'"
        },
        {
          "greek": "μαρανα θα",
          "transliteration": "marana tha",
          "relationship": "Aramaic: 'Our Lord, come!' - early prayer to Jesus as Lord"
        }
      ],
      "tags": ["essential", "pauline", "christology", "worship"],
      "volume": 3,
      "pages": "1039-1098"
    },
    {
      "id": "logos",
      "category": "revelation",
      "greek": "λόγος",
      "transliteration": "logos",
      "strongs": "G3056",
      "shortDef": "word, reason, message, the Word (Christ)",
      "title": "The Word: Divine Revelation",
      "summary": "Λόγος has a vast range of meaning: 'word,' 'speech,' 'reason,' 'account,' 'message.' In John's prologue, it becomes a title for Christ: the eternal Word who was with God, was God, and became flesh. As λόγος, Christ is God's ultimate self-revelation.",
      "classicalGreek": "In classical Greek, λόγος had an extraordinarily wide range: 'word,' 'speech,' 'discourse,' 'argument,' 'reason,' 'proportion,' 'account.' For Heraclitus, the Λόγος was the cosmic principle of rationality underlying all things. Stoic philosophy developed this: the Λόγος was the divine reason permeating the universe, making it intelligible. Greek thought thus associated λόγος with divine rationality.",
      "lxxBackground": "The LXX uses λόγος frequently, especially for דָּבָר (dabar), God's 'word.' God's word is creative (Gen 1: 'And God said...'; Ps 33:6), prophetic (introducing prophetic oracles), and effective - it accomplishes what God intends (Isa 55:11). The 'word of the LORD' comes to prophets and through them to Israel. Wisdom literature personifies Wisdom (Prov 8) in ways that anticipate Logos christology.",
      "intertestamental": "Philo of Alexandria made λόγος central to his philosophical theology. For him, the Λόγος was God's instrument of creation, the pattern of the cosmos, the mediator between the transcendent God and the material world. While Philo's Logos is impersonal, his speculation provides background for John's appropriation of the term. Wisdom of Solomon similarly personifies wisdom as God's creative agent.",
      "ntUsage": "John 1:1-18 presents Christ as the Λόγος - eternally with God, Himself God, the agent of creation, and the one who became flesh. This Prologue draws on both Greek philosophical tradition and Jewish wisdom/word theology to present Christ as the ultimate revelation of God. Throughout the NT, λόγος commonly means the gospel message (Acts 6:4; 1 Thess 1:6), God's word in Scripture (Mark 7:13), or simply speech. But John's christological use towers over all others.",
      "keyPassages": [
        {
          "reference": "John 1:1",
          "greek": "Ἐν ἀρχῇ ἦν ὁ λόγος, καὶ ὁ λόγος ἦν πρὸς τὸν θεόν, καὶ θεὸς ἦν ὁ λόγος",
          "significance": "The majestic opening: the Word's eternal pre-existence, personal distinction from yet deity with the Father. θεὸς without the article stresses divine nature/quality."
        },
        {
          "reference": "John 1:14",
          "greek": "Καὶ ὁ λόγος σὰρξ ἐγένετο καὶ ἐσκήνωσεν ἐν ἡμῖν",
          "significance": "The incarnation: the eternal Word became flesh and 'tabernacled' (ἐσκήνωσεν) among us. God's glory now dwells in human form."
        },
        {
          "reference": "Hebrews 4:12",
          "greek": "ζῶν γὰρ ὁ λόγος τοῦ θεοῦ καὶ ἐνεργὴς καὶ τομώτερος ὑπὲρ πᾶσαν μάχαιραν δίστομον",
          "significance": "God's word (here likely Scripture) is living, active, and penetrating. Whether Word incarnate or word inscripturated, God's revelation is powerful."
        }
      ],
      "theologicalSignificance": "Christ as Λόγος means He is God's final and fullest self-revelation. God has spoken in many ways, but ultimately He speaks in His Son (Heb 1:1-2). The Λόγος was eternally with God (distinct person) and was God (shared deity). In creation He was the Father's agent; in incarnation He revealed the Father perfectly ('Whoever has seen me has seen the Father' - John 14:9). Greek philosophy sought ultimate Reason; Jewish faith awaited God's final Word. In Christ, both find fulfillment. He is the Truth that makes us free, the Life that conquers death, the Word that speaks God's heart.",
      "relatedWords": [
        {
          "greek": "ῥῆμα",
          "transliteration": "rhēma",
          "relationship": "A word as spoken, a saying - particular utterances"
        },
        {
          "greek": "λέγω",
          "transliteration": "legō",
          "relationship": "Verb: 'to say, speak'"
        },
        {
          "greek": "λόγιον",
          "transliteration": "logion",
          "relationship": "An oracle, divine utterance - especially Scripture"
        }
      ],
      "tags": ["essential", "johannine", "christology", "revelation"],
      "volume": 4,
      "pages": "69-143"
    },
    {
      "id": "soteria",
      "category": "salvation",
      "greek": "σωτηρία",
      "transliteration": "sōtēria",
      "strongs": "G4991",
      "shortDef": "salvation, deliverance, preservation",
      "title": "Salvation: Divine Rescue",
      "summary": "Σωτηρία encompasses the full scope of God's saving work: deliverance from sin's penalty, power, and presence; rescue from wrath; and bestowal of eternal life. It is past (justification), present (sanctification), and future (glorification) - already accomplished and not yet consummated.",
      "classicalGreek": "In classical Greek, σωτηρία meant 'deliverance,' 'preservation,' or 'safety' - often from physical danger like battle, shipwreck, or disease. The σωτήρ (savior) was one who rescued from peril. The word had religious overtones when applied to gods who delivered worshipers, and political overtones when applied to rulers who saved their people.",
      "lxxBackground": "The LXX uses σωτηρία for יְשׁוּעָה (yeshu'ah) and related words. God is Israel's salvation (Exod 15:2; Ps 27:1). He saves from enemies, exile, and death. The name 'Jesus' (Ἰησοῦς) derives from this root - 'YHWH saves.' Isaiah especially develops salvation eschatologically: God will bring final deliverance, gathering His people and establishing justice (Isa 52:7-10).",
      "intertestamental": "Second Temple texts continue the theme of divine deliverance. The Psalms of Solomon pray for God's salvation through the Messiah. Qumran looked for eschatological salvation through God's decisive intervention. There is increasing focus on salvation from sin and its consequences, not just physical enemies.",
      "ntUsage": "The NT announces that God's salvation has arrived in Jesus Christ. The name 'Jesus' declares His mission: 'He will save His people from their sins' (Matt 1:21). Salvation encompasses forgiveness (Acts 2:38), reconciliation (Rom 5:10), redemption (Eph 1:7), and eternal life (John 3:16). It is by grace through faith (Eph 2:8-9), not by works. Believers are saved (past - Eph 2:8), being saved (present - 1 Cor 1:18), and will be saved (future - Rom 5:9-10). The full scope of salvation awaits Christ's return (Rom 13:11; Heb 9:28).",
      "keyPassages": [
        {
          "reference": "Acts 4:12",
          "greek": "καὶ οὐκ ἔστιν ἐν ἄλλῳ οὐδενὶ ἡ σωτηρία",
          "significance": "Salvation is in no one else - only in Jesus. The exclusivity of Christ as Savior is foundational."
        },
        {
          "reference": "Romans 1:16",
          "greek": "δύναμις γὰρ θεοῦ ἐστιν εἰς σωτηρίαν παντὶ τῷ πιστεύοντι",
          "significance": "The gospel is God's power for salvation to everyone who believes. Salvation is powerful, universal in offer, and received by faith."
        },
        {
          "reference": "Philippians 2:12",
          "greek": "μετὰ φόβου καὶ τρόμου τὴν ἑαυτῶν σωτηρίαν κατεργάζεσθε",
          "significance": "Work out your salvation with fear and trembling - salvation received must be lived out. Yet God is at work in you (v. 13)."
        }
      ],
      "theologicalSignificance": "Σωτηρία is comprehensive rescue. It addresses humanity's fundamental problems: guilt before a holy God, bondage to sin's power, alienation from God and others, and subjection to death. God in Christ accomplishes salvation objectively; the Spirit applies it subjectively. Salvation is entirely of grace - we contribute nothing but our sin. Yet salvation transforms - those saved from sin's penalty are being saved from sin's power and will be saved from sin's presence. The already/not yet structure means believers live in hope, pressing toward the full salvation to be revealed.",
      "relatedWords": [
        {
          "greek": "σῴζω",
          "transliteration": "sōzō",
          "relationship": "Verb: 'to save, rescue, deliver, heal'"
        },
        {
          "greek": "σωτήρ",
          "transliteration": "sōtēr",
          "relationship": "Noun: 'Savior' - title for God and Christ"
        },
        {
          "greek": "σωτήριον",
          "transliteration": "sōtērion",
          "relationship": "Adjective/noun: 'saving, salvation'"
        }
      ],
      "tags": ["essential", "pauline", "soteriology"],
      "volume": 7,
      "pages": "965-1024"
    },
    {
      "id": "anastasis",
      "category": "eschatology",
      "greek": "ἀνάστασις",
      "transliteration": "anastasis",
      "strongs": "G386",
      "shortDef": "resurrection, rising up",
      "title": "Resurrection: Victory Over Death",
      "summary": "Ἀνάστασις (from ἀνίστημι, 'to raise up') denotes resurrection from the dead. Christ's resurrection is the foundation of Christian faith and the guarantee of believers' future resurrection. It is not mere resuscitation but transformation to immortal, glorious bodily life.",
      "classicalGreek": "In classical Greek, ἀνάστασις simply meant 'rising' or 'standing up' - getting up from a seat or bed. It could also mean 'removal' or 'destruction' (causing something to rise and depart). The concept of resurrection from death was foreign to mainstream Greek thought, which viewed the soul's immortality as desirable escape from the body.",
      "lxxBackground": "The LXX uses ἀνάστασις rarely for resurrection per se, but the concept develops in later OT texts. Daniel 12:2 promises that many sleeping in the dust will awake - some to everlasting life, others to shame. Isaiah 26:19 envisions the dead living, bodies rising. The hope for resurrection emerges especially in response to martyrdom (2 Macc 7).",
      "intertestamental": "By Jesus' time, resurrection was a major theological issue. Pharisees affirmed bodily resurrection; Sadducees denied it (Mark 12:18; Acts 23:8). The Qumran community apparently believed in resurrection. 2 Maccabees 7 powerfully expresses hope in resurrection for martyrs. 1 Enoch and other apocalyptic texts elaborate resurrection scenarios. Jewish resurrection hope was for bodily, not merely spiritual, existence.",
      "ntUsage": "Christ's resurrection is the cornerstone of NT faith (1 Cor 15:14, 17). The Gospels narrate the empty tomb and appearances. Paul receives and passes on the tradition (1 Cor 15:3-8). Christ is 'firstfruits' of those who have died (1 Cor 15:20) - His resurrection guarantees ours. The resurrection body is transformed: imperishable, glorious, powerful, spiritual (1 Cor 15:42-44). Jesus is 'the resurrection and the life' (John 11:25). Believers already share in resurrection life spiritually (Rom 6:4; Eph 2:6) while awaiting bodily resurrection at Christ's return.",
      "keyPassages": [
        {
          "reference": "1 Corinthians 15:20",
          "greek": "νυνὶ δὲ Χριστὸς ἐγήγερται ἐκ νεκρῶν, ἀπαρχὴ τῶν κεκοιμημένων",
          "significance": "Christ has been raised as 'firstfruits' - the first sheaf guaranteeing the full harvest. His resurrection ensures ours."
        },
        {
          "reference": "John 11:25-26",
          "greek": "ἐγώ εἰμι ἡ ἀνάστασις καὶ ἡ ζωή· ὁ πιστεύων εἰς ἐμὲ κἂν ἀποθάνῃ ζήσεται",
          "significance": "Jesus Himself is the resurrection and life. Resurrection is not just an event but a person - He embodies resurrection power."
        },
        {
          "reference": "Philippians 3:10-11",
          "greek": "τοῦ γνῶναι αὐτὸν καὶ τὴν δύναμιν τῆς ἀναστάσεως αὐτοῦ",
          "significance": "Paul's goal: to know Christ and the power of His resurrection. Resurrection power is operative now, transforming believers."
        }
      ],
      "theologicalSignificance": "Ἀνάστασις is God's ultimate answer to death. Christ's resurrection validates His identity and accomplishment - He is declared Son of God with power by resurrection (Rom 1:4). It guarantees justification (Rom 4:25), ensures our future resurrection (1 Cor 15:20-23), and provides present power for holy living (Rom 6:4-11). The resurrection body is not a ghost but transformed physicality - continuous with yet gloriously different from our present bodies. Without resurrection, faith is futile (1 Cor 15:14, 17). With resurrection, death is swallowed up in victory (1 Cor 15:54-57).",
      "relatedWords": [
        {
          "greek": "ἀνίστημι",
          "transliteration": "anistēmi",
          "relationship": "Verb: 'to raise up, rise'"
        },
        {
          "greek": "ἐγείρω",
          "transliteration": "egeirō",
          "relationship": "Verb: 'to raise, wake up' - also used for resurrection"
        },
        {
          "greek": "ζωή",
          "transliteration": "zōē",
          "relationship": "Life - resurrection brings eternal life"
        }
      ],
      "tags": ["essential", "pauline", "johannine", "eschatology"],
      "volume": 1,
      "pages": "368-372"
    },
    {
      "id": "diatheke",
      "category": "covenant",
      "greek": "διαθήκη",
      "transliteration": "diathēkē",
      "strongs": "G1242",
      "shortDef": "covenant, testament, will",
      "title": "The New Covenant",
      "summary": "Διαθήκη is the Greek term for 'covenant' - God's binding commitment to His people. The NT announces a 'new covenant' established by Christ's blood, fulfilling Jeremiah's prophecy and superseding the Mosaic covenant while maintaining continuity with God's promises to Abraham.",
      "classicalGreek": "In classical Greek, διαθήκη typically meant a 'last will and testament' - a disposition of property that takes effect at death. It differed from συνθήκη (a mutual agreement between parties). The διαθήκη was unilateral - the testator alone determined its terms. This nuance shapes NT usage: God's covenant is His sovereign disposition, not a negotiated contract.",
      "lxxBackground": "The LXX uses διαθήκη to translate בְּרִית (berit), 'covenant.' Major covenants include: Noah (Gen 9), Abraham (Gen 15, 17), Moses/Sinai (Exod 19-24), and David (2 Sam 7). Jeremiah 31:31-34 promises a 'new covenant' - not like Sinai, but with the law written on hearts and sins forgiven. This prophecy is foundational for NT covenant theology.",
      "intertestamental": "The Qumran community called themselves 'the community of the new covenant' (or 'renewed covenant'). They believed they were the true covenant people, awaiting God's final intervention. Various texts explored the relationship between old and new covenants, between promise and fulfillment.",
      "ntUsage": "Jesus institutes the new covenant at the Last Supper: 'This cup is the new covenant in my blood' (Luke 22:20; 1 Cor 11:25). Hebrews develops covenant theology most fully: Jesus is mediator of a 'better covenant' based on better promises (Heb 8:6), established by His blood (Heb 9:15-22). The old covenant is 'obsolete' (Heb 8:13), replaced by the new. Paul contrasts the ministry of the old covenant (letter, death, condemnation) with the new (Spirit, life, righteousness - 2 Cor 3). Yet the Abrahamic covenant, based on promise and received by faith, remains valid (Gal 3).",
      "keyPassages": [
        {
          "reference": "Luke 22:20",
          "greek": "τοῦτο τὸ ποτήριον ἡ καινὴ διαθήκη ἐν τῷ αἵματί μου",
          "significance": "Jesus establishes the new covenant at the Last Supper. His blood ratifies what Jeremiah prophesied."
        },
        {
          "reference": "Hebrews 8:6",
          "greek": "νῦν δὲ διαφορωτέρας τέτυχεν λειτουργίας, ὅσῳ καὶ κρείττονός ἐστιν διαθήκης μεσίτης",
          "significance": "Jesus has a superior ministry as mediator of a better covenant. The new surpasses the old in every way."
        },
        {
          "reference": "Hebrews 9:15",
          "greek": "διὰ τοῦτο διαθήκης καινῆς μεσίτης ἐστίν, ὅπως θανάτου γενομένου... τὴν ἐπαγγελίαν λάβωσιν οἱ κεκλημένοι τῆς αἰωνίου κληρονομίας",
          "significance": "Christ's death redeems transgressions under the old covenant and secures the promised eternal inheritance. Both testamental senses of διαθήκη operate."
        }
      ],
      "theologicalSignificance": "The διαθήκη structure reveals God's sovereign grace in salvation. He initiates, defines terms, and binds Himself. The new covenant fulfills the old without nullifying God's promises. What the Mosaic covenant could not do (bring transformation and forgiveness), the new covenant accomplishes through Christ's blood and Spirit. Believers are ministers of the new covenant (2 Cor 3:6). The Lord's Supper perpetually proclaims covenant reality. Reformed theology rightly emphasizes covenant as the framework for understanding Scripture's unity and the continuity between testaments.",
      "relatedWords": [
        {
          "greek": "διατίθημι",
          "transliteration": "diatithēmi",
          "relationship": "Verb: 'to make a covenant, ordain, bequeath'"
        },
        {
          "greek": "ἐπαγγελία",
          "transliteration": "epangelia",
          "relationship": "Promise - the content of covenant commitments"
        },
        {
          "greek": "κληρονομία",
          "transliteration": "klēronomia",
          "relationship": "Inheritance - what the covenant secures"
        }
      ],
      "tags": ["essential", "hebrews", "covenant", "pauline"],
      "volume": 2,
      "pages": "106-134"
    },
    {
      "id": "sarx",
      "category": "anthropology",
      "greek": "σάρξ",
      "transliteration": "sarx",
      "strongs": "G4561",
      "shortDef": "flesh (physical body, human nature, sinful nature)",
      "title": "Flesh: Human Nature Under Sin",
      "summary": "Σάρξ has multiple meanings: physical flesh/body, human nature in its weakness, and (especially in Paul) humanity in its fallen, sinful condition. The flesh/Spirit contrast is central to Paul's ethics. The Word became σάρξ (John 1:14) - taking genuine human nature, though without sin.",
      "classicalGreek": "In classical Greek, σάρξ meant the soft tissue of the body, the muscular flesh as opposed to bone. It could refer to the body generally and, by extension, to physical or sensual life. It was a neutral term for physical existence.",
      "lxxBackground": "The LXX uses σάρξ primarily for בָּשָׂר (basar), which means 'flesh,' 'body,' or 'all living creatures.' It emphasizes human frailty and mortality: 'all flesh is grass' (Isa 40:6). 'Flesh and blood' denotes human nature in its limitation. There is some development toward using flesh for the sinful tendency, but this is more pronounced in the NT.",
      "intertestamental": "The Qumran texts speak of the 'spirit of flesh' in negative terms. There is growing dualistic tendency, though not Gnostic rejection of matter. The Dead Sea Scrolls show awareness of human weakness and sinfulness often expressed through 'flesh' language. Philo uses σάρξ for the lower, sensual nature.",
      "ntUsage": "The NT uses σάρξ in multiple senses: (1) Physical body/flesh (Luke 24:39; Heb 5:7). (2) Human nature/existence - the Word became flesh (John 1:14); Christ came in the flesh (1 Tim 3:16). (3) Human weakness and mortality (Gal 2:20: 'the life I now live in the flesh'). (4) The sinful nature in opposition to the Spirit (Gal 5:16-17; Rom 8:5-8). This last usage is distinctively Pauline: the flesh produces sin's works and is hostile to God. Victory comes through the Spirit, not through self-effort. Yet flesh is not inherently evil - Christ came 'in the flesh' (1 John 4:2).",
      "keyPassages": [
        {
          "reference": "John 1:14",
          "greek": "Καὶ ὁ λόγος σὰρξ ἐγένετο",
          "significance": "The Word became flesh - genuine human nature. This refutes docetism: Christ took real humanity, not a phantom body."
        },
        {
          "reference": "Romans 8:7-8",
          "greek": "διότι τὸ φρόνημα τῆς σαρκὸς ἔχθρα εἰς θεόν... οἱ δὲ ἐν σαρκὶ ὄντες θεῷ ἀρέσαι οὐ δύνανται",
          "significance": "The mind of the flesh is hostility toward God; those in the flesh cannot please God. Flesh here is the sinful nature, not mere physicality."
        },
        {
          "reference": "Galatians 5:16-17",
          "greek": "πνεύματι περιπατεῖτε καὶ ἐπιθυμίαν σαρκὸς οὐ μὴ τελέσητε. ἡ γὰρ σὰρξ ἐπιθυμεῖ κατὰ τοῦ πνεύματος",
          "significance": "Walk by the Spirit and you will not fulfill the flesh's desire. Flesh and Spirit are in opposition - this is the battleground of Christian living."
        }
      ],
      "theologicalSignificance": "Paul's use of σάρξ for the sinful nature revolutionizes the term. It is not that physical matter is evil (that would be Gnosticism), but that human nature apart from God's Spirit is inclined to sin. The flesh is humanity in Adam, under sin's power. Believers have crucified the flesh (Gal 5:24) but still war against it. Victory comes not by self-effort (which is itself 'fleshly') but by the Spirit. The incarnation affirms the goodness of created flesh - Christ took flesh and redeems flesh. Resurrection will be bodily, not escape from flesh.",
      "relatedWords": [
        {
          "greek": "σαρκικός",
          "transliteration": "sarkikos",
          "relationship": "Adjective: 'fleshly, carnal' - pertaining to the flesh"
        },
        {
          "greek": "σῶμα",
          "transliteration": "sōma",
          "relationship": "Body - distinct from but related to flesh"
        },
        {
          "greek": "πνεῦμα",
          "transliteration": "pneuma",
          "relationship": "Spirit - opposed to flesh in Paul's ethics"
        }
      ],
      "tags": ["essential", "pauline", "anthropology"],
      "volume": 7,
      "pages": "98-151"
    },
    {
      "id": "metanoia",
      "category": "faith",
      "greek": "μετάνοια",
      "transliteration": "metanoia",
      "strongs": "G3341",
      "shortDef": "repentance, change of mind",
      "title": "Repentance: Radical Turnaround",
      "summary": "Μετάνοια (from μετά, 'after' + νοέω, 'to think') literally means 'afterthought' or 'change of mind.' In biblical usage, it denotes far more than intellectual revision: it is a radical reorientation of life, turning from sin to God. Repentance is essential for salvation and continues throughout the Christian life.",
      "classicalGreek": "In classical Greek, μετάνοια simply meant 'change of mind' or 'afterthought.' It could refer to regret over a decision but lacked strong moral connotations. It was cognitive rather than moral or religious. The verb μεταμέλομαι (also 'to regret') was more common for emotional regret.",
      "lxxBackground": "The LXX uses μετάνοια and μετανοέω for שׁוּב (shuv), 'to turn, return.' The prophets called Israel to 'return' to YHWH (Jer 3:12; Hos 6:1). This was not just intellectual change but covenant renewal - turning from idolatry and injustice back to faithful relationship with God. Repentance was corporate as well as individual.",
      "intertestamental": "Second Temple Judaism developed elaborate penitential practices. The Prayer of Manasseh (in some canons) is a penitential prayer. Sirach 17:24-26 calls sinners to return to God. Qumran emphasized repentance for entry into the community. John the Baptist stands in this tradition, calling for 'a baptism of repentance for forgiveness of sins' (Mark 1:4).",
      "ntUsage": "John the Baptist and Jesus both begin with 'Repent!' (Matt 3:2; 4:17). Repentance is not optional but essential - without it, one perishes (Luke 13:3, 5). It involves turning from sin (Acts 8:22; Rev 2:5) and turning to God (Acts 26:20). Repentance is a gift from God (Acts 5:31; 11:18; 2 Tim 2:25). It is linked with faith (Mark 1:15; Acts 20:21) and produces appropriate fruit (Matt 3:8; Acts 26:20). The NT holds together human responsibility to repent and divine sovereignty in granting repentance.",
      "keyPassages": [
        {
          "reference": "Mark 1:15",
          "greek": "μετανοεῖτε καὶ πιστεύετε ἐν τῷ εὐαγγελίῳ",
          "significance": "Jesus' inaugural proclamation: repent and believe. Repentance and faith are twin requirements for entering the kingdom."
        },
        {
          "reference": "Acts 2:38",
          "greek": "μετανοήσατε καὶ βαπτισθήτω ἕκαστος ὑμῶν",
          "significance": "Peter's Pentecost response: repent and be baptized. Repentance is the first step of response to the gospel."
        },
        {
          "reference": "2 Corinthians 7:10",
          "greek": "ἡ γὰρ κατὰ θεὸν λύπη μετάνοιαν εἰς σωτηρίαν ἀμεταμέλητον ἐργάζεται",
          "significance": "Godly grief produces repentance leading to salvation without regret. True repentance is wrought by God and leads to life."
        }
      ],
      "theologicalSignificance": "Μετάνοια is the human side of conversion (faith being the other side). It is not mere regret (Judas had that) but radical reorientation. It involves the mind (new understanding of sin and God), the emotions (godly sorrow), and the will (turning from sin to God). Repentance is not a work that earns salvation but the posture of the empty-handed beggar receiving grace. It is both initial (entering the kingdom) and ongoing (the Christian life as continued repentance). Reformation theology captured this: the whole life of believers is one of repentance (Luther's first thesis).",
      "relatedWords": [
        {
          "greek": "μετανοέω",
          "transliteration": "metanoeō",
          "relationship": "Verb: 'to repent, change one's mind'"
        },
        {
          "greek": "ἐπιστροφή",
          "transliteration": "epistrophē",
          "relationship": "Conversion, turning - complementary term for repentance"
        },
        {
          "greek": "μεταμέλομαι",
          "transliteration": "metamelomai",
          "relationship": "To regret, feel remorse - less than true repentance"
        }
      ],
      "tags": ["essential", "synoptic", "pauline", "faith"],
      "volume": 4,
      "pages": "975-1008"
    },
    {
      "id": "apolytrosis",
      "category": "salvation",
      "greek": "ἀπολύτρωσις",
      "transliteration": "apolytrōsis",
      "strongs": "G629",
      "shortDef": "redemption, release, deliverance",
      "title": "Redemption: Purchased Freedom",
      "summary": "Ἀπολύτρωσις denotes redemption through the payment of a ransom price. In Christ, believers are redeemed from sin's slavery, purchased by His blood. Redemption has past, present, and future dimensions: we are redeemed, are being redeemed, and await the redemption of our bodies.",
      "classicalGreek": "In classical Greek, ἀπολύτρωσις referred to the release of prisoners or slaves through ransom payment (λύτρον). A captive's freedom was purchased at a price. The word group conveyed deliverance through the expenditure of resources - liberation that cost something.",
      "lxxBackground": "The OT background is crucial. God 'redeemed' Israel from Egyptian slavery (Exod 6:6; Deut 7:8). The גָּאַל (ga'al) system allowed the kinsman-redeemer to purchase back a relative sold into slavery (Lev 25:47-49). The פָּדָה (padah) system involved ransoming the firstborn (Exod 13:13). Israel's identity as redeemed people shapes their relationship with God.",
      "intertestamental": "Expectations grew for a future redemption greater than the Exodus. God would redeem Israel from exile and oppression. The Psalms of Solomon (8:33; 9:1) pray for this redemption. Some texts spiritualize redemption as liberation from sin, not just foreign powers.",
      "ntUsage": "The NT announces that God's redemption has come in Christ. Believers have 'redemption through His blood, the forgiveness of sins' (Eph 1:7; Col 1:14). Christ gave Himself as a 'ransom for all' (1 Tim 2:6). We are 'bought with a price' (1 Cor 6:20; 7:23). Redemption is past (accomplished at the cross), present (applied in Christian experience), and future ('the redemption of our bodies' - Rom 8:23). The ransom price is Christ's blood/life (Mark 10:45; 1 Pet 1:18-19).",
      "keyPassages": [
        {
          "reference": "Ephesians 1:7",
          "greek": "ἐν ᾧ ἔχομεν τὴν ἀπολύτρωσιν διὰ τοῦ αἵματος αὐτοῦ, τὴν ἄφεσιν τῶν παραπτωμάτων",
          "significance": "We HAVE redemption through Christ's blood - present possession. Redemption is further defined as forgiveness of trespasses."
        },
        {
          "reference": "Romans 3:24",
          "greek": "δικαιούμενοι δωρεὰν τῇ αὐτοῦ χάριτι διὰ τῆς ἀπολυτρώσεως τῆς ἐν Χριστῷ Ἰησοῦ",
          "significance": "Justified freely by grace through the redemption in Christ Jesus. Redemption is the means of our free justification."
        },
        {
          "reference": "Mark 10:45",
          "greek": "ὁ υἱὸς τοῦ ἀνθρώπου... δοῦναι τὴν ψυχὴν αὐτοῦ λύτρον ἀντὶ πολλῶν",
          "significance": "The Son of Man came to give His life as a ransom (λύτρον) for many. Jesus Himself taught His death as ransom payment."
        }
      ],
      "theologicalSignificance": "Ἀπολύτρωσις teaches that salvation costs. We were slaves to sin; Christ purchased our freedom. The price was not silver or gold but His precious blood (1 Pet 1:18-19). This language answers: How can a just God forgive sinners? Through redemption - a price paid, justice satisfied, slaves set free. The question of 'to whom the ransom is paid' may press the metaphor too far, but the point is clear: our liberation required costly sacrifice. Redemption creates obligation: we belong to the One who bought us and should glorify Him (1 Cor 6:20).",
      "relatedWords": [
        {
          "greek": "λύτρον",
          "transliteration": "lytron",
          "relationship": "Ransom - the price paid for release"
        },
        {
          "greek": "λυτρόω",
          "transliteration": "lytroō",
          "relationship": "Verb: 'to redeem, set free by paying ransom'"
        },
        {
          "greek": "ἀγοράζω",
          "transliteration": "agorazō",
          "relationship": "To buy in the marketplace - purchase imagery for redemption"
        }
      ],
      "tags": ["essential", "pauline", "soteriology"],
      "volume": 4,
      "pages": "328-356"
    },
    {
      "id": "koinonia",
      "category": "ecclesiology",
      "greek": "κοινωνία",
      "transliteration": "koinōnia",
      "strongs": "G2842",
      "shortDef": "fellowship, communion, participation, sharing",
      "title": "Fellowship: Shared Life in Christ",
      "summary": "Κοινωνία denotes participation, sharing, or fellowship. It describes believers' relationship with Christ and one another: sharing in Christ's sufferings and glory, participating in the Spirit, and expressing this through mutual care. The Lord's Supper is κοινωνία in Christ's body and blood.",
      "classicalGreek": "In classical Greek, κοινωνία meant 'partnership,' 'participation,' or 'communion.' It described business partnerships, marriage bonds, and any sharing in common activities or goods. The adjective κοινός meant 'common' - what belongs to all. Κοινωνία emphasized active participation, not mere association.",
      "lxxBackground": "The LXX uses κοινωνία rarely. However, the concept of Israel as a covenant community sharing in God's blessings underlies the term. The OT emphasizes God's people as a community bound together by shared covenant relationship.",
      "intertestamental": "The Qumran community practiced radical sharing of possessions and saw themselves as bound together in covenant fellowship. The concept of the 'community' (יַחַד, yachad) as sharing life together provides background for early Christian κοινωνία.",
      "ntUsage": "Acts 2:42 lists κοινωνία among the marks of the early church. Believers share in Christ (1 Cor 1:9), the Spirit (2 Cor 13:14; Phil 2:1), Christ's sufferings (Phil 3:10), and the gospel (Phil 1:5). This vertical fellowship produces horizontal fellowship - sharing possessions (Acts 2:44-45; 4:32), supporting ministry (Phil 4:15; Gal 6:6), and collecting for the poor (Rom 15:26; 2 Cor 8:4). The Lord's Supper is κοινωνία in Christ's body and blood (1 Cor 10:16). There is also false κοινωνία - with demons (1 Cor 10:20) or darkness (2 Cor 6:14) - which believers must avoid.",
      "keyPassages": [
        {
          "reference": "1 Corinthians 1:9",
          "greek": "πιστὸς ὁ θεός, δι᾽ οὗ ἐκλήθητε εἰς κοινωνίαν τοῦ υἱοῦ αὐτοῦ Ἰησοῦ Χριστοῦ",
          "significance": "Called into fellowship with His Son - participation in Christ is the foundation of all Christian κοινωνία."
        },
        {
          "reference": "1 Corinthians 10:16",
          "greek": "τὸ ποτήριον τῆς εὐλογίας ὃ εὐλογοῦμεν, οὐχὶ κοινωνία ἐστὶν τοῦ αἵματος τοῦ Χριστοῦ;",
          "significance": "The cup is participation in Christ's blood; the bread in His body. The Supper is κοινωνία with Christ and one another."
        },
        {
          "reference": "Philippians 2:1-2",
          "greek": "εἴ τις κοινωνία πνεύματος... πληρώσατέ μου τὴν χαρὰν ἵνα τὸ αὐτὸ φρονῆτε",
          "significance": "Fellowship in the Spirit should produce unity of mind. Vertical κοινωνία issues in horizontal unity."
        }
      ],
      "theologicalSignificance": "Κοινωνία is not superficial 'fellowship' (coffee and donuts) but profound participation in Christ and one another. It is trinitarian: fellowship with the Father, Son (1 John 1:3), and Spirit (2 Cor 13:14). It is practical: sharing resources with those in need. It is sacramental: participation in Christ through Word and Supper. The church is not merely an organization but an organism, bound together by shared life in Christ. This κοινωνία is both gift (we have been brought into it) and task (we must maintain and express it).",
      "relatedWords": [
        {
          "greek": "κοινωνός",
          "transliteration": "koinōnos",
          "relationship": "Noun: 'partner, sharer, participant'"
        },
        {
          "greek": "κοινωνέω",
          "transliteration": "koinōneō",
          "relationship": "Verb: 'to share, participate, have fellowship'"
        },
        {
          "greek": "κοινός",
          "transliteration": "koinos",
          "relationship": "Adjective: 'common, shared' (or 'unclean' in Jewish usage)"
        }
      ],
      "tags": ["essential", "pauline", "ecclesiology"],
      "volume": 3,
      "pages": "789-809"
    },
    {
      "id": "hilasterion",
      "category": "salvation",
      "greek": "ἱλαστήριον",
      "transliteration": "hilastērion",
      "strongs": "G2435",
      "shortDef": "propitiation, mercy seat, place of atonement",
      "title": "Propitiation: The Mercy Seat of Christ",
      "summary": "Ἱλαστήριον refers to the 'mercy seat' - the golden cover of the ark where God met His people. In Romans 3:25, Christ is presented as the ἱλαστήριον, the place where God's wrath is satisfied and His mercy made available through the blood of the cross.",
      "classicalGreek": "In classical Greek, ἱλάσκομαι meant 'to appease' or 'propitiate' the gods. Ἱλαστήριον was used for propitiatory offerings or monuments. The focus was on human action to placate divine anger. Pagan religion assumed the gods needed to be won over through sacrifices and rituals.",
      "lxxBackground": "The LXX uses ἱλαστήριον 21 times for the כַּפֹּרֶת (kapporeth), the 'mercy seat' atop the ark of the covenant (Ex 25:17-22). On Yom Kippur, the high priest sprinkled blood on the ἱλαστήριον (Lev 16:14-15). This was where God's presence dwelt and where atonement occurred. The LXX transformed the term from pagan appeasement to covenant mercy.",
      "intertestamental": "4 Maccabees 17:22 describes the martyrs' deaths as a ἱλαστήριον for Israel. Philo interprets the mercy seat allegorically as God's mercy overcoming judgment. The concept of atoning sacrifice for sin remained central to Jewish piety.",
      "ntUsage": "Romans 3:25 is the key text: God presented Christ as ἱλαστήριον through faith in His blood. This may mean Christ is the antitype of the OT mercy seat - the true meeting place between God and sinners - or that His death is the ultimate propitiatory sacrifice. Either way, Christ's blood turns away divine wrath and establishes peace. Hebrews 9:5 uses ἱλαστήριον for the literal mercy seat, while discussing Christ as the true high priest who offers the ultimate sacrifice.",
      "keyPassages": [
        {
          "reference": "Romans 3:25",
          "greek": "ὃν προέθετο ὁ θεὸς ἱλαστήριον διὰ πίστεως ἐν τῷ αὐτοῦ αἵματι",
          "significance": "God presented Christ as the propitiation/mercy seat - the place where wrath is satisfied and sinners find mercy."
        },
        {
          "reference": "Hebrews 9:5",
          "greek": "ὑπεράνω δὲ αὐτῆς Χερουβὶν δόξης κατασκιάζοντα τὸ ἱλαστήριον",
          "significance": "The OT mercy seat overshadowed by cherubim - the type that Christ fulfills."
        },
        {
          "reference": "1 John 2:2",
          "greek": "αὐτὸς ἱλασμός ἐστιν περὶ τῶν ἁμαρτιῶν ἡμῶν",
          "significance": "Christ Himself is the ἱλασμός (propitiation) for sins - not just for believers but for the whole world."
        }
      ],
      "theologicalSignificance": "Ἱλαστήριον teaches that God's wrath against sin is real but satisfied in Christ. Unlike pagan propitiation (humans appeasing gods), biblical propitiation has God providing the sacrifice. The mercy seat was where God's holy presence met sinful humanity through blood. Christ is now that meeting place. His death is both the sacrifice and the location of atonement. This guards against cheap grace (God's wrath is real) and despair (His wrath is satisfied). The term is crucial for understanding penal substitutionary atonement.",
      "relatedWords": [
        {
          "greek": "ἱλασμός",
          "transliteration": "hilasmos",
          "relationship": "Propitiation, atoning sacrifice (1 John 2:2; 4:10)"
        },
        {
          "greek": "ἱλάσκομαι",
          "transliteration": "hilaskomai",
          "relationship": "To propitiate, make atonement (Luke 18:13; Heb 2:17)"
        },
        {
          "greek": "ἵλεως",
          "transliteration": "hileōs",
          "relationship": "Merciful, gracious (Matt 16:22; Heb 8:12)"
        }
      ],
      "tags": ["essential", "pauline", "atonement", "day-of-atonement"],
      "volume": 3,
      "pages": "300-323"
    },
    {
      "id": "katallage",
      "category": "salvation",
      "greek": "καταλλαγή",
      "transliteration": "katallagē",
      "strongs": "G2643",
      "shortDef": "reconciliation, exchange, restoration of relationship",
      "title": "Reconciliation: From Enmity to Peace",
      "summary": "Καταλλαγή describes the restoration of a broken relationship. God, though righteous in His wrath against sin, reconciles enemies to Himself through Christ's death. Reconciliation is God's initiative: He reconciles us to Himself and gives us the ministry of reconciliation.",
      "classicalGreek": "In classical Greek, καταλλάσσω meant 'to exchange' (especially money) or 'to change from enmity to friendship.' It was used for diplomatic reconciliation between warring parties. The prefix κατά intensifies the basic meaning of ἀλλάσσω ('to change'). The term emphasized real change in relationship.",
      "lxxBackground": "The LXX rarely uses this word group, but the concept of reconciliation pervades the OT: broken covenant restored, God's anger turned away, peace established. Hosea's marriage to unfaithful Gomer illustrates God's reconciling love. The Day of Atonement effected reconciliation between God and Israel.",
      "intertestamental": "2 Maccabees 1:5 prays that God would be 'reconciled' (καταλλαγείη) to Israel. The language appears in contexts of restored covenant relationship after Israel's sin. Josephus uses it for political reconciliation.",
      "ntUsage": "Paul's distinctive vocabulary. Romans 5:10-11 declares we were reconciled to God through Christ's death while enemies. 2 Corinthians 5:18-20 develops the ministry of reconciliation: God was in Christ reconciling the world to Himself. Ephesians 2:16 extends this to Jew-Gentile reconciliation in one body. Colossians 1:20-22 speaks of cosmic reconciliation through the blood of the cross. Notably, God always reconciles us to Himself - never the reverse. The enmity is on our side; the initiative is on His.",
      "keyPassages": [
        {
          "reference": "Romans 5:10-11",
          "greek": "εἰ γὰρ ἐχθροὶ ὄντες κατηλλάγημεν τῷ θεῷ διὰ τοῦ θανάτου τοῦ υἱοῦ αὐτοῦ",
          "significance": "While we were enemies, we were reconciled through Christ's death - past tense, accomplished fact."
        },
        {
          "reference": "2 Corinthians 5:19",
          "greek": "θεὸς ἦν ἐν Χριστῷ κόσμον καταλλάσσων ἑαυτῷ",
          "significance": "God was in Christ reconciling the world to Himself - divine initiative and Christological focus."
        },
        {
          "reference": "Colossians 1:20",
          "greek": "δι᾽ αὐτοῦ ἀποκαταλλάξαι τὰ πάντα εἰς αὐτόν",
          "significance": "Through Christ, God reconciles all things - cosmic scope of reconciliation."
        }
      ],
      "theologicalSignificance": "Reconciliation teaches that sin created real enmity between God and humanity. This is not merely subjective alienation but objective hostility. Christ's death removes this enmity and establishes peace. Importantly, God reconciles us to Himself - He is the subject, we are the objects. This guards against the idea that Christ persuades an unwilling Father. Rather, the Father sends the Son precisely to reconcile. Reconciliation is past fact (accomplished at the cross), present experience (received by faith), and future hope (cosmic restoration). Believers now have the 'ministry of reconciliation' - ambassadors pleading with people to be reconciled to God.",
      "relatedWords": [
        {
          "greek": "καταλλάσσω",
          "transliteration": "katallassō",
          "relationship": "Verb: to reconcile, restore to favor"
        },
        {
          "greek": "ἀποκαταλλάσσω",
          "transliteration": "apokatallassō",
          "relationship": "Intensive verb: to reconcile completely (Col 1:20, 22; Eph 2:16)"
        },
        {
          "greek": "εἰρήνη",
          "transliteration": "eirēnē",
          "relationship": "Peace - the result of reconciliation"
        }
      ],
      "tags": ["essential", "pauline", "atonement"],
      "volume": 1,
      "pages": "254-259"
    },
    {
      "id": "doxa",
      "category": "salvation",
      "greek": "δόξα",
      "transliteration": "doxa",
      "strongs": "G1391",
      "shortDef": "glory, splendor, honor, radiant majesty",
      "title": "Glory: The Weight of Divine Splendor",
      "summary": "Δόξα in the NT reflects the Hebrew כָּבוֹד (kabod, 'weight, glory'). It describes God's radiant majesty, Christ's divine nature revealed, and the destiny of believers who will share in this glory. We are saved for glory, being transformed from glory to glory.",
      "classicalGreek": "In classical Greek, δόξα meant 'opinion,' 'reputation,' or 'what one thinks.' It could refer to good reputation or honor. The focus was subjective - what others thought about someone. This is markedly different from the LXX and NT usage.",
      "lxxBackground": "The LXX uses δόξα to translate כָּבוֹד (kabod), meaning 'weight' or 'heaviness' - hence, 'glory.' God's glory appeared in the pillar of cloud and fire (Ex 16:10), filled the tabernacle (Ex 40:34) and temple (1 Kgs 8:11), and was revealed to Isaiah (Isa 6:1-3). This is objective divine radiance, not mere reputation. Ezekiel saw the כָּבוֹד depart from the temple (Ezek 10-11) and promised its return (Ezek 43:1-5).",
      "intertestamental": "Apocalyptic literature emphasized eschatological glory: the righteous will shine like the sun, share in divine splendor. Qumran texts speak of the 'glory of Adam' restored. Rabbinic literature developed the concept of the שְׁכִינָה (Shekinah), God's glorious dwelling presence.",
      "ntUsage": "John 1:14 declares we beheld Christ's glory - the divine kabod now dwelling in human flesh. At the transfiguration, Christ's hidden glory becomes visible (Matt 17:2; 2 Pet 1:17). Romans 3:23 says all have sinned and lack the glory of God. Romans 8:18, 30 promises future glorification as salvation's goal. 2 Corinthians 3:18 describes progressive transformation from glory to glory. Colossians 1:27 identifies 'Christ in you, the hope of glory.' Revelation 21:23 depicts the new Jerusalem lit by God's glory.",
      "keyPassages": [
        {
          "reference": "John 1:14",
          "greek": "καὶ ὁ λόγος σὰρξ ἐγένετο... καὶ ἐθεασάμεθα τὴν δόξαν αὐτοῦ",
          "significance": "The Word became flesh and we beheld His glory - incarnate divine splendor."
        },
        {
          "reference": "Romans 8:30",
          "greek": "οὓς δὲ ἐδικαίωσεν, τούτους καὶ ἐδόξασεν",
          "significance": "Those justified, He also glorified - past tense for our certain future."
        },
        {
          "reference": "2 Corinthians 3:18",
          "greek": "τὴν αὐτὴν εἰκόνα μεταμορφούμεθα ἀπὸ δόξης εἰς δόξαν",
          "significance": "We are being transformed from glory to glory - progressive sanctification toward glorification."
        }
      ],
      "theologicalSignificance": "Δόξα unites Christology and soteriology: Christ is the radiance of God's glory (Heb 1:3), and salvation means sharing in that glory. The fall meant losing God's glory (Rom 3:23); salvation restores it. Glorification is the goal of predestination (Rom 8:29-30), the purpose of creation (Isa 43:7), and the theme of heaven (Rev 21-22). Already we are being transformed into Christ's glorious image; not yet have we received our resurrection bodies. The tension between present transformation and future glorification defines Christian existence.",
      "relatedWords": [
        {
          "greek": "δοξάζω",
          "transliteration": "doxazō",
          "relationship": "Verb: to glorify, honor, magnify"
        },
        {
          "greek": "ἔνδοξος",
          "transliteration": "endoxos",
          "relationship": "Adjective: glorious, honored, splendid"
        },
        {
          "greek": "συνδοξάζω",
          "transliteration": "syndoxazō",
          "relationship": "To be glorified together with (Rom 8:17)"
        }
      ],
      "tags": ["essential", "johannine", "pauline", "christology"],
      "volume": 2,
      "pages": "232-255"
    },
    {
      "id": "christos",
      "category": "christology",
      "greek": "Χριστός",
      "transliteration": "Christos",
      "strongs": "G5547",
      "shortDef": "Christ, Anointed One, Messiah",
      "title": "Christ: The Anointed King, Priest, and Prophet",
      "summary": "Χριστός translates the Hebrew מָשִׁיחַ (Mashiach, 'Anointed One'). In the OT, prophets, priests, and kings were anointed. Jesus is the ultimate fulfillment - anointed with the Spirit to be Prophet, Priest, and King. 'Christ' became virtually a second name for Jesus in the early church.",
      "classicalGreek": "In classical Greek, χρίω meant 'to rub' or 'to anoint' (with oil, perfume). Χριστός as verbal adjective meant 'anointed' or 'smeared.' The term had no special religious significance in pagan usage - anointing was a common practice for athletes, guests, and the dead.",
      "lxxBackground": "The LXX uses χριστός to translate מָשִׁיחַ (mashiach). Anointing set apart kings (1 Sam 16:13; 1 Kgs 1:39), priests (Ex 29:7; Lev 8:12), and sometimes prophets (1 Kgs 19:16). The anointed king was the 'Lord's anointed' (χριστὸς κυρίου, 1 Sam 24:6). The term developed messianic associations through prophetic promises (Ps 2:2; Isa 61:1; Dan 9:25-26).",
      "intertestamental": "Messianic expectation intensified. Psalms of Solomon 17-18 describe a coming Davidic king, the 'Lord's Anointed.' Qumran expected multiple 'messiahs' - priestly and royal. Various messianic figures arose claiming the title. By the first century, 'Messiah' carried strong nationalistic and royal expectations.",
      "ntUsage": "Jesus is identified as the Christ (Matt 16:16; John 1:41). He is anointed with the Spirit at baptism (Luke 4:18; Acts 10:38). Yet He redefines messiahship through suffering (Mark 8:29-31). 'Christ' becomes so closely identified with Jesus that it functions as a name: 'Jesus Christ' or 'Christ Jesus.' Paul uses 'Christ' 383 times, often in phrases like 'in Christ,' 'with Christ,' 'through Christ.' The death and resurrection of Christ become the center of the gospel (1 Cor 15:3-4).",
      "keyPassages": [
        {
          "reference": "Matthew 16:16",
          "greek": "σὺ εἶ ὁ Χριστὸς ὁ υἱὸς τοῦ θεοῦ τοῦ ζῶντος",
          "significance": "Peter's confession: You are the Christ - the decisive identification of Jesus as Messiah."
        },
        {
          "reference": "Acts 2:36",
          "greek": "καὶ κύριον αὐτὸν καὶ Χριστὸν ἐποίησεν ὁ θεός, τοῦτον τὸν Ἰησοῦν",
          "significance": "God has made Jesus both Lord and Christ - messianic identity proclaimed at Pentecost."
        },
        {
          "reference": "1 Corinthians 15:3",
          "greek": "ὅτι Χριστὸς ἀπέθανεν ὑπὲρ τῶν ἁμαρτιῶν ἡμῶν κατὰ τὰς γραφάς",
          "significance": "Christ died for our sins - the title is inseparable from the atoning work."
        }
      ],
      "theologicalSignificance": "Jesus fulfills and transforms messianic expectation. He is the anointed Prophet who speaks God's final word, Priest who offers Himself as sacrifice, and King who reigns through suffering love. His messiahship is 'not of this world' - He comes first to die, then to reign. The term 'Christ' in the NT carries all this weight: the fulfillment of Israel's hopes, the identity of Jesus as God's unique agent, and the pattern of suffering followed by glory. To confess Jesus as Christ is to acknowledge Him as the one in whom God's promises are Yes and Amen.",
      "relatedWords": [
        {
          "greek": "χρίω",
          "transliteration": "chriō",
          "relationship": "Verb: to anoint (Luke 4:18; Acts 4:27; 10:38; Heb 1:9)"
        },
        {
          "greek": "χρῖσμα",
          "transliteration": "chrisma",
          "relationship": "Anointing, unction (1 John 2:20, 27)"
        },
        {
          "greek": "ἀντίχριστος",
          "transliteration": "antichristos",
          "relationship": "Antichrist, one opposed to Christ (1 John 2:18, 22)"
        }
      ],
      "tags": ["essential", "christology", "messianic"],
      "volume": 9,
      "pages": "493-580"
    },
    {
      "id": "huios",
      "category": "christology",
      "greek": "υἱός",
      "transliteration": "huios",
      "strongs": "G5207",
      "shortDef": "son, descendant, one who shares the nature of",
      "title": "Son of God: Unique Divine Relationship",
      "summary": "Υἱός (son) is used supremely of Jesus as the Son of God - not a created being but One who shares the Father's divine nature. This sonship is eternal, unique, and defining: through the Son we become sons by adoption. The Father-Son relationship is central to Trinitarian theology.",
      "classicalGreek": "In classical Greek, υἱός meant 'son' (biological or legal) or could indicate one who shares characteristics of something ('son of thunder,' 'son of disobedience'). Divine sonship for humans was rare and usually metaphorical - great men might be called 'sons of Zeus.'",
      "lxxBackground": "Israel is called God's 'son' (Ex 4:22; Hos 11:1). The Davidic king is adopted as God's son (2 Sam 7:14; Ps 2:7). Angels are 'sons of God' (Job 1:6; 38:7). The righteous individual may be God's son (Wis 2:18). These uses are adoptive or figurative, not ontological. Yet messianic expectation connected divine sonship with the coming king.",
      "intertestamental": "4 Ezra and 1 Enoch use 'Son of Man' messiologically. Qumran texts refer to the coming Messiah using 2 Samuel 7:14. Wisdom literature personifies Wisdom as God's offspring. Philo occasionally uses 'son of God' language for the Logos. These provide background but nothing approaching the NT claims.",
      "ntUsage": "Jesus is uniquely 'the Son' (ὁ υἱός): declared at baptism (Matt 3:17) and transfiguration (Matt 17:5), confessed by Peter (Matt 16:16), claimed by Jesus Himself (Matt 11:27; John 5:19-26). John emphasizes the μονογενής (only-begotten) Son (John 1:14, 18; 3:16). The Son is sent from the Father (Gal 4:4), has unique knowledge of the Father (Matt 11:27), does what the Father does (John 5:19), and is to be honored as the Father is honored (John 5:23). Romans 1:3-4 speaks of Son according to flesh/Spirit. Hebrews 1 contrasts the Son with angels. Believers become sons through the Son (Gal 4:5-6; Rom 8:14-17).",
      "keyPassages": [
        {
          "reference": "John 3:16",
          "greek": "οὕτως γὰρ ἠγάπησεν ὁ θεὸς τὸν κόσμον, ὥστε τὸν υἱὸν τὸν μονογενῆ ἔδωκεν",
          "significance": "God gave His only-begotten Son - the unique, beloved Son given for the world."
        },
        {
          "reference": "Matthew 11:27",
          "greek": "πάντα μοι παρεδόθη ὑπὸ τοῦ πατρός μου, καὶ οὐδεὶς ἐπιγινώσκει τὸν υἱόν εἰ μὴ ὁ πατήρ",
          "significance": "Unique mutual knowledge between Father and Son - only the Father knows the Son fully."
        },
        {
          "reference": "Hebrews 1:2-3",
          "greek": "ἐλάλησεν ἡμῖν ἐν υἱῷ... ὃς ὢν ἀπαύγασμα τῆς δόξης",
          "significance": "God speaks in the Son, who is the radiance of His glory - divine nature in the Son."
        }
      ],
      "theologicalSignificance": "Jesus' divine sonship is not adoptive but eternal and ontological. He is 'of one substance with the Father' (Nicaea). The Son shares the Father's nature, glory, and prerogatives. This relationship is the archetype for our adoption: we become sons through the Son, crying 'Abba, Father' by the Spirit of the Son (Gal 4:6). The Father-Son relationship reveals God as eternally relational, loving, and communicating. This is the heart of Trinitarian faith: God is not solitary but exists in eternal relationship. Our salvation brings us into this relationship as adopted children.",
      "relatedWords": [
        {
          "greek": "τέκνον",
          "transliteration": "teknon",
          "relationship": "Child (emphasizes birth); believers are τέκνα θεοῦ (John 1:12)"
        },
        {
          "greek": "μονογενής",
          "transliteration": "monogenēs",
          "relationship": "Only-begotten, unique, one-of-a-kind Son (John 1:14, 18; 3:16)"
        },
        {
          "greek": "υἱοθεσία",
          "transliteration": "huiothesia",
          "relationship": "Adoption as sons (Rom 8:15, 23; Gal 4:5; Eph 1:5)"
        }
      ],
      "tags": ["essential", "johannine", "christology", "trinity"],
      "volume": 8,
      "pages": "334-397"
    },
    {
      "id": "charisma",
      "category": "pneumatology",
      "greek": "χάρισμα",
      "transliteration": "charisma",
      "strongs": "G5486",
      "shortDef": "gift of grace, spiritual gift, divine endowment",
      "title": "Spiritual Gifts: Grace Made Concrete",
      "summary": "Χάρισμα (from χάρις, grace) refers to gifts freely given by God's grace. In the NT, it particularly denotes spiritual gifts distributed by the Spirit for building up Christ's body. Each believer has charismata for the common good - not for personal glory but for serving others.",
      "classicalGreek": "The word χάρισμα is rare in classical Greek. When used, it meant a gift or favor freely given. The -μα suffix indicates the result of an action: χάρισμα is what grace produces - a concrete expression of χάρις.",
      "lxxBackground": "Χάρισμα does not appear in the LXX. However, the OT describes the Spirit empowering individuals for specific tasks: craftsmen for the tabernacle (Ex 31:3), judges for leadership (Judg 3:10), prophets for speaking God's word (Ezek 2:2). These anticipate the NT's systematic treatment of χαρίσματα.",
      "intertestamental": "Philo uses χάρισμα occasionally for divine gifts. The Qumran community spoke of special endowments for its members. But the NT development of χαρίσματα as diverse Spirit-gifts for the whole community is distinctive.",
      "ntUsage": "Paul develops the theology of χαρίσματα in Romans 12:6-8, 1 Corinthians 12-14, and Ephesians 4:7-16. Key principles: (1) Every believer has gift(s) (1 Cor 12:7); (2) Gifts differ but all are valuable (1 Cor 12:4-6); (3) They are for the common good, not personal prestige (1 Cor 12:7); (4) Love is the 'more excellent way' in which gifts must operate (1 Cor 13). Peter likewise teaches that each has received a χάρισμα to serve others (1 Pet 4:10). Romans 6:23 uses χάρισμα for eternal life - God's ultimate gift of grace.",
      "keyPassages": [
        {
          "reference": "1 Corinthians 12:4-7",
          "greek": "διαιρέσεις δὲ χαρισμάτων εἰσίν, τὸ δὲ αὐτὸ πνεῦμα... ἑκάστῳ δὲ δίδοται ἡ φανέρωσις τοῦ πνεύματος πρὸς τὸ συμφέρον",
          "significance": "Varieties of gifts, same Spirit - each receives manifestation for the common good."
        },
        {
          "reference": "Romans 12:6",
          "greek": "ἔχοντες δὲ χαρίσματα κατὰ τὴν χάριν τὴν δοθεῖσαν ἡμῖν διάφορα",
          "significance": "Gifts according to grace given - χαρίσματα flow from χάρις."
        },
        {
          "reference": "1 Peter 4:10",
          "greek": "ἕκαστος καθὼς ἔλαβεν χάρισμα, εἰς ἑαυτοὺς αὐτὸ διακονοῦντες",
          "significance": "Each has received a gift - use it to serve one another as stewards of God's varied grace."
        }
      ],
      "theologicalSignificance": "Χαρίσματα demonstrate that salvation is not merely individual but communal. The Spirit equips each member to contribute to the body's growth. No gift is unimportant; no member unnecessary. This challenges both pride (my gift is superior) and false humility (I have nothing to contribute). The gifts are grace-gifts - unmerited, diverse, purposeful. They must be exercised in love, or they become empty noise (1 Cor 13). The church flourishes when each member's χάρισμα is recognized, developed, and deployed for the common good.",
      "relatedWords": [
        {
          "greek": "χάρις",
          "transliteration": "charis",
          "relationship": "Grace - the source from which χαρίσματα flow"
        },
        {
          "greek": "χαρίζομαι",
          "transliteration": "charizomai",
          "relationship": "To give freely, forgive, bestow graciously"
        },
        {
          "greek": "πνευματικά",
          "transliteration": "pneumatika",
          "relationship": "Spiritual things/gifts (1 Cor 12:1; 14:1)"
        }
      ],
      "tags": ["essential", "pauline", "pneumatology", "ecclesiology"],
      "volume": 9,
      "pages": "402-406"
    },
    {
      "id": "parakletos",
      "category": "pneumatology",
      "greek": "παράκλητος",
      "transliteration": "paraklētos",
      "strongs": "G3875",
      "shortDef": "advocate, helper, counselor, comforter",
      "title": "The Paraclete: Another Advocate Like Jesus",
      "summary": "Παράκλητος (from παρακαλέω, 'to call alongside') describes one who comes to help, defend, or encourage. Jesus uses it exclusively for the Holy Spirit in John's Gospel - 'another Advocate' of the same kind as Himself. The Spirit continues Christ's presence with believers.",
      "classicalGreek": "In classical Greek, παράκλητος was a legal term for one called to someone's side to help, particularly in court - an advocate or defense counsel. It could also mean an intercessor or helper in any situation requiring support.",
      "lxxBackground": "The term παράκλητος does not appear in the LXX, but the concept of advocacy and intercession is present: Abraham intercedes for Sodom (Gen 18), Moses for Israel (Ex 32:11-14), the prophets speak for God to the people. Job longs for an advocate (Job 16:19-21).",
      "intertestamental": "Philo uses παράκλητος occasionally. Various angels serve advocate roles in apocalyptic literature. The concept of heavenly intercessors appears in 1 Enoch and Testament of Judah. But the term's development is distinctively Johannine.",
      "ntUsage": "In John 14:16, Jesus promises 'another Paraclete' (ἄλλος παράκλητος) - implying Jesus is the first Paraclete. This Spirit of truth will dwell with believers forever (14:16-17), teach and remind them of Christ's words (14:26), testify about Christ (15:26), convict the world of sin, righteousness, and judgment (16:8-11), and guide into all truth (16:13). In 1 John 2:1, Jesus Himself is παράκλητος - our advocate with the Father when we sin. The term thus applies to both Christ and Spirit in their helping, defending, guiding roles.",
      "keyPassages": [
        {
          "reference": "John 14:16-17",
          "greek": "κἀγὼ ἐρωτήσω τὸν πατέρα καὶ ἄλλον παράκλητον δώσει ὑμῖν... τὸ πνεῦμα τῆς ἀληθείας",
          "significance": "Another Paraclete of the same kind - the Spirit continues Christ's presence."
        },
        {
          "reference": "John 16:7-8",
          "greek": "ἐὰν γὰρ μὴ ἀπέλθω, ὁ παράκλητος οὐκ ἐλεύσεται πρὸς ὑμᾶς",
          "significance": "It is to your advantage that I go - the Paraclete's coming depends on Christ's departure."
        },
        {
          "reference": "1 John 2:1",
          "greek": "παράκλητον ἔχομεν πρὸς τὸν πατέρα Ἰησοῦν Χριστὸν δίκαιον",
          "significance": "We have an advocate with the Father - Christ intercedes for sinning believers."
        }
      ],
      "theologicalSignificance": "The Paraclete teaching is crucial for pneumatology and ecclesiology. The Spirit is not a vague force but a personal divine presence - another Helper like Jesus. His ministry is Christ-centered: testifying to Christ, taking what is Christ's and declaring it to us. The Spirit's coming is better than Jesus' physical presence because He dwells within every believer universally. The legal aspect ('advocate') emphasizes the Spirit's work against accusation and for the believer's defense. Christ and Spirit together represent us before the Father.",
      "relatedWords": [
        {
          "greek": "παρακαλέω",
          "transliteration": "parakaleō",
          "relationship": "To call alongside, encourage, comfort, exhort"
        },
        {
          "greek": "παράκλησις",
          "transliteration": "paraklēsis",
          "relationship": "Comfort, encouragement, exhortation"
        },
        {
          "greek": "ἐντυγχάνω",
          "transliteration": "entynchanō",
          "relationship": "To intercede (Rom 8:26-27, 34; Heb 7:25)"
        }
      ],
      "tags": ["essential", "johannine", "pneumatology", "trinity"],
      "volume": 5,
      "pages": "800-814"
    },
    {
      "id": "apostolos",
      "category": "ecclesiology",
      "greek": "ἀπόστολος",
      "transliteration": "apostolos",
      "strongs": "G652",
      "shortDef": "apostle, sent one, messenger, delegate",
      "title": "Apostle: Sent with Christ's Authority",
      "summary": "Ἀπόστολος denotes one sent with authority to represent the sender. The Twelve were uniquely chosen by Christ as witnesses to His resurrection, foundational to the church. Paul claimed apostolic authority as one born out of due time. The church is built on apostolic foundation.",
      "classicalGreek": "In classical Greek, ἀπόστολος rarely appeared and typically meant a naval expedition or fleet. As a personal noun, it was uncommon - ἀποστέλλω (to send) was the common verb. The term gained prominence through Jewish and Christian usage.",
      "lxxBackground": "The LXX uses ἀπόστολος only in 1 Kings 14:6 for Ahijah as God's messenger. More significant is the Hebrew שָׁלִיחַ (shaliach) - an authorized representative whose actions were binding as if done by the sender. 'A man's shaliach is like the man himself' (Mishnah).",
      "intertestamental": "The shaliach concept developed in Judaism: commissioned agents representing the one who sent them. Priests, teachers, and other delegates could be shaliachim. This provides the conceptual background for Jesus' commission of the Twelve.",
      "ntUsage": "Jesus chose twelve ἀποστόλοι (Luke 6:13) corresponding to Israel's twelve tribes - the nucleus of reconstituted Israel. They were eyewitnesses of His ministry and resurrection (Acts 1:21-22), foundations of the church (Eph 2:20), and bearers of unique authority (Matt 18:18; 2 Cor 10:8). Paul defends his apostleship as one who saw the risen Lord and was commissioned directly by Christ (Gal 1:1, 11-17; 1 Cor 9:1; 15:8-9). Broader usage includes Barnabas (Acts 14:14), Epaphroditus (Phil 2:25), and others (Rom 16:7). Apostolic teaching, preserved in Scripture, remains the church's foundation.",
      "keyPassages": [
        {
          "reference": "Ephesians 2:20",
          "greek": "ἐποικοδομηθέντες ἐπὶ τῷ θεμελίῳ τῶν ἀποστόλων καὶ προφητῶν",
          "significance": "Built on the foundation of apostles and prophets - foundational, unrepeatable role."
        },
        {
          "reference": "1 Corinthians 15:8-9",
          "greek": "ἔσχατον δὲ πάντων ὡσπερεὶ τῷ ἐκτρώματι ὤφθη κἀμοί... ὅτι ἐδίωξα τὴν ἐκκλησίαν τοῦ θεοῦ",
          "significance": "Last of all, as to one untimely born - Paul's unique apostolic calling."
        },
        {
          "reference": "Galatians 1:1",
          "greek": "Παῦλος ἀπόστολος οὐκ ἀπ᾽ ἀνθρώπων οὐδὲ δι᾽ ἀνθρώπου ἀλλὰ διὰ Ἰησοῦ Χριστοῦ",
          "significance": "Apostle not from men but through Jesus Christ - divine, not human, commissioning."
        }
      ],
      "theologicalSignificance": "The apostles were Christ's authorized representatives, laying the church's foundation through their witness to the resurrection and their Spirit-inspired teaching. Apostolic authority was unique and non-transferable - there are no apostolic successors in the foundational sense. What continues is apostolic doctrine, preserved in the NT. The church remains apostolic by holding to apostolic teaching, not through supposed apostolic succession. The apostles' function was unique to the first generation; their authority continues through their writings.",
      "relatedWords": [
        {
          "greek": "ἀποστέλλω",
          "transliteration": "apostellō",
          "relationship": "To send with commission, dispatch officially"
        },
        {
          "greek": "πέμπω",
          "transliteration": "pempō",
          "relationship": "To send (general term, less emphasis on commission)"
        },
        {
          "greek": "μαθητής",
          "transliteration": "mathētēs",
          "relationship": "Disciple - all apostles were disciples, not all disciples apostles"
        }
      ],
      "tags": ["essential", "pauline", "ecclesiology", "foundational"],
      "volume": 1,
      "pages": "398-447"
    },
    {
      "id": "diakonia",
      "category": "ecclesiology",
      "greek": "διακονία",
      "transliteration": "diakonia",
      "strongs": "G1248",
      "shortDef": "service, ministry, assistance",
      "title": "Ministry: Serving Like Christ",
      "summary": "Διακονία originally meant waiting on tables but was transformed by Jesus' example into the paradigm for all Christian ministry. Greatness in the kingdom is measured by service. Every believer has a διακονία - ministry is not reserved for a clerical class.",
      "classicalGreek": "In classical Greek, διακονέω meant 'to serve,' especially to wait tables or perform other menial tasks. It was considered lowly work, unsuitable for free citizens. The διάκονος was a table servant or household attendant - a position of low social status.",
      "lxxBackground": "The LXX rarely uses the διακον- word group. However, the OT presents service to God and others as noble: Abraham serving his guests (Gen 18), servants of the Lord as honored title (Josh 1:1; Isa 42:1). The servant songs of Isaiah present suffering service as God's means of redemption.",
      "intertestamental": "Greco-Roman society continued to view table service as menial. Judaism valued study over manual labor. The transformation of διακονία into a term of honor is distinctively Christian.",
      "ntUsage": "Jesus revolutionizes the concept: 'The Son of Man came not to be served but to serve (διακονῆσαι) and give His life' (Mark 10:45). Greatness is measured by service (Matt 20:26-28; 23:11). The word describes practical aid (Luke 10:40; Acts 6:1), apostolic ministry (Acts 1:17, 25; 20:24; Rom 11:13), and all varieties of Christian service (1 Cor 12:5; 2 Cor 4:1). The office of deacon (διάκονος, Phil 1:1; 1 Tim 3:8-13) institutionalizes this servant-pattern. Every believer's work is διακονία when done for Christ (Eph 4:12).",
      "keyPassages": [
        {
          "reference": "Mark 10:45",
          "greek": "καὶ γὰρ ὁ υἱὸς τοῦ ἀνθρώπου οὐκ ἦλθεν διακονηθῆναι ἀλλὰ διακονῆσαι",
          "significance": "The Son of Man came to serve - Christ's example transforms the meaning of service."
        },
        {
          "reference": "2 Corinthians 4:1",
          "greek": "διὰ τοῦτο, ἔχοντες τὴν διακονίαν ταύτην καθὼς ἠλεήθημεν",
          "significance": "Having this ministry - apostolic preaching is διακονία, service to others."
        },
        {
          "reference": "Ephesians 4:12",
          "greek": "πρὸς τὸν καταρτισμὸν τῶν ἁγίων εἰς ἔργον διακονίας",
          "significance": "For the work of ministry - all saints equipped for service, not just leaders."
        }
      ],
      "theologicalSignificance": "Jesus transformed διακονία from menial labor to the pattern of kingdom greatness. The cross is the ultimate act of service: the King washing feet and dying for slaves. This inverses worldly values where power means being served. All believers are διάκονοι - the priesthood of all believers means the ministry of all believers. Leadership is not lording over but serving under. The church's varied ministries (preaching, teaching, mercy, administration) are all διακονία - service to Christ by serving His body.",
      "relatedWords": [
        {
          "greek": "διάκονος",
          "transliteration": "diakonos",
          "relationship": "Servant, minister, deacon"
        },
        {
          "greek": "διακονέω",
          "transliteration": "diakoneō",
          "relationship": "To serve, minister, wait on"
        },
        {
          "greek": "δοῦλος",
          "transliteration": "doulos",
          "relationship": "Slave, bondservant - even more lowly term"
        }
      ],
      "tags": ["essential", "synoptic", "pauline", "ecclesiology"],
      "volume": 2,
      "pages": "81-93"
    },
    {
      "id": "baptisma",
      "category": "ecclesiology",
      "greek": "βάπτισμα",
      "transliteration": "baptisma",
      "strongs": "G908",
      "shortDef": "baptism, immersion, ceremonial washing",
      "title": "Baptism: Death, Burial, and Resurrection with Christ",
      "summary": "Βάπτισμα describes immersion or washing for purification. John's baptism prepared for the Messiah; Christian baptism signifies union with Christ in His death, burial, and resurrection. It is the initiatory rite of the new covenant community, the outward sign of inward regeneration.",
      "classicalGreek": "The verb βάπτω meant 'to dip' (as in dyeing cloth); βαπτίζω was the intensive form - 'to immerse repeatedly, overwhelm.' It could describe ships sinking, people drowning, or ceremonial washing. The word emphasized complete immersion.",
      "lxxBackground": "The LXX uses βαπτίζω only in 2 Kings 5:14 for Naaman immersing in the Jordan. However, ritual washings were central to OT religion: priests washed before ministry (Ex 30:19-21), Levitical purification involved water (Lev 15; Num 19). These anticipate the cleansing symbolized in Christian baptism.",
      "intertestamental": "Proselyte baptism emerged as the initiatory rite for Gentile converts to Judaism. Qumran practiced daily ritual immersions for purification. John's baptism was distinctive: a one-time immersion for repentance in preparation for the Coming One.",
      "ntUsage": "John baptized for repentance (Matt 3:11); Jesus' disciples baptized (John 4:1-2). After Pentecost, baptism is commanded (Acts 2:38) and universally practiced (Acts 8:12, 36-38; 16:15, 33; 18:8). Paul interprets baptism as union with Christ's death, burial, and resurrection (Rom 6:3-4; Col 2:12). It is 'one baptism' uniting all believers (Eph 4:5), the point of entry into Christ (Gal 3:27), linked with the Spirit (1 Cor 12:13). Jesus spoke of His coming death as a 'baptism' (Mark 10:38; Luke 12:50).",
      "keyPassages": [
        {
          "reference": "Romans 6:3-4",
          "greek": "ὅσοι ἐβαπτίσθημεν εἰς Χριστὸν Ἰησοῦν, εἰς τὸν θάνατον αὐτοῦ ἐβαπτίσθημεν",
          "significance": "Baptized into Christ's death - participation in His death and resurrection."
        },
        {
          "reference": "Galatians 3:27",
          "greek": "ὅσοι γὰρ εἰς Χριστὸν ἐβαπτίσθητε, Χριστὸν ἐνεδύσασθε",
          "significance": "Baptized into Christ, clothed with Christ - identity transformation."
        },
        {
          "reference": "Acts 2:38",
          "greek": "μετανοήσατε, καὶ βαπτισθήτω ἕκαστος ὑμῶν ἐπὶ τῷ ὀνόματι Ἰησοῦ Χριστοῦ",
          "significance": "Repent and be baptized in Jesus' name - the apostolic command at Pentecost."
        }
      ],
      "theologicalSignificance": "Baptism is the sign and seal of covenant membership. As circumcision marked the old covenant, baptism marks the new. It signifies what God has done (cleansing, regeneration, union with Christ) and what we profess (repentance, faith, new allegiance). The going under water pictures death to the old life; rising pictures resurrection to new life. Baptism does not save but signifies salvation - the 'appeal to God for a good conscience through the resurrection of Christ' (1 Pet 3:21). It is personal (each is baptized) yet corporate (into one body).",
      "relatedWords": [
        {
          "greek": "βαπτίζω",
          "transliteration": "baptizō",
          "relationship": "Verb: to immerse, baptize"
        },
        {
          "greek": "βαπτιστής",
          "transliteration": "baptistēs",
          "relationship": "Baptizer - exclusively for John the Baptist"
        },
        {
          "greek": "βάπτω",
          "transliteration": "baptō",
          "relationship": "To dip (less intense than βαπτίζω)"
        }
      ],
      "tags": ["essential", "sacrament", "ecclesiology", "pauline"],
      "volume": 1,
      "pages": "529-546"
    },
    {
      "id": "parousia",
      "category": "eschatology",
      "greek": "παρουσία",
      "transliteration": "parousia",
      "strongs": "G3952",
      "shortDef": "coming, arrival, presence, advent",
      "title": "The Parousia: Christ's Glorious Return",
      "summary": "Παρουσία means 'presence' or 'arrival.' It became the technical term for Christ's second coming - His visible, glorious return to judge the living and dead, resurrect believers, and consummate the kingdom. The church lives in eager expectation of the parousia.",
      "classicalGreek": "In classical Greek, παρουσία meant 'presence' (being there) or 'arrival' (coming to be there). It was used for the official visit of a king, emperor, or deity. Such visits were occasions for celebration, preparation, and transformation of the location visited.",
      "lxxBackground": "The LXX uses παρουσία rarely and non-technically. However, the OT anticipated the 'Day of the Lord' (יוֹם יהוה) - God's coming in judgment and salvation (Amos 5:18-20; Joel 2:1-11; Zeph 1:14-18; Mal 3:1-5; 4:1-6). This forms the background for NT parousia expectation.",
      "intertestamental": "Apocalyptic literature developed expectations of divine intervention: the Son of Man coming on clouds (Dan 7:13), the Messiah appearing to judge and save. Qumran awaited the 'visitation' of God. The language of divine advent was rich in Second Temple Judaism.",
      "ntUsage": "Παρουσία is the primary term for Christ's return (Matt 24:3, 27, 37, 39; 1 Cor 15:23; 1 Thess 2:19; 3:13; 4:15; 5:23; 2 Thess 2:1, 8; Jas 5:7-8; 2 Pet 1:16; 3:4, 12; 1 John 2:28). Key features: It will be visible like lightning (Matt 24:27), unexpected like a thief (1 Thess 5:2), glorious with angels (Matt 25:31; 2 Thess 1:7), and decisive - ending history as we know it. The dead in Christ will rise (1 Thess 4:16); the living will be transformed (1 Cor 15:51-52). Until then, the church waits, watches, and works.",
      "keyPassages": [
        {
          "reference": "1 Thessalonians 4:15-17",
          "greek": "ἡμεῖς οἱ ζῶντες οἱ περιλειπόμενοι εἰς τὴν παρουσίαν τοῦ κυρίου",
          "significance": "We who are alive at the Lord's coming - the living and dead united at the parousia."
        },
        {
          "reference": "Matthew 24:27",
          "greek": "ὥσπερ γὰρ ἡ ἀστραπὴ ἐξέρχεται ἀπὸ ἀνατολῶν... οὕτως ἔσται ἡ παρουσία τοῦ υἱοῦ τοῦ ἀνθρώπου",
          "significance": "Like lightning from east to west - the parousia will be visible, unmistakable, universal."
        },
        {
          "reference": "2 Peter 3:4, 12",
          "greek": "ποῦ ἐστιν ἡ ἐπαγγελία τῆς παρουσίας αὐτοῦ;... προσδοκῶντας καὶ σπεύδοντας τὴν παρουσίαν",
          "significance": "Where is the promise of His coming? - Peter addresses mockers and encourages eager expectation."
        }
      ],
      "theologicalSignificance": "The parousia is the goal of history and the hope of the church. Already Christ reigns; not yet has He visibly returned to consummate that reign. The parousia will bring resurrection, judgment, reward, and the new creation. It motivates holiness (1 John 3:2-3), comfort in grief (1 Thess 4:13-18), and perseverance under trial (Jas 5:7-8). Believers live between two advents: Christ came in humiliation; He will come in glory. The delay is for salvation (2 Pet 3:9), but the day is certain. 'Maranatha - Our Lord, come!' (1 Cor 16:22)",
      "relatedWords": [
        {
          "greek": "ἐπιφάνεια",
          "transliteration": "epiphaneia",
          "relationship": "Appearing, manifestation (1 Tim 6:14; 2 Tim 4:1, 8)"
        },
        {
          "greek": "ἀποκάλυψις",
          "transliteration": "apokalypsis",
          "relationship": "Revelation, unveiling (1 Pet 1:7, 13)"
        },
        {
          "greek": "ἔρχομαι",
          "transliteration": "erchomai",
          "relationship": "To come - 'the coming one' (ὁ ἐρχόμενος)"
        }
      ],
      "tags": ["essential", "eschatology", "pauline", "synoptic"],
      "volume": 5,
      "pages": "858-871"
    },
    {
      "id": "krisis",
      "category": "eschatology",
      "greek": "κρίσις",
      "transliteration": "krisis",
      "strongs": "G2920",
      "shortDef": "judgment, decision, verdict, justice",
      "title": "Judgment: The Final Verdict",
      "summary": "Κρίσις means judgment or decision, especially judicial verdict. The NT declares that all will face God's judgment: believers at the bema (judgment seat) for reward, unbelievers at the great white throne for condemnation. Christ Himself is the appointed Judge.",
      "classicalGreek": "In classical Greek, κρίσις meant 'separating, distinguishing, decision.' In legal contexts, it referred to a trial, judgment, or verdict. The related verb κρίνω meant 'to separate, decide, judge.' Justice (δίκη) and judgment (κρίσις) were foundational concepts in Greek thought.",
      "lxxBackground": "The LXX uses κρίσις for מִשְׁפָּט (mishpat) - judgment, justice, ordinance. God is the judge of all the earth (Gen 18:25). The prophets call for justice (Amos 5:24; Mic 6:8) and announce God's judgment on nations and individuals (Isa 3:14; Ezek 7:8). The Day of the Lord is a day of judgment (Joel 2:1-11).",
      "intertestamental": "Apocalyptic literature developed detailed judgment scenarios: books of deeds, separation of righteous and wicked, resurrection for judgment, eternal rewards and punishments. 4 Ezra, 2 Baruch, and 1 Enoch elaborate on final judgment. The judgment is both national and individual.",
      "ntUsage": "Jesus warns of judgment to come (Matt 10:15; 11:22, 24; 12:36, 41-42). All will appear before God's judgment seat (Rom 14:10; 2 Cor 5:10). The Father has given judgment to the Son (John 5:22, 27). Judgment comes at Christ's return (Acts 17:31; 2 Tim 4:1). Revelation 20 depicts the great white throne judgment. Believers face the bema for reward (1 Cor 3:12-15; 2 Cor 5:10), not condemnation (Rom 8:1; John 5:24). For unbelievers, judgment means condemnation (John 3:18-19; Heb 9:27).",
      "keyPassages": [
        {
          "reference": "John 5:22, 27",
          "greek": "τὴν κρίσιν πᾶσαν δέδωκεν τῷ υἱῷ... ἐξουσίαν ἔδωκεν αὐτῷ κρίσιν ποιεῖν",
          "significance": "The Father has given all judgment to the Son - Christ is the eschatological judge."
        },
        {
          "reference": "Acts 17:31",
          "greek": "ἔστησεν ἡμέραν ἐν ᾗ μέλλει κρίνειν τὴν οἰκουμένην ἐν δικαιοσύνῃ",
          "significance": "He has fixed a day for judging the world in righteousness - judgment is certain, scheduled, universal."
        },
        {
          "reference": "Hebrews 9:27",
          "greek": "ἀπόκειται τοῖς ἀνθρώποις ἅπαξ ἀποθανεῖν, μετὰ δὲ τοῦτο κρίσις",
          "significance": "After death comes judgment - the finality of death and judgment."
        }
      ],
      "theologicalSignificance": "Final judgment affirms God's justice: wrongs will be righted, righteousness vindicated, evil punished. Christ as judge ensures that judgment is both merciful and just - He who died for sinners judges sinners. Believers need not fear condemnation (Rom 8:1) but will face evaluation of their works (1 Cor 3:12-15). This motivates holy living and faithful service. The doctrine guards against both presumption (sin has consequences) and despair (Christ bore our judgment). Every idle word, secret deed, and hidden motive will be revealed. This is sobering but also liberating - we need not seek vindication now; God will judge.",
      "relatedWords": [
        {
          "greek": "κρίνω",
          "transliteration": "krinō",
          "relationship": "Verb: to judge, decide, evaluate"
        },
        {
          "greek": "κριτής",
          "transliteration": "kritēs",
          "relationship": "Judge"
        },
        {
          "greek": "κρίμα",
          "transliteration": "krima",
          "relationship": "Judgment, verdict, decision"
        },
        {
          "greek": "κατάκριμα",
          "transliteration": "katakrima",
          "relationship": "Condemnation, adverse judgment (Rom 5:16, 18; 8:1)"
        }
      ],
      "tags": ["essential", "eschatology", "johannine", "synoptic"],
      "volume": 3,
      "pages": "921-954"
    },
    {
      "id": "aionios",
      "category": "eschatology",
      "greek": "αἰώνιος",
      "transliteration": "aiōnios",
      "strongs": "G166",
      "shortDef": "eternal, everlasting, age-long, belonging to the age to come",
      "title": "Eternal Life: Quality and Duration",
      "summary": "Αἰώνιος derives from αἰών (age) and describes what belongs to the age to come. 'Eternal life' is not just endless duration but the quality of life in God's kingdom - knowing the Father and Son. This life is both present possession and future hope.",
      "classicalGreek": "In classical Greek, αἰών meant 'lifetime,' 'generation,' or 'age.' Αἰώνιος meant 'lasting for an age' or 'perpetual.' Plato used it for the eternal realm of ideas versus the temporal realm of appearances. The word could mean 'very long duration' or 'unending.'",
      "lxxBackground": "The LXX uses αἰών/αἰώνιος for עוֹלָם (olam), meaning 'long duration,' 'antiquity,' or 'forever.' God is the 'everlasting God' (Gen 21:33). His covenant is 'everlasting' (Gen 17:7). The term gains eschatological weight: 'everlasting life' (Dan 12:2) and 'everlasting contempt' contrast in resurrection.",
      "intertestamental": "Apocalyptic literature contrasts 'this age' (הָעוֹלָם הַזֶּה) with 'the age to come' (הָעוֹלָם הַבָּא). The coming age brings resurrection, judgment, and eternal states. 'Eternal life' becomes the hope of the righteous; 'eternal punishment' the fate of the wicked.",
      "ntUsage": "John emphasizes 'eternal life' (ζωὴ αἰώνιος) as knowing God and Christ (John 17:3). It is present possession received through faith (John 3:36; 5:24; 1 John 5:11-13) and future inheritance (Mark 10:30; Matt 25:46). The Synoptics speak of 'entering eternal life' (Matt 19:16-17; Mark 9:43, 45). Paul contrasts it with eternal destruction (2 Thess 1:9). Αἰώνιος modifies both life and punishment in Matthew 25:46 - the same word for duration of both. It also describes God's purpose (Eph 3:11), the Spirit (Heb 9:14), and future glory (2 Cor 4:17).",
      "keyPassages": [
        {
          "reference": "John 17:3",
          "greek": "αὕτη δέ ἐστιν ἡ αἰώνιος ζωὴ ἵνα γινώσκωσιν σὲ τὸν μόνον ἀληθινὸν θεόν",
          "significance": "Eternal life is knowing God - not just duration but relationship quality."
        },
        {
          "reference": "Matthew 25:46",
          "greek": "καὶ ἀπελεύσονται οὗτοι εἰς κόλασιν αἰώνιον, οἱ δὲ δίκαιοι εἰς ζωὴν αἰώνιον",
          "significance": "Eternal punishment and eternal life - the same word qualifies both destinies."
        },
        {
          "reference": "1 John 5:11-13",
          "greek": "ζωὴν αἰώνιον ἔδωκεν ἡμῖν ὁ θεός, καὶ αὕτη ἡ ζωὴ ἐν τῷ υἱῷ αὐτοῦ ἐστιν",
          "significance": "God has given us eternal life in His Son - present possession through union with Christ."
        }
      ],
      "theologicalSignificance": "Αἰώνιος bridges present and future: eternal life is now (John 5:24) and not yet (Mark 10:30). It describes both duration (endless) and quality (the life of the age to come). Eternal life means knowing God - relational, not merely temporal. It comes through Christ alone (John 14:6; Acts 4:12). The same adjective describing life also describes punishment - both are forever. This sober reality motivates evangelism and guards against universalism. The eternal states are not merely 'very long' but belong to a different order - the unending life of the coming age versus the temporal existence of this present evil age.",
      "relatedWords": [
        {
          "greek": "αἰών",
          "transliteration": "aiōn",
          "relationship": "Age, era, eternity - 'this age' vs 'the age to come'"
        },
        {
          "greek": "ζωή",
          "transliteration": "zōē",
          "relationship": "Life - often combined as ζωὴ αἰώνιος (eternal life)"
        },
        {
          "greek": "ἀΐδιος",
          "transliteration": "aidios",
          "relationship": "Everlasting, eternal (Rom 1:20; Jude 6) - less common synonym"
        }
      ],
      "tags": ["essential", "johannine", "eschatology", "synoptic"],
      "volume": 1,
      "pages": "197-209"
    },
    {
      "id": "kardia",
      "category": "anthropology",
      "greek": "καρδία",
      "transliteration": "kardia",
      "strongs": "G2588",
      "shortDef": "heart, inner self, mind, will, center of being",
      "title": "Heart: The Center of Human Existence",
      "summary": "Καρδία in biblical usage refers not primarily to emotions but to the center of human personality - the seat of intellect, will, and affection. It is the 'inner person' where decisions are made, faith arises, and God's Spirit works. Transformation of the heart is central to salvation.",
      "classicalGreek": "In classical Greek, καρδία meant the physical heart and, metaphorically, the seat of emotions and courage. Greek anthropology located reason in the head (νοῦς) and passion in the heart. The heart was associated with feeling rather than thinking.",
      "lxxBackground": "The LXX uses καρδία to translate לֵב/לֵבָב (leb/lebab) over 800 times. Hebrew anthropology centered on the heart as the core of personality: the source of thought (Gen 6:5), decision (Ex 35:5), memory (Deut 4:9), and spiritual life (Deut 6:5). The heart can be hardened (Ex 7:3), circumcised (Deut 10:16), or renewed (Ezek 36:26).",
      "intertestamental": "The heart continued as the center of human personality. Qumran texts speak of the 'heart of flesh' versus 'heart of stone.' Wisdom literature emphasizes guarding the heart (Prov 4:23). The heart is where law should be written (Jer 31:33).",
      "ntUsage": "Jesus teaches that from the heart come evil thoughts, murder, adultery (Matt 15:19). Faith arises in the heart (Rom 10:9-10). God searches hearts (Rom 8:27). The Spirit is sent into hearts crying 'Abba' (Gal 4:6). Christ dwells in hearts by faith (Eph 3:17). Hearts can be hardened (Mark 3:5; Heb 3:8) or circumcised (Rom 2:29). Love for God and neighbor must be from the heart (Matt 22:37; 1 Pet 1:22). The new covenant writes God's law on hearts (Heb 8:10).",
      "keyPassages": [
        {
          "reference": "Romans 10:9-10",
          "greek": "ἐὰν ὁμολογήσῃς... καὶ πιστεύσῃς ἐν τῇ καρδίᾳ σου",
          "significance": "Believe in your heart - saving faith is not mere mental assent but heart conviction."
        },
        {
          "reference": "Matthew 15:18-19",
          "greek": "τὰ δὲ ἐκπορευόμενα ἐκ τοῦ στόματος ἐκ τῆς καρδίας ἐξέρχεται",
          "significance": "What comes from the mouth proceeds from the heart - the heart is the source of moral action."
        },
        {
          "reference": "Ezekiel 36:26 (LXX)",
          "greek": "καρδίαν καινὴν καὶ πνεῦμα καινὸν δώσω ὑμῖν",
          "significance": "A new heart and new spirit - the promise of heart transformation fulfilled in Christ."
        }
      ],
      "theologicalSignificance": "The heart is where salvation takes place: regeneration is a new heart (Ezek 36:26); faith is heart-belief (Rom 10:10); sanctification is purifying hearts (Jas 4:8; 1 Pet 1:22). God sees the heart (1 Sam 16:7) while humans see appearance. This challenges externalism: religion that doesn't reach the heart is worthless. Yet it also offers hope: God can change hearts. The goal of the Christian life is a pure heart (Matt 5:8; 1 Tim 1:5) - undivided love for God and neighbor flowing from the core of our being.",
      "relatedWords": [
        {
          "greek": "καρδιογνώστης",
          "transliteration": "kardiognōstēs",
          "relationship": "Heart-knower - God who knows hearts (Acts 1:24; 15:8)"
        },
        {
          "greek": "σκληροκαρδία",
          "transliteration": "sklērokardia",
          "relationship": "Hardness of heart (Matt 19:8; Mark 10:5; 16:14)"
        },
        {
          "greek": "ἔσω ἄνθρωπος",
          "transliteration": "esō anthrōpos",
          "relationship": "Inner person (Rom 7:22; 2 Cor 4:16; Eph 3:16)"
        }
      ],
      "tags": ["essential", "synoptic", "pauline", "anthropology"],
      "volume": 3,
      "pages": "605-614"
    },
    {
      "id": "nous",
      "category": "anthropology",
      "greek": "νοῦς",
      "transliteration": "nous",
      "strongs": "G3563",
      "shortDef": "mind, understanding, intellect, reason",
      "title": "Mind: The Faculty of Understanding",
      "summary": "Νοῦς refers to the mind as the faculty of understanding, judgment, and moral reasoning. The fallen mind is futile and darkened; the renewed mind enables transformation. Believers are called to love God with all their mind and to be renewed in the spirit of their minds.",
      "classicalGreek": "In Greek philosophy, νοῦς was the highest human faculty - pure reason, the divine spark in humanity. Plato distinguished νοῦς (rational soul) from the appetitive and spirited parts. Aristotle made νοῦς the capacity for theoretical understanding. It was the seat of wisdom and moral discernment.",
      "lxxBackground": "The LXX uses νοῦς rarely, as Hebrew anthropology centered on לֵב (heart) rather than mind. When used, νοῦς translates various Hebrew terms for thought, understanding, and wisdom. The distinction between heart and mind is less sharp in Hebrew than in Greek thought.",
      "intertestamental": "Wisdom literature valued the mind/wisdom. Philo, influenced by Greek philosophy, emphasized νοῦς as the ruling faculty. The mind needed to be illuminated by divine wisdom to function properly. 4 Maccabees presents reason (λογισμός) ruling over passions.",
      "ntUsage": "Paul develops a theology of the mind. The unregenerate mind is futile (Eph 4:17), darkened (Rom 1:21, 28), and hostile to God (Rom 8:7; Col 1:21). Transformation comes through renewing the mind (Rom 12:2; Eph 4:23). Believers have 'the mind of Christ' (1 Cor 2:16). Love for God includes the mind (Mark 12:30). The mind serves God's law even when flesh rebels (Rom 7:23, 25). Paul prays with his mind (1 Cor 14:14-15). The peace of God guards minds (Phil 4:7).",
      "keyPassages": [
        {
          "reference": "Romans 12:2",
          "greek": "μεταμορφοῦσθε τῇ ἀνακαινώσει τοῦ νοός",
          "significance": "Be transformed by the renewing of your mind - transformation happens through renewed thinking."
        },
        {
          "reference": "1 Corinthians 2:16",
          "greek": "ἡμεῖς δὲ νοῦν Χριστοῦ ἔχομεν",
          "significance": "We have the mind of Christ - believers share Christ's perspective through the Spirit."
        },
        {
          "reference": "Romans 1:28",
          "greek": "παρέδωκεν αὐτοὺς ὁ θεὸς εἰς ἀδόκιμον νοῦν",
          "significance": "God gave them up to a debased mind - sin corrupts the mind's moral judgment."
        }
      ],
      "theologicalSignificance": "The mind is not spiritually neutral: it is either darkened by sin or renewed by grace. Sanctification includes the mind - we are to think differently. The mind of Christ (1 Cor 2:16) means sharing His values, priorities, and perspective. Yet Christianity is not mere intellectualism: the mind serves worship (Rom 12:1-2), and knowledge puffs up without love (1 Cor 8:1). The mind must be renewed (transformed, not just informed) and governed by the Spirit. Sound thinking is essential for sound living.",
      "relatedWords": [
        {
          "greek": "νοέω",
          "transliteration": "noeō",
          "relationship": "To perceive, understand, comprehend"
        },
        {
          "greek": "διάνοια",
          "transliteration": "dianoia",
          "relationship": "Understanding, intellect, mind (Eph 2:3; 4:18)"
        },
        {
          "greek": "φρόνημα",
          "transliteration": "phronēma",
          "relationship": "Mindset, way of thinking (Rom 8:6-7)"
        }
      ],
      "tags": ["essential", "pauline", "anthropology"],
      "volume": 4,
      "pages": "951-960"
    },
    {
      "id": "syneidesis",
      "category": "anthropology",
      "greek": "συνείδησις",
      "transliteration": "syneidēsis",
      "strongs": "G4893",
      "shortDef": "conscience, moral awareness, inner witness",
      "title": "Conscience: The Moral Witness Within",
      "summary": "Συνείδησις (literally 'co-knowledge') refers to the moral consciousness that evaluates actions as right or wrong. Though not infallible, conscience bears witness to God's moral law written on hearts. A good conscience is precious; a defiled conscience must be cleansed by Christ's blood.",
      "classicalGreek": "In classical Greek, συνείδησις meant 'consciousness' or 'awareness.' It developed a moral sense: knowing within oneself that one has done right or wrong. Stoics emphasized living according to conscience. The term implied self-judgment - being one's own witness.",
      "lxxBackground": "Συνείδησις is rare in the LXX, appearing in Wisdom of Solomon 17:10 and Ecclesiastes 10:20. The concept, however, appears in Hebrew thought as the heart accusing or excusing (2 Sam 24:10; 1 Kgs 2:44; Job 27:6). God's law written on hearts creates moral awareness.",
      "intertestamental": "Philo and other Hellenistic Jewish writers used συνείδησις more frequently, influenced by Stoic ethics. Conscience was seen as an internal judge, accusing wrongdoing and approving right action. It was connected to awareness of divine judgment.",
      "ntUsage": "Paul develops conscience theology. Gentiles show the law written on hearts, their conscience bearing witness (Rom 2:15). Weak consciences must be respected (1 Cor 8:7-12; 10:25-29). Conscience can be good (Acts 23:1; 1 Tim 1:5, 19), clear (Acts 24:16; 2 Cor 1:12), or defiled (Titus 1:15). It can be seared (1 Tim 4:2) or sprinkled clean by Christ's blood (Heb 9:14; 10:22). Baptism is an appeal for a good conscience (1 Pet 3:21). Leaders should serve with a clear conscience (1 Tim 3:9; 2 Tim 1:3).",
      "keyPassages": [
        {
          "reference": "Romans 2:15",
          "greek": "συμμαρτυρούσης αὐτῶν τῆς συνειδήσεως",
          "significance": "Their conscience bears witness - even Gentiles have an internal moral judge."
        },
        {
          "reference": "Hebrews 9:14",
          "greek": "καθαριεῖ τὴν συνείδησιν ἡμῶν ἀπὸ νεκρῶν ἔργων",
          "significance": "Cleanse our conscience from dead works - Christ's blood purifies the defiled conscience."
        },
        {
          "reference": "1 Timothy 1:5, 19",
          "greek": "ἀγάπης ἐκ καθαρᾶς καρδίας καὶ συνειδήσεως ἀγαθῆς",
          "significance": "Love from a pure heart and good conscience - conscience is essential for authentic faith."
        }
      ],
      "theologicalSignificance": "Conscience is a moral monitor, not an infallible guide. It can be weak, misinformed, or seared. Yet it witnesses to moral reality and is not to be violated. A good conscience - one aligned with God's Word and cleansed by Christ's blood - is precious. Christians should aim to maintain a clear conscience before God and people (Acts 24:16). Weak consciences should be respected, not overridden. The ultimate appeal is not to conscience alone but to God who searches hearts. Conscience is valuable but must be educated by Scripture and purified by Christ.",
      "relatedWords": [
        {
          "greek": "συνειδός",
          "transliteration": "syneidos",
          "relationship": "Variant spelling, consciousness (1 Cor 4:4)"
        },
        {
          "greek": "σύνοιδα",
          "transliteration": "synoida",
          "relationship": "To be conscious, be aware (Acts 5:2; 1 Cor 4:4)"
        },
        {
          "greek": "ἀπρόσκοπος",
          "transliteration": "aproskopos",
          "relationship": "Without offense, blameless conscience (Acts 24:16)"
        }
      ],
      "tags": ["essential", "pauline", "anthropology", "ethics"],
      "volume": 7,
      "pages": "898-919"
    },
    {
      "id": "nomos",
      "category": "hamartiology",
      "greek": "νόμος",
      "transliteration": "nomos",
      "strongs": "G3551",
      "shortDef": "law, Torah, principle, regulation",
      "title": "Law: The Revealer of Sin and Shadow of Christ",
      "summary": "Νόμος primarily refers to the Mosaic Law (Torah) but also to general principles. The law reveals sin but cannot save; it was a παιδαγωγός leading to Christ. Believers are not under law but under grace, yet the law's moral content is fulfilled through love.",
      "classicalGreek": "In classical Greek, νόμος meant 'custom,' 'convention,' or 'law.' It could refer to unwritten social norms or formal legislation. Nomos was often contrasted with φύσις (nature) - what is by convention versus what is by nature. It implied binding authority.",
      "lxxBackground": "The LXX uses νόμος for תּוֹרָה (Torah), meaning 'instruction' or 'law.' The Torah was God's gracious gift to Israel (Ps 19:7-11; 119), revealing His will and establishing covenant life. It included moral, ceremonial, and civil commands. Israel's blessing depended on Torah obedience (Deut 28).",
      "intertestamental": "Torah became central to Jewish identity, especially after the exile. Pharisees developed elaborate interpretations (Halakah). Some texts emphasize Torah's eternal validity; others hint at eschatological transformation. The 'yoke of the law' could be burdensome (cf. Matt 23:4) or delightful (Ps 119).",
      "ntUsage": "Paul's complex treatment: The law is holy, righteous, and good (Rom 7:12). It reveals sin (Rom 3:20; 7:7) and brings wrath (Rom 4:15). No one is justified by law (Gal 2:16; 3:11). The law was a guardian until Christ (Gal 3:24-25). Christ is the τέλος (end/goal) of the law (Rom 10:4). Believers are not under law but fulfill it through love (Rom 13:8-10; Gal 5:14). James speaks of the 'law of liberty' (Jas 1:25; 2:12). Jesus came not to abolish but fulfill the law (Matt 5:17-20).",
      "keyPassages": [
        {
          "reference": "Romans 7:7, 12",
          "greek": "τὴν ἁμαρτίαν οὐκ ἔγνων εἰ μὴ διὰ νόμου... ὁ νόμος ἅγιος",
          "significance": "I would not have known sin except through the law - the law reveals but cannot remedy sin."
        },
        {
          "reference": "Galatians 3:24",
          "greek": "ὁ νόμος παιδαγωγὸς ἡμῶν γέγονεν εἰς Χριστόν",
          "significance": "The law was our guardian until Christ - a temporary tutor pointing to the Savior."
        },
        {
          "reference": "Romans 10:4",
          "greek": "τέλος γὰρ νόμου Χριστὸς εἰς δικαιοσύνην",
          "significance": "Christ is the end/goal of the law - fulfillment, not mere termination."
        }
      ],
      "theologicalSignificance": "The law serves God's purposes but cannot justify. It reveals sin's exceeding sinfulness (Rom 7:13), condemns the guilty, and drives us to Christ. The ceremonial law is fulfilled in Christ (shadows becoming reality). The moral law remains God's standard, now written on hearts and fulfilled through the Spirit. Neither legalism (law as merit-system) nor antinomianism (law as irrelevant) captures Paul's nuanced view. Love fulfills the law (Rom 13:8-10); the Spirit enables what the law commanded but flesh could not perform (Rom 8:3-4).",
      "relatedWords": [
        {
          "greek": "ἔννομος",
          "transliteration": "ennomos",
          "relationship": "Under law, lawful, legal (Acts 19:39; 1 Cor 9:21)"
        },
        {
          "greek": "ἄνομος",
          "transliteration": "anomos",
          "relationship": "Lawless, without law (1 Cor 9:21; 1 Tim 1:9)"
        },
        {
          "greek": "νομικός",
          "transliteration": "nomikos",
          "relationship": "Lawyer, expert in the law (Luke 7:30; Titus 3:9)"
        }
      ],
      "tags": ["essential", "pauline", "hamartiology", "covenant"],
      "volume": 4,
      "pages": "1022-1091"
    },
    {
      "id": "thanatos",
      "category": "hamartiology",
      "greek": "θάνατος",
      "transliteration": "thanatos",
      "strongs": "G2288",
      "shortDef": "death, mortality, spiritual death",
      "title": "Death: The Wages of Sin",
      "summary": "Θάνατος refers to physical death, spiritual death (separation from God), and eternal death (second death). Death entered through sin and reigns over humanity. Christ conquered death through His death and resurrection, giving believers victory over the last enemy.",
      "classicalGreek": "In classical Greek, θάνατος was personified (as in Homer) but primarily meant the cessation of life, the separation of soul from body. Greek philosophy had mixed views: Socrates welcomed death as liberation; Epicureans said death was annihilation. Death was feared and avoided.",
      "lxxBackground": "The LXX uses θάνατος for מָוֶת (mawet). Death is the consequence of sin (Gen 2:17; 3:19). It can be personified as an enemy (Ps 49:14; Hos 13:14). Sheol/Hades awaits all. Yet hope emerges: God will swallow up death (Isa 25:8), ransom from Sheol (Hos 13:14), and raise the dead (Dan 12:2).",
      "intertestamental": "Death was increasingly seen as the result of Adam's sin and connected to Satan's power. Resurrection hope developed more fully. Wisdom of Solomon distinguishes the death of the body from true death (separation from God). The righteous have hope; the wicked face eternal death.",
      "ntUsage": "Death entered through sin (Rom 5:12); sin's wages is death (Rom 6:23). Death reigned from Adam to Moses (Rom 5:14, 17). Apart from Christ, we are dead in sins (Eph 2:1, 5; Col 2:13). Christ's death destroyed death's power (2 Tim 1:10; Heb 2:14-15). Believers pass from death to life (John 5:24; 1 John 3:14). The last enemy is death (1 Cor 15:26). There is a second death for the impenitent (Rev 2:11; 20:6, 14; 21:8). For believers, to die is gain (Phil 1:21); death has lost its sting (1 Cor 15:55-57).",
      "keyPassages": [
        {
          "reference": "Romans 6:23",
          "greek": "τὰ γὰρ ὀψώνια τῆς ἁμαρτίας θάνατος",
          "significance": "The wages of sin is death - death is not natural but penal, earned by sin."
        },
        {
          "reference": "1 Corinthians 15:26, 54-55",
          "greek": "ἔσχατος ἐχθρὸς καταργεῖται ὁ θάνατος... ποῦ σου, θάνατε, τὸ κέντρον;",
          "significance": "The last enemy is death - but it will be destroyed; death, where is your sting?"
        },
        {
          "reference": "Hebrews 2:14-15",
          "greek": "ἵνα διὰ τοῦ θανάτου καταργήσῃ τὸν τὸ κράτος ἔχοντα τοῦ θανάτου",
          "significance": "Through death He destroyed him who has the power of death - Christ conquered death by dying."
        }
      ],
      "theologicalSignificance": "Death is an enemy, not a friend - the consequence of sin, not natural to humanity as created. It includes physical death, spiritual death (present separation from God), and eternal death (final condemnation). Christ entered death, exhausted its penalty, and emerged victorious. For believers, physical death is not final but 'falling asleep' (1 Thess 4:13-14) - to be absent from the body is to be present with the Lord (2 Cor 5:8). The resurrection guarantees that death will be finally swallowed up in victory. Until then, death is precious (Ps 116:15), even gain (Phil 1:21), because it ushers us into Christ's presence.",
      "relatedWords": [
        {
          "greek": "θνῄσκω",
          "transliteration": "thnēskō",
          "relationship": "To die (perfect: τέθνηκα, 'I am dead')"
        },
        {
          "greek": "νεκρός",
          "transliteration": "nekros",
          "relationship": "Dead, corpse (used for both physical and spiritual death)"
        },
        {
          "greek": "ἀπόθνῄσκω",
          "transliteration": "apothnēskō",
          "relationship": "To die, die off (the most common verb)"
        }
      ],
      "tags": ["essential", "pauline", "hamartiology", "eschatology"],
      "volume": 3,
      "pages": "7-25"
    },
    {
      "id": "hagiasmos",
      "category": "ethics",
      "greek": "ἁγιασμός",
      "transliteration": "hagiasmos",
      "strongs": "G38",
      "shortDef": "sanctification, holiness, consecration",
      "title": "Sanctification: Set Apart for God",
      "summary": "Ἁγιασμός denotes the process and state of being made holy - set apart from sin and for God. It is both positional (already consecrated in Christ) and progressive (being transformed). Without holiness no one will see the Lord; yet sanctification is God's work in us through His Spirit.",
      "classicalGreek": "In classical Greek, ἅγιος and related words meant 'devoted to the gods,' 'sacred,' or 'holy.' Temples, rituals, and objects were ἅγιος because set apart for deity. The term emphasized separation for divine service rather than moral purity per se.",
      "lxxBackground": "The LXX uses ἅγιος for קָדוֹשׁ (qadosh), 'holy' or 'set apart.' God is supremely holy (Isa 6:3); Israel is to be holy because He is holy (Lev 11:44-45; 19:2; 20:26). Holiness involves both separation from impurity and consecration to God. Priests, vessels, and the sanctuary were sanctified.",
      "intertestamental": "The Qumran community emphasized ritual and moral purity - 'holy ones' separated from the world's defilement. Apocalyptic literature anticipated eschatological purification. The Spirit's role in sanctification was noted but not developed as fully as in the NT.",
      "ntUsage": "Believers are called ἅγιοι (saints, holy ones) - positionally sanctified in Christ (1 Cor 1:2; 6:11). Yet sanctification is also progressive: 'this is God's will, your sanctification' (1 Thess 4:3). God sanctifies us through the Word (John 17:17), the Spirit (2 Thess 2:13; 1 Pet 1:2), and by faith (Acts 26:18). We are to pursue holiness (Heb 12:14), cleanse ourselves (2 Cor 7:1), and present our bodies as holy sacrifices (Rom 12:1). Sanctification is necessary: without holiness no one will see the Lord (Heb 12:14). It is both God's work (1 Thess 5:23) and our responsibility (1 Pet 1:15-16).",
      "keyPassages": [
        {
          "reference": "1 Thessalonians 4:3",
          "greek": "τοῦτο γάρ ἐστιν θέλημα τοῦ θεοῦ, ὁ ἁγιασμὸς ὑμῶν",
          "significance": "This is God's will, your sanctification - holiness is not optional but divinely mandated."
        },
        {
          "reference": "Hebrews 12:14",
          "greek": "τὸν ἁγιασμὸν διώκετε, οὗ χωρὶς οὐδεὶς ὄψεται τὸν κύριον",
          "significance": "Pursue holiness, without which no one will see the Lord - sanctification is necessary."
        },
        {
          "reference": "1 Corinthians 6:11",
          "greek": "ἀλλὰ ἀπελούσασθε, ἀλλὰ ἡγιάσθητε, ἀλλὰ ἐδικαιώθητε",
          "significance": "You were washed, sanctified, justified - definitive sanctification as past event."
        }
      ],
      "theologicalSignificance": "Sanctification is both definitive and progressive. Definitively, believers are already 'sanctified in Christ' - set apart and holy in status. Progressively, we are being conformed to Christ's image. This is God's gracious work (1 Thess 5:23-24) that requires our active participation (Phil 2:12-13). Sanctification is not mere moralism but transformation by the Spirit. It is trinitarian: the Father wills it, Christ's blood accomplishes it, the Spirit applies it. The goal is Christ-likeness; the means are Word, Spirit, and faith; the context is community; the motivation is love.",
      "relatedWords": [
        {
          "greek": "ἅγιος",
          "transliteration": "hagios",
          "relationship": "Holy, saint, set apart (οἱ ἅγιοι = the saints)"
        },
        {
          "greek": "ἁγιάζω",
          "transliteration": "hagiazō",
          "relationship": "To sanctify, make holy, consecrate"
        },
        {
          "greek": "ἁγιότης/ἁγιωσύνη",
          "transliteration": "hagiotēs/hagiōsynē",
          "relationship": "Holiness (Heb 12:10; 2 Cor 7:1)"
        }
      ],
      "tags": ["essential", "pauline", "ethics", "soteriology"],
      "volume": 1,
      "pages": "88-115"
    },
    {
      "id": "eleutheria",
      "category": "ethics",
      "greek": "ἐλευθερία",
      "transliteration": "eleutheria",
      "strongs": "G1657",
      "shortDef": "freedom, liberty, independence",
      "title": "Freedom: Liberty in Christ",
      "summary": "Ἐλευθερία in the NT is freedom from sin, law, and death through Christ. It is not license but liberty to serve God and others. The truth sets free; whom the Son frees is free indeed. Christian freedom must not become an occasion for the flesh but for love.",
      "classicalGreek": "In classical Greek, ἐλευθερία was a prized political concept - freedom from tyranny, the status of a free citizen versus a slave. Greek cities valued their ἐλευθερία intensely. The free person was self-governing, not subject to another's will.",
      "lxxBackground": "The LXX uses ἐλευθερία less frequently. The great paradigm of freedom was the Exodus - liberation from Egyptian slavery. The Jubilee (Lev 25) released slaves and debts. Freedom was linked to covenant faithfulness: obedience to God brought freedom; sin brought bondage.",
      "intertestamental": "The Maccabean revolt was a fight for freedom from Seleucid tyranny. Political freedom was closely tied to religious freedom. Qumran expected eschatological liberation. Philo developed spiritual freedom - the wise person is free from passions.",
      "ntUsage": "Jesus promises freedom through knowing the truth (John 8:32) and through the Son (John 8:36). Paul develops freedom in Christ: freedom from the law (Gal 2:4; 4:21-31; 5:1), from sin (Rom 6:18, 22), and for love (Gal 5:13). Creation awaits freedom from decay (Rom 8:21). The Spirit brings freedom (2 Cor 3:17). Yet freedom is not license (Gal 5:13; 1 Pet 2:16). Believers are freed from sin to become slaves of righteousness (Rom 6:18). True freedom serves (Gal 5:13) - liberty used for love, not self-indulgence.",
      "keyPassages": [
        {
          "reference": "John 8:32, 36",
          "greek": "γνώσεσθε τὴν ἀλήθειαν, καὶ ἡ ἀλήθεια ἐλευθερώσει ὑμᾶς... ἐὰν οὖν ὁ υἱὸς ὑμᾶς ἐλευθερώσῃ, ὄντως ἐλεύθεροι ἔσεσθε",
          "significance": "The truth will set you free; if the Son sets you free, you are free indeed."
        },
        {
          "reference": "Galatians 5:1, 13",
          "greek": "τῇ ἐλευθερίᾳ ἡμᾶς Χριστὸς ἠλευθέρωσεν... μόνον μὴ τὴν ἐλευθερίαν εἰς ἀφορμὴν τῇ σαρκί",
          "significance": "For freedom Christ has set us free - but don't use freedom as opportunity for the flesh."
        },
        {
          "reference": "2 Corinthians 3:17",
          "greek": "οὗ δὲ τὸ πνεῦμα κυρίου, ἐλευθερία",
          "significance": "Where the Spirit of the Lord is, there is freedom - the Spirit liberates."
        }
      ],
      "theologicalSignificance": "Christian freedom is Christological (through Christ), pneumatological (by the Spirit), and ethical (for love). It is freedom from bondage to sin, law (as merit-system), and death. But it is not autonomy - being 'free' to sin is the worst slavery. True freedom is the ability to become what God created us to be. Paradoxically, the freest person is the slave of Christ (Rom 1:1; Phil 1:1). Freedom is exercised through love; it may be limited for the sake of weaker brothers (1 Cor 8-10). It is not freedom FROM responsibility but freedom FOR service.",
      "relatedWords": [
        {
          "greek": "ἐλεύθερος",
          "transliteration": "eleutheros",
          "relationship": "Free, free person (opposite of δοῦλος, slave)"
        },
        {
          "greek": "ἐλευθερόω",
          "transliteration": "eleutheroō",
          "relationship": "To set free, liberate"
        },
        {
          "greek": "ἀπελεύθερος",
          "transliteration": "apeleutheros",
          "relationship": "Freedman, one set free (1 Cor 7:22)"
        }
      ],
      "tags": ["essential", "pauline", "johannine", "ethics"],
      "volume": 2,
      "pages": "487-502"
    },
    {
      "id": "proskyneo",
      "category": "worship",
      "greek": "προσκυνέω",
      "transliteration": "proskyneō",
      "strongs": "G4352",
      "shortDef": "to worship, bow down, do reverence, adore",
      "title": "Worship: Bowing Before the King",
      "summary": "Προσκυνέω means to prostrate oneself in worship, to bow down in reverence. It is reserved for God and Christ in true worship; giving it to creatures is idolatry. Jesus teaches that the Father seeks worshipers who worship in spirit and truth.",
      "classicalGreek": "In classical Greek, προσκυνέω meant 'to kiss toward,' perhaps derived from the gesture of blowing a kiss to a deity. It came to mean prostrating oneself before a superior - a god, king, or person of high status. The Persian custom of proskynesis before the king was adopted in Hellenistic courts.",
      "lxxBackground": "The LXX uses προσκυνέω for הִשְׁתַּחֲוָה (hishtachavah), to bow down or prostrate in worship. It is used for worship of YHWH (Gen 24:26; Ex 4:31; Ps 29:2), forbidden idol worship (Ex 20:5; 34:14), and homage to humans (Gen 23:7; 33:3). Context determines whether divine worship or human respect is intended.",
      "intertestamental": "Worship of God alone was central to Jewish faith. Proskynesis before humans was controversial (cf. Esth 3:2-5; Dan 3:5-7). Angelic worship appears (Dan 3:28 LXX) but is problematic. The line between reverence and worship was carefully guarded.",
      "ntUsage": "The Magi worship (προσκυνέω) the infant Jesus (Matt 2:11). Jesus is worshiped throughout Matthew (8:2; 9:18; 14:33; 15:25; 28:9, 17). Worship belongs to God alone (Matt 4:10; Luke 4:8, quoting Deut 6:13). The Father seeks true worshipers who worship in spirit and truth (John 4:23-24). Angels refuse worship (Rev 19:10; 22:8-9), as do apostles (Acts 10:25-26). Yet Jesus receives worship - a powerful implicit Christology. Philippians 2:10 anticipates every knee bowing (from Isa 45:23). The twenty-four elders worship the Lamb (Rev 5:14).",
      "keyPassages": [
        {
          "reference": "John 4:23-24",
          "greek": "οἱ ἀληθινοὶ προσκυνηταὶ προσκυνήσουσιν τῷ πατρὶ ἐν πνεύματι καὶ ἀληθείᾳ",
          "significance": "True worshipers worship in spirit and truth - worship's essence, not external location."
        },
        {
          "reference": "Matthew 4:10",
          "greek": "κύριον τὸν θεόν σου προσκυνήσεις καὶ αὐτῷ μόνῳ λατρεύσεις",
          "significance": "Worship the Lord your God and serve Him only - exclusive worship of God."
        },
        {
          "reference": "Revelation 5:14",
          "greek": "καὶ τὰ τέσσαρα ζῷα ἔλεγον, Ἀμήν· καὶ οἱ πρεσβύτεροι ἔπεσαν καὶ προσεκύνησαν",
          "significance": "The elders fell down and worshiped - the Lamb receives divine worship."
        }
      ],
      "theologicalSignificance": "Προσκυνέω reserved for God and Christ affirms the deity of Christ: He receives what belongs to God alone. Worship is the appropriate response to divine revelation - whether at Jesus' feet or before the heavenly throne. It involves the whole person: body (bowing), mind (attention), heart (adoration), will (submission). The shift from Jerusalem/Gerizim to 'spirit and truth' universalizes worship. External forms matter less than internal reality - yet Spirit-enabled worship is not formless emotionalism but worship in accordance with truth (God's revealed character and will).",
      "relatedWords": [
        {
          "greek": "λατρεύω",
          "transliteration": "latreuō",
          "relationship": "To serve, worship through service (Rom 12:1)"
        },
        {
          "greek": "σέβομαι",
          "transliteration": "sebomai",
          "relationship": "To worship, revere (often for Gentile God-fearers)"
        },
        {
          "greek": "προσκυνητής",
          "transliteration": "proskynētēs",
          "relationship": "Worshiper (John 4:23)"
        }
      ],
      "tags": ["essential", "johannine", "synoptic", "worship"],
      "volume": 6,
      "pages": "758-766"
    },
    {
      "id": "eucharistia",
      "category": "worship",
      "greek": "εὐχαριστία",
      "transliteration": "eucharistia",
      "strongs": "G2169",
      "shortDef": "thanksgiving, gratitude, the giving of thanks",
      "title": "Thanksgiving: The Heart of Worship",
      "summary": "Εὐχαριστία means thanksgiving or gratitude. It characterizes Christian prayer ('with thanksgiving'), the Lord's Supper (Jesus gave thanks), and the believer's life. Thanksgiving acknowledges God as giver; its absence marks godlessness. In everything, give thanks.",
      "classicalGreek": "In classical Greek, εὐχαριστία combined εὖ (well) and χαρίζομαι (to show favor), meaning 'gratitude' or 'thankfulness.' The εὐχάριστος person was one who properly acknowledged favors received. Gratitude was a social virtue, expected in response to benefaction.",
      "lxxBackground": "The LXX rarely uses εὐχαριστία (appearing in 2-4 Maccabees, Wisdom). However, thanksgiving pervades the OT: תּוֹדָה (todah, thanksgiving) offerings (Lev 7:12-15), thanksgiving psalms (Ps 100; 107), and calls to give thanks (Ps 136). God's people respond to His covenant faithfulness with gratitude.",
      "intertestamental": "Thanksgiving was central to Jewish piety. Berakoth (blessings) praised God before meals, upon waking, and throughout the day. The Birkat ha-Mazon (grace after meals) was essential. Qumran's Thanksgiving Hymns (Hodayot) express gratitude for salvation.",
      "ntUsage": "Jesus gave thanks (εὐχαριστέω) at feedings (Matt 15:36; Mark 8:6; John 6:11, 23) and the Last Supper (Matt 26:27; Luke 22:19; 1 Cor 11:24). Hence the meal became 'the Eucharist.' Paul urges thanksgiving in all circumstances (1 Thess 5:18; Phil 4:6; Col 3:15, 17; 4:2; Eph 5:20). The absence of thanksgiving marks the godless (Rom 1:21). Everything God created is good, received with thanksgiving (1 Tim 4:4). Thanksgiving should overflow (2 Cor 4:15; 9:11-12; Col 2:7). Revelation's worship is marked by thanksgiving (Rev 4:9; 7:12; 11:17).",
      "keyPassages": [
        {
          "reference": "1 Thessalonians 5:18",
          "greek": "ἐν παντὶ εὐχαριστεῖτε· τοῦτο γὰρ θέλημα θεοῦ",
          "significance": "In everything give thanks, for this is God's will - comprehensive thanksgiving."
        },
        {
          "reference": "Colossians 3:17",
          "greek": "καὶ πᾶν ὅ τι ἐὰν ποιῆτε... εὐχαριστοῦντες τῷ θεῷ πατρί",
          "significance": "Whatever you do, do with thanksgiving - all of life as grateful service."
        },
        {
          "reference": "Romans 1:21",
          "greek": "διότι γνόντες τὸν θεὸν οὐχ ὡς θεὸν ἐδόξασαν ἢ ηὐχαρίστησαν",
          "significance": "They neither glorified Him as God nor gave thanks - ingratitude marks godlessness."
        }
      ],
      "theologicalSignificance": "Thanksgiving acknowledges that we are creatures dependent on the Creator, recipients of grace we did not earn. It combats pride (we deserve nothing), anxiety (God provides), and discontent (we have enough). Thanksgiving transforms suffering - even affliction is occasion for gratitude (2 Cor 1:11; Phil 1:3-5). The Lord's Supper, the 'Eucharist,' makes thanksgiving central to Christian worship: we remember and give thanks. A thankful heart is the evidence of the Spirit's work (Eph 5:18-20). The opposite of sin is not merely obedience but grateful worship of the giver of all good gifts.",
      "relatedWords": [
        {
          "greek": "εὐχαριστέω",
          "transliteration": "eucharisteō",
          "relationship": "To give thanks, be thankful"
        },
        {
          "greek": "χάρις",
          "transliteration": "charis",
          "relationship": "Grace - εὐχαριστία is the response to χάρις"
        },
        {
          "greek": "εὐλογέω",
          "transliteration": "eulogeō",
          "relationship": "To bless, speak well of (often paired with giving thanks)"
        }
      ],
      "tags": ["essential", "pauline", "worship", "sacrament"],
      "volume": 9,
      "pages": "407-415"
    },
    {
      "id": "aletheia",
      "category": "revelation",
      "greek": "ἀλήθεια",
      "transliteration": "alētheia",
      "strongs": "G225",
      "shortDef": "truth, reality, faithfulness, genuineness",
      "title": "Truth: The Reality of God Revealed",
      "summary": "Ἀλήθεια in the NT combines Greek (truth as reality versus appearance) and Hebrew (truth as faithfulness, reliability) senses. Jesus is the truth; the Spirit guides into truth; believers worship in truth. Truth liberates, sanctifies, and must be obeyed.",
      "classicalGreek": "In classical Greek, ἀλήθεια (from α-privative + λανθάνω, 'escape notice') meant 'unconcealment,' 'reality,' or 'truth' as opposed to appearance or falsehood. It was an epistemological concept: what is real, genuine, accurate. Philosophers sought ἀλήθεια as the goal of inquiry.",
      "lxxBackground": "The LXX uses ἀλήθεια to translate אֱמֶת (emet), meaning 'faithfulness,' 'reliability,' 'truth.' God's truth is His covenant faithfulness (Ps 25:10; 89:14). Truth characterizes His word (Ps 119:160), His ways (Ps 25:10), and should characterize His people (Zech 8:16). Truth and mercy (חֶסֶד וֶאֱמֶת) often pair.",
      "intertestamental": "Qumran contrasts truth and falsehood: sons of light versus darkness, Spirit of truth versus spirit of error. Wisdom is associated with truth. The righteous teacher leads into truth. Truth has eschatological dimensions - it will triumph over deception.",
      "ntUsage": "John emphasizes truth: Jesus is full of truth (John 1:14), is the truth (14:6), came to bear witness to truth (18:37). The Spirit is the Spirit of truth (14:17; 15:26; 16:13) who guides into all truth. Truth liberates (8:32) and sanctifies (17:17, 19). Believers are 'of the truth' (18:37; 1 John 3:19) and must do the truth (3:21), walk in truth (2 John 4; 3 John 3-4). Paul speaks of the truth of the gospel (Gal 2:5, 14), obeying the truth (Gal 5:7), and speaking the truth in love (Eph 4:15, 25). God is true and cannot lie (Rom 3:4; Titus 1:2; Heb 6:18).",
      "keyPassages": [
        {
          "reference": "John 14:6",
          "greek": "ἐγώ εἰμι ἡ ὁδὸς καὶ ἡ ἀλήθεια καὶ ἡ ζωή",
          "significance": "I am the way, the truth, and the life - Jesus is truth personified."
        },
        {
          "reference": "John 8:32",
          "greek": "γνώσεσθε τὴν ἀλήθειαν, καὶ ἡ ἀλήθεια ἐλευθερώσει ὑμᾶς",
          "significance": "The truth will set you free - truth liberates from sin's bondage."
        },
        {
          "reference": "John 17:17",
          "greek": "ἁγίασον αὐτοὺς ἐν τῇ ἀληθείᾳ· ὁ λόγος ὁ σὸς ἀλήθειά ἐστιν",
          "significance": "Sanctify them in the truth; Your word is truth - truth sanctifies."
        }
      ],
      "theologicalSignificance": "Truth is ultimately personal (Christ) and propositional (Scripture). Jesus as truth means He is the ultimate reality, the one in whom God is truly revealed. Truth is not merely intellectual assent but something to be 'done' and 'walked in' - it has ethical dimensions. The Spirit guides into truth, which suggests both cognitive understanding and experiential reality. Truth confronts the lie of the devil (John 8:44) and the deceitfulness of sin (Heb 3:13). In a relativistic age, Christianity affirms objective, liberating, sanctifying truth.",
      "relatedWords": [
        {
          "greek": "ἀληθής",
          "transliteration": "alēthēs",
          "relationship": "True, truthful, genuine (of persons and things)"
        },
        {
          "greek": "ἀληθινός",
          "transliteration": "alēthinos",
          "relationship": "True, real, genuine (emphasizes reality versus shadow)"
        },
        {
          "greek": "ἀληθεύω",
          "transliteration": "alētheuō",
          "relationship": "To speak/do the truth (Gal 4:16; Eph 4:15)"
        }
      ],
      "tags": ["essential", "johannine", "revelation", "christology"],
      "volume": 1,
      "pages": "232-251"
    },
    {
      "id": "mysterion",
      "category": "revelation",
      "greek": "μυστήριον",
      "transliteration": "mystērion",
      "strongs": "G3466",
      "shortDef": "mystery, secret, hidden truth now revealed",
      "title": "Mystery: God's Hidden Plan Now Revealed",
      "summary": "Μυστήριον in the NT is not an unsolvable puzzle but a divine secret now revealed: Christ's person and work, Gentile inclusion, the gospel itself. What was hidden from ages is now made known through apostolic proclamation. The mystery is 'Christ in you, the hope of glory.'",
      "classicalGreek": "In classical Greek, μυστήριον referred to secret religious rites, particularly the mystery religions (Eleusinian, Dionysian). Initiates were sworn to secrecy; the mysteries were revealed only to the μύστης (initiate). The term suggested hidden knowledge for the privileged few.",
      "lxxBackground": "The LXX uses μυστήριον in Daniel (2:18-19, 27-30, 47) for רָז (raz, 'secret'), God's hidden purposes revealed to Daniel. Also in Wisdom of Solomon for secrets of wisdom and judgment. The term moved from pagan secrecy to divine revelation.",
      "intertestamental": "Apocalyptic literature emphasized heavenly mysteries: the order of the cosmos, eschatological events, divine judgments. Qumran spoke of mysteries known to the community. 1 Enoch details cosmic mysteries. The emphasis shifted from esoteric rites to eschatological revelation.",
      "ntUsage": "Paul uses μυστήριον 21 times. The mystery of the gospel (Eph 6:19), once hidden but now revealed (Rom 16:25-26; Eph 3:3-5; Col 1:26). It includes Christ Himself (Col 2:2), Gentile inclusion (Eph 3:6), the church as Christ's body (Eph 5:32), Israel's future (Rom 11:25), and resurrection transformation (1 Cor 15:51). Jesus spoke of the mystery of the kingdom (Mark 4:11). The mysteries of God are entrusted to stewards (1 Cor 4:1). Revelation describes the mystery of the seven stars (Rev 1:20) and of Babylon (17:5, 7).",
      "keyPassages": [
        {
          "reference": "Colossians 1:26-27",
          "greek": "τὸ μυστήριον τὸ ἀποκεκρυμμένον... νῦν δὲ ἐφανερώθη... ὅ ἐστιν Χριστὸς ἐν ὑμῖν",
          "significance": "The mystery hidden for ages, now revealed - Christ in you, the hope of glory."
        },
        {
          "reference": "Ephesians 3:4-6",
          "greek": "τὸ μυστήριον τοῦ Χριστοῦ... εἶναι τὰ ἔθνη συγκληρονόμα",
          "significance": "The mystery of Christ - Gentiles are fellow heirs, members, partakers."
        },
        {
          "reference": "Romans 16:25-26",
          "greek": "κατὰ ἀποκάλυψιν μυστηρίου χρόνοις αἰωνίοις σεσιγημένου, φανερωθέντος δὲ νῦν",
          "significance": "The revelation of the mystery kept secret for ages but now disclosed."
        }
      ],
      "theologicalSignificance": "NT mystery is revealed mystery - not hidden from believers but hidden until now and now made known. The gospel is public, not esoteric; proclaimed, not whispered. Yet it remains 'mystery' because it transcends human wisdom, is known only by revelation, and contains depths never fully exhausted. Christ is the mystery: God's eternal plan to reconcile all things in Him. Gentile inclusion was mysteriously predicted but not understood until fulfillment. The church lives by revealed mystery - not mysticism (vague spirituality) but the concrete person of Christ made known through Word and Spirit.",
      "relatedWords": [
        {
          "greek": "μύστης",
          "transliteration": "mystēs",
          "relationship": "Initiate (not NT, but background)"
        },
        {
          "greek": "ἀποκάλυψις",
          "transliteration": "apokalypsis",
          "relationship": "Revelation - μυστήριον is known through ἀποκάλυψις"
        },
        {
          "greek": "κρύπτω",
          "transliteration": "kryptō",
          "relationship": "To hide - mystery was hidden, now revealed"
        }
      ],
      "tags": ["essential", "pauline", "revelation", "ecclesiology"],
      "volume": 4,
      "pages": "802-828"
    },
    {
      "id": "epangelia",
      "category": "covenant",
      "greek": "ἐπαγγελία",
      "transliteration": "epangelia",
      "strongs": "G1860",
      "shortDef": "promise, pledge, announcement",
      "title": "Promise: God's Covenant Commitment",
      "summary": "Ἐπαγγελία denotes a promise or announcement, particularly God's covenant promises to Abraham and their fulfillment in Christ. Believers are children of promise, inheritors of promises. God is faithful to His promises; in Christ all promises are Yes and Amen.",
      "classicalGreek": "In classical Greek, ἐπαγγέλλομαι meant 'to announce,' 'promise,' or 'profess.' Ἐπαγγελία was the announcement or promise itself. It was used for various commitments - political, commercial, or personal. The emphasis was on declaration of intent.",
      "lxxBackground": "The LXX uses ἐπαγγελία rarely. The concept of divine promise pervades the OT through different vocabulary. God's promises to Abraham (Gen 12:1-3; 15; 17), David (2 Sam 7), and for future restoration (Jer 31; Ezek 36-37) structure biblical theology. Promise precedes law (Gal 3:17).",
      "intertestamental": "Second Temple Judaism cherished the promises: land, offspring, blessing, Davidic king, new covenant, resurrection. Diverse groups emphasized different promises: Zealots focused on land and kingdom; Pharisees on resurrection; Essenes on new covenant. All awaited fulfillment.",
      "ntUsage": "The promises are fulfilled in Christ (2 Cor 1:20; Acts 13:32-33). Abraham believed the promise (Rom 4:20-21; Gal 3:16-18, 29). Believers are 'children of promise' (Gal 4:28), heirs of promise (Gal 3:29; Heb 6:17). The Spirit is the promise (Luke 24:49; Acts 1:4; 2:33; Gal 3:14). Specific promises include eternal life (1 John 2:25), Christ's return (2 Pet 3:4, 9), and new heavens/earth (2 Pet 3:13). OT saints died in faith, not receiving the promises (Heb 11:13, 39-40). Believers are to inherit promises through faith and patience (Heb 6:12).",
      "keyPassages": [
        {
          "reference": "2 Corinthians 1:20",
          "greek": "ὅσαι γὰρ ἐπαγγελίαι θεοῦ, ἐν αὐτῷ τὸ ναί",
          "significance": "All God's promises find their Yes in Christ - christological fulfillment."
        },
        {
          "reference": "Galatians 3:29",
          "greek": "εἰ δὲ ὑμεῖς Χριστοῦ, ἄρα τοῦ Ἀβραὰμ σπέρμα ἐστέ, κατ᾽ ἐπαγγελίαν κληρονόμοι",
          "significance": "If you are Christ's, then Abraham's offspring, heirs according to promise."
        },
        {
          "reference": "Acts 2:39",
          "greek": "ὑμῖν γάρ ἐστιν ἡ ἐπαγγελία καὶ τοῖς τέκνοις ὑμῶν",
          "significance": "The promise is for you and your children - covenant promise extended."
        }
      ],
      "theologicalSignificance": "Promise precedes law and remains when law passes. The Abrahamic covenant (by promise) and Mosaic covenant (by law) are distinct: promise is received by faith, law demands works. In Christ, promise-recipients from all nations inherit Abraham's blessing. God's promises are the backbone of redemptive history, creating hope, demanding faith, and finding fulfillment in Christ and His return. Believers live 'by promise' - trusting God's commitment despite present circumstances. The 'exceeding great and precious promises' (2 Pet 1:4) anchor hope in the faithful God.",
      "relatedWords": [
        {
          "greek": "ἐπαγγέλλομαι",
          "transliteration": "epangellomai",
          "relationship": "To promise, announce"
        },
        {
          "greek": "προεπαγγέλλομαι",
          "transliteration": "proepangellomai",
          "relationship": "To promise beforehand (Rom 1:2)"
        },
        {
          "greek": "διαθήκη",
          "transliteration": "diathēkē",
          "relationship": "Covenant - contains and ratifies promises"
        }
      ],
      "tags": ["essential", "pauline", "covenant", "abrahamic"],
      "volume": 2,
      "pages": "576-586"
    },
    {
      "id": "kleronomia",
      "category": "covenant",
      "greek": "κληρονομία",
      "transliteration": "klēronomia",
      "strongs": "G2817",
      "shortDef": "inheritance, heritage, possession",
      "title": "Inheritance: The Heritage of God's Children",
      "summary": "Κληρονομία refers to inheritance received as an heir. In the OT, Israel inherited the land; in the NT, believers inherit the kingdom, eternal life, and ultimately God Himself. This inheritance is imperishable, kept in heaven, guaranteed by the Spirit.",
      "classicalGreek": "In classical Greek, κληρονομία meant 'inheritance' received from a deceased relative - property passed down through family lines. The κληρονόμος (heir) received the κληρονομία. The concept was fundamentally familial and legal.",
      "lxxBackground": "The LXX uses κληρονομία for נַחֲלָה (nachalah), the inheritance given to Israel. The land was Israel's κληρονομία (Deut 4:21, 38; Josh 11:23). Levites' inheritance was the Lord Himself (Num 18:20; Deut 10:9; Ps 16:5). The concept included possession, heritage, and family legacy.",
      "intertestamental": "Inheritance language continued for land, but also expanded to include eschatological blessings: the age to come, resurrection life, the kingdom. Wisdom of Solomon speaks of inheriting immortality (3:14). The inheritance became increasingly spiritualized.",
      "ntUsage": "Believers are heirs of God and co-heirs with Christ (Rom 8:17; Gal 4:7). The inheritance is the kingdom (Matt 25:34; 1 Cor 6:9-10; Eph 5:5), eternal life (Matt 19:29; Titus 3:7), salvation (Heb 1:14), promises (Heb 6:12), and blessing (1 Pet 3:9). This inheritance is imperishable, undefiled, unfading, kept in heaven (1 Pet 1:4). The Spirit is the deposit guaranteeing inheritance (Eph 1:13-14). Inheritance is by grace through faith, not works (Gal 3:18; Rom 4:13-14). Abraham looked for the heavenly city (Heb 11:10, 16).",
      "keyPassages": [
        {
          "reference": "1 Peter 1:3-4",
          "greek": "εἰς κληρονομίαν ἄφθαρτον καὶ ἀμίαντον καὶ ἀμάραντον, τετηρημένην ἐν οὐρανοῖς",
          "significance": "An inheritance imperishable, undefiled, unfading, kept in heaven."
        },
        {
          "reference": "Romans 8:17",
          "greek": "εἰ δὲ τέκνα, καὶ κληρονόμοι· κληρονόμοι μὲν θεοῦ, συγκληρονόμοι δὲ Χριστοῦ",
          "significance": "If children, then heirs - heirs of God and co-heirs with Christ."
        },
        {
          "reference": "Ephesians 1:13-14",
          "greek": "ὅς ἐστιν ἀρραβὼν τῆς κληρονομίας ἡμῶν",
          "significance": "The Spirit is the guarantee of our inheritance - present deposit, future fullness."
        }
      ],
      "theologicalSignificance": "Inheritance language emphasizes: (1) family relationship - we are children, therefore heirs; (2) grace - inheritance is gift, not wages; (3) certainty - the Father's will cannot fail, the Spirit guarantees; (4) futurity - full possession is eschatological; (5) transformation - not earthly land but heavenly reality. The land promise is fulfilled in the new creation. Believers are heirs not of perishable estates but of the kingdom itself. Christ is the supreme heir (Heb 1:2) and we inherit 'in Him.' Our inheritance is secure because it rests on divine promise, not human performance.",
      "relatedWords": [
        {
          "greek": "κληρονόμος",
          "transliteration": "klēronomos",
          "relationship": "Heir"
        },
        {
          "greek": "κληρονομέω",
          "transliteration": "klēronomeō",
          "relationship": "To inherit, obtain, possess"
        },
        {
          "greek": "συγκληρονόμος",
          "transliteration": "synklēronomos",
          "relationship": "Co-heir, fellow heir (Rom 8:17; Eph 3:6)"
        }
      ],
      "tags": ["essential", "pauline", "petrine", "covenant", "eschatology"],
      "volume": 3,
      "pages": "758-785"
    },
    {
      "id": "elpis",
      "category": "faith",
      "greek": "ἐλπίς",
      "transliteration": "elpis",
      "strongs": "G1680",
      "shortDef": "hope, expectation, confident anticipation",
      "title": "Hope: Confident Expectation of Glory",
      "summary": "Ἐλπίς in the NT is not wishful thinking but confident expectation based on God's promises. It is one of the three abiding virtues (faith, hope, love). Our hope is Christ, His return, resurrection, and glory. Hope anchors the soul and does not disappoint.",
      "classicalGreek": "In classical Greek, ἐλπίς meant 'expectation' (good or bad) or 'hope.' It was often uncertain - hoping for what might or might not happen. Pandora's box famously left only hope. Greek hope lacked the certainty of biblical hope, being more like 'wish' than 'confidence.'",
      "lxxBackground": "The LXX uses ἐλπίς for various Hebrew words, especially תִּקְוָה (tiqvah, 'hope') and בֶּטַח (betach, 'trust'). Hope in God is a dominant theme: 'Hope in the Lord' (Ps 31:24; 130:5-7; 131:3). Israel's hope was in YHWH's covenant faithfulness - past deliverance grounded future expectation.",
      "intertestamental": "Hope intensified around eschatological themes: resurrection, messianic age, national restoration. The righteous hoped for vindication; apocalyptic hope looked to God's intervention. Qumran expected the age of consolation. Hope sustained suffering communities.",
      "ntUsage": "Christian hope is certain, based on resurrection (1 Pet 1:3). We are saved in hope (Rom 8:24). The object of hope is Christ Himself (1 Tim 1:1; Col 1:27), His return (Titus 2:13), resurrection (Acts 23:6; 24:15), and glory (Rom 5:2; Col 1:27). Hope does not disappoint (Rom 5:5). It anchors the soul (Heb 6:18-19). Faith, hope, and love abide (1 Cor 13:13). Believers should be ready to explain their hope (1 Pet 3:15). Gentiles were without hope apart from Christ (Eph 2:12). Hope produces endurance (Rom 5:3-5; 1 Thess 1:3).",
      "keyPassages": [
        {
          "reference": "Romans 5:5",
          "greek": "ἡ δὲ ἐλπὶς οὐ καταισχύνει",
          "significance": "Hope does not put us to shame - certain expectation, not wishful thinking."
        },
        {
          "reference": "Hebrews 6:18-19",
          "greek": "κρατῆσαι τῆς προκειμένης ἐλπίδος· ἣν ὡς ἄγκυραν ἔχομεν τῆς ψυχῆς",
          "significance": "Hope as an anchor for the soul - stability in life's storms."
        },
        {
          "reference": "Titus 2:13",
          "greek": "προσδεχόμενοι τὴν μακαρίαν ἐλπίδα καὶ ἐπιφάνειαν τῆς δόξης",
          "significance": "Waiting for our blessed hope, the appearing of the glory - the parousia is our hope."
        }
      ],
      "theologicalSignificance": "Biblical hope is as certain as faith's object is reliable. Because God raised Jesus, we have living hope (1 Pet 1:3). Hope is not blind optimism but confidence in divine promise. It transforms suffering: tribulation produces endurance, endurance character, character hope (Rom 5:3-4). Hope is eschatological - it looks forward to what is not yet seen (Rom 8:24-25). It produces present transformation: those who hope in Christ purify themselves (1 John 3:3). Where there is no hope, there is despair; Christian hope enables perseverance, joy in suffering, and confident witness.",
      "relatedWords": [
        {
          "greek": "ἐλπίζω",
          "transliteration": "elpizō",
          "relationship": "To hope, expect, trust"
        },
        {
          "greek": "ἀπεκδέχομαι",
          "transliteration": "apekdechomai",
          "relationship": "To await eagerly (Rom 8:19, 23, 25)"
        },
        {
          "greek": "προσδοκία",
          "transliteration": "prosdokia",
          "relationship": "Expectation, waiting"
        }
      ],
      "tags": ["essential", "pauline", "petrine", "faith"],
      "volume": 2,
      "pages": "517-535"
    },
    {
      "id": "euangelion",
      "category": "revelation",
      "greek": "εὐαγγέλιον",
      "transliteration": "euangelion",
      "strongs": "G2098",
      "shortDef": "gospel, good news, glad tidings",
      "title": "Gospel: The Good News of Jesus Christ",
      "summary": "Εὐαγγέλιον is the 'good news' - specifically the message of salvation through Jesus Christ. From its roots in Isaiah's announcement of salvation, it became the central NT term for the message of Christ's death, resurrection, and Lordship.",
      "classicalGreek": "In classical Greek, εὐαγγέλιον meant 'good news' or 'reward for good news.' It was used for announcements of victory, the birth of an emperor, or other joyous public declarations. The εὐάγγελος was the messenger bringing good tidings.",
      "lxxBackground": "The LXX verb εὐαγγελίζομαι translates בָּשַׂר (basar, 'to bring good news'). Isaiah 40:9; 52:7; 61:1 announce salvation: 'How beautiful are the feet of him who brings good news.' This 'good news' concerns God's coming reign, deliverance from exile, and eschatological salvation.",
      "intertestamental": "The concept of divine good news continued. The Roman imperial cult used εὐαγγέλιον for announcements about the emperor - his birth, accession, and decrees. The Priene inscription (9 BC) calls Augustus's birthday 'the beginning of good news (euangelia).'",
      "ntUsage": "Jesus announced the εὐαγγέλιον τῆς βασιλείας (Matt 4:23; 9:35). After the resurrection, the gospel is specifically about Christ - His death, burial, resurrection (1 Cor 15:1-8). Paul uses εὐαγγέλιον 60+ times. It is God's power for salvation (Rom 1:16), must be believed (Mark 1:15), obeyed (Rom 10:16; 2 Thess 1:8), and defended (Phil 1:7). There is only one gospel (Gal 1:6-9).",
      "keyPassages": [
        {
          "reference": "Romans 1:16",
          "greek": "οὐ γὰρ ἐπαισχύνομαι τὸ εὐαγγέλιον, δύναμις γὰρ θεοῦ ἐστιν εἰς σωτηρίαν παντὶ τῷ πιστεύοντι",
          "significance": "Not ashamed of the gospel - it is God's power for salvation to everyone who believes."
        },
        {
          "reference": "1 Corinthians 15:1-4",
          "greek": "γνωρίζω δὲ ὑμῖν, ἀδελφοί, τὸ εὐαγγέλιον... ὅτι Χριστὸς ἀπέθανεν... καὶ ὅτι ἐγήγερται",
          "significance": "The gospel defined: Christ died, was buried, was raised - the kerygmatic core."
        },
        {
          "reference": "Mark 1:15",
          "greek": "πεπλήρωται ὁ καιρὸς καὶ ἤγγικεν ἡ βασιλεία τοῦ θεοῦ· μετανοεῖτε καὶ πιστεύετε ἐν τῷ εὐαγγελίῳ",
          "significance": "Jesus' opening proclamation: the time is fulfilled, repent and believe the gospel."
        }
      ],
      "theologicalSignificance": "The gospel is not advice but announcement - news of what God has done. It proclaims the crucified and risen Christ as Lord and Savior. This message has divine power; through it God saves. The gospel creates the church, transforms lives, and judges those who reject it. It is 'of Christ' (genitive: about Him and from Him), 'of God' (its source), 'of peace' and 'of grace' (its content). The gospel must be believed, not merely acknowledged. It is the church's treasure to guard and proclaim.",
      "relatedWords": [
        {
          "greek": "εὐαγγελίζω",
          "transliteration": "euangelizō",
          "relationship": "To announce good news, preach the gospel"
        },
        {
          "greek": "εὐαγγελιστής",
          "transliteration": "euangelistēs",
          "relationship": "Evangelist, gospel preacher"
        },
        {
          "greek": "κήρυγμα",
          "transliteration": "kērygma",
          "relationship": "Proclamation, preaching"
        }
      ],
      "tags": ["essential", "pauline", "synoptic", "kerygma"],
      "volume": 2,
      "pages": "707-737"
    },
    {
      "id": "stauros",
      "category": "christology",
      "greek": "σταυρός",
      "transliteration": "stauros",
      "strongs": "G4716",
      "shortDef": "cross, stake, crucifixion",
      "title": "Cross: The Central Symbol of Salvation",
      "summary": "Σταυρός refers to the cross on which Christ was crucified. What was a symbol of shame and curse became the central symbol of Christianity - the place where sin was judged, salvation purchased, and God's wisdom displayed.",
      "classicalGreek": "In classical Greek, σταυρός originally meant a stake or pale for impaling. Crucifixion was adopted from Persia by Rome as the most shameful death - reserved for slaves and criminals. It was designed for maximum suffering and public humiliation.",
      "lxxBackground": "The LXX does not use σταυρός significantly. However, Deuteronomy 21:23 (LXX: 'cursed is everyone hung on a tree') provides crucial background - one hung on wood is under God's curse. This text shapes Paul's theology of Christ becoming a curse (Gal 3:13).",
      "intertestamental": "Crucifixion was known in the Hasmonean period (Alexander Jannaeus crucified 800 Pharisees). The Romans used it extensively. It combined torture, shame, and the curse of exposure. No death was more despised or feared.",
      "ntUsage": "Christ was crucified (Matt 27:35-50; John 19:17-30). The cross is God's wisdom and power (1 Cor 1:17-18, 23-24). Through it, Christ reconciled all things (Col 1:20), made peace (Eph 2:16), and triumphed over powers (Col 2:14-15). Believers are 'crucified with Christ' (Gal 2:20; 6:14). Discipleship means taking up one's cross (Matt 16:24). The message of the cross is foolishness to the perishing (1 Cor 1:18).",
      "keyPassages": [
        {
          "reference": "1 Corinthians 1:18",
          "greek": "ὁ λόγος γὰρ ὁ τοῦ σταυροῦ τοῖς μὲν ἀπολλυμένοις μωρία ἐστίν, τοῖς δὲ σῳζομένοις ἡμῖν δύναμις θεοῦ ἐστιν",
          "significance": "The word of the cross - foolishness to the perishing, but God's power to us being saved."
        },
        {
          "reference": "Galatians 6:14",
          "greek": "ἐμοὶ δὲ μὴ γένοιτο καυχᾶσθαι εἰ μὴ ἐν τῷ σταυρῷ τοῦ κυρίου ἡμῶν Ἰησοῦ Χριστοῦ",
          "significance": "Far be it from me to boast except in the cross - the cross as sole ground of boasting."
        },
        {
          "reference": "Colossians 2:14-15",
          "greek": "ἐξαλείψας τὸ καθ᾽ ἡμῶν χειρόγραφον... προσηλώσας αὐτὸ τῷ σταυρῷ",
          "significance": "The record of debt nailed to the cross - cosmic victory through crucifixion."
        }
      ],
      "theologicalSignificance": "The cross transforms all values. What was curse becomes blessing; what was shame becomes glory; what was weakness becomes power. God's wisdom is revealed precisely where human wisdom sees only folly. The cross judges human pride and self-salvation. It demonstrates God's love (Rom 5:8) and justice (Rom 3:25). Believers must not be 'enemies of the cross' (Phil 3:18) by seeking glory apart from it. The Christian life is cruciform - shaped by the cross in self-denial, suffering, and ultimate victory through apparent defeat.",
      "relatedWords": [
        {
          "greek": "σταυρόω",
          "transliteration": "stauroō",
          "relationship": "To crucify"
        },
        {
          "greek": "συσταυρόω",
          "transliteration": "systauroō",
          "relationship": "To crucify with (Rom 6:6; Gal 2:20)"
        },
        {
          "greek": "ξύλον",
          "transliteration": "xylon",
          "relationship": "Tree, wood - used for cross (Acts 5:30; 1 Pet 2:24)"
        }
      ],
      "tags": ["essential", "pauline", "christology", "atonement"],
      "volume": 7,
      "pages": "572-584"
    },
    {
      "id": "haima",
      "category": "christology",
      "greek": "αἷμα",
      "transliteration": "haima",
      "strongs": "G129",
      "shortDef": "blood, bloodshed, sacrifice",
      "title": "Blood: The Life Poured Out for Redemption",
      "summary": "Αἷμα (blood) carries profound sacrificial significance. In the OT, blood represented life and was the means of atonement. Christ's blood - His life given in death - accomplishes redemption, cleansing, and the establishment of the new covenant.",
      "classicalGreek": "In classical Greek, αἷμα referred to blood as a physical substance, often in contexts of violence, kinship ('blood relation'), or life force. Greek religion had blood sacrifices, but without the theological depth of Hebrew thought.",
      "lxxBackground": "The LXX uses αἷμα for דָּם (dam). 'The life of the flesh is in the blood' (Lev 17:11) - blood represents life. Blood was forbidden as food (Gen 9:4). Atonement came through blood sacrifice (Lev 17:11). The Passover blood protected Israel (Ex 12). Covenant was ratified by blood (Ex 24:8).",
      "intertestamental": "Blood sacrifice continued at the Temple. The Day of Atonement blood ritual was central (Sirach 50). Martyrdom theology developed - the blood of martyrs was seen as atoning (4 Macc 17:22). Blood represented violent death and its consequences.",
      "ntUsage": "Christ's blood accomplishes: redemption (Eph 1:7; 1 Pet 1:18-19), justification (Rom 5:9), peace (Col 1:20), cleansing (1 John 1:7; Heb 9:14), new covenant (Matt 26:28; 1 Cor 11:25), access to God (Heb 10:19), and purchase of the church (Acts 20:28). 'Flesh and blood' denotes human nature/weakness (Matt 16:17; 1 Cor 15:50). Blood guilt remains for rejecting Christ (Matt 27:25; Acts 5:28).",
      "keyPassages": [
        {
          "reference": "Ephesians 1:7",
          "greek": "ἐν ᾧ ἔχομεν τὴν ἀπολύτρωσιν διὰ τοῦ αἵματος αὐτοῦ",
          "significance": "In Him we have redemption through His blood - blood as the means of purchase."
        },
        {
          "reference": "Hebrews 9:22",
          "greek": "χωρὶς αἱματεκχυσίας οὐ γίνεται ἄφεσις",
          "significance": "Without the shedding of blood there is no forgiveness - blood-necessity of atonement."
        },
        {
          "reference": "1 John 1:7",
          "greek": "τὸ αἷμα Ἰησοῦ τοῦ υἱοῦ αὐτοῦ καθαρίζει ἡμᾶς ἀπὸ πάσης ἁμαρτίας",
          "significance": "The blood of Jesus cleanses us from all sin - ongoing purification."
        }
      ],
      "theologicalSignificance": "Blood language emphasizes that salvation costs life. Christ's blood is not merely His death but His life poured out sacrificially. The blood of Christ fulfills and surpasses all OT sacrifices - it actually achieves what animal blood symbolized. It establishes the new covenant, provides eternal redemption, and cleanses the conscience. The Lord's Supper commemorates 'the blood of the covenant' poured out for many. Christ's blood speaks better things than Abel's (Heb 12:24) - not crying for vengeance but granting mercy.",
      "relatedWords": [
        {
          "greek": "αἱματεκχυσία",
          "transliteration": "haimatekchysia",
          "relationship": "Shedding of blood (Heb 9:22)"
        },
        {
          "greek": "θυσία",
          "transliteration": "thysia",
          "relationship": "Sacrifice - blood sacrifices"
        },
        {
          "greek": "ἱλαστήριον",
          "transliteration": "hilastērion",
          "relationship": "Propitiation, mercy seat - where blood was sprinkled"
        }
      ],
      "tags": ["essential", "pauline", "johannine", "atonement", "sacrifice"],
      "volume": 1,
      "pages": "172-177"
    },
    {
      "id": "psyche",
      "category": "anthropology",
      "greek": "ψυχή",
      "transliteration": "psychē",
      "strongs": "G5590",
      "shortDef": "soul, life, self, person",
      "title": "Soul: The Living Self Before God",
      "summary": "Ψυχή refers to the soul, life, or self - the entire person as a living being. Unlike Greek philosophy which saw soul as immortal and imprisoned in body, biblical ψυχή is the whole person in relation to God and others.",
      "classicalGreek": "In classical Greek, ψυχή evolved from 'breath/life' to the immortal, rational soul in Plato. Greek dualism sharply distinguished soul (immortal, divine, good) from body (mortal, material, prison). The goal was the soul's liberation from bodily existence.",
      "lxxBackground": "The LXX uses ψυχή primarily for נֶפֶשׁ (nephesh) - the living being, person, life. 'God breathed... and man became a living nephesh' (Gen 2:7). Nephesh/ψυχή is not a part of humans but the whole person as a living creature. It can hunger, thirst, desire, be troubled.",
      "intertestamental": "Greek influence introduced more dualistic thinking. Wisdom of Solomon speaks of the soul preexisting and entering the body (8:19-20). However, much Jewish thought retained the holistic Hebrew understanding, with resurrection (not immortality of the soul) as hope.",
      "ntUsage": "Ψυχή means: (1) life that can be lost (Matt 2:20; 16:25; John 10:11 - laying down one's life); (2) the self/person (Acts 2:41 - 3000 souls; Rom 13:1 - every soul); (3) inner life, emotions (Matt 26:38 - 'my soul is sorrowful'); (4) in contrast to body in some contexts (Matt 10:28). Jesus gave His ψυχή as ransom (Matt 20:28; Mark 10:45). The great commandment involves loving God with all your ψυχή (Matt 22:37).",
      "keyPassages": [
        {
          "reference": "Matthew 16:26",
          "greek": "τί γὰρ ὠφεληθήσεται ἄνθρωπος ἐὰν τὸν κόσμον ὅλον κερδήσῃ τὴν δὲ ψυχὴν αὐτοῦ ζημιωθῇ",
          "significance": "What profit to gain the world and forfeit one's soul - ultimate value of the person."
        },
        {
          "reference": "Mark 10:45",
          "greek": "δοῦναι τὴν ψυχὴν αὐτοῦ λύτρον ἀντὶ πολλῶν",
          "significance": "The Son of Man came to give His soul/life as a ransom - substitutionary sacrifice."
        },
        {
          "reference": "1 Peter 2:11",
          "greek": "ἀπέχεσθαι τῶν σαρκικῶν ἐπιθυμιῶν αἵτινες στρατεύονται κατὰ τῆς ψυχῆς",
          "significance": "Fleshly passions wage war against the soul - the spiritual battle for the self."
        }
      ],
      "theologicalSignificance": "Biblical anthropology is holistic: humans are not souls imprisoned in bodies but embodied souls/ensouled bodies. Ψυχή represents the person as a living whole - capable of relationship with God, subject to death, and destined for resurrection (not mere immortality). The soul's value is infinite (Matt 16:26). Christ came to save souls (Jas 1:21; 1 Pet 1:9). Pastoral care is 'watching over souls' (Heb 13:17). The soul finds rest only in God (Matt 11:29). Christian hope is resurrection of the whole person, not escape from embodiment.",
      "relatedWords": [
        {
          "greek": "ψυχικός",
          "transliteration": "psychikos",
          "relationship": "Natural, unspiritual (1 Cor 2:14; 15:44)"
        },
        {
          "greek": "πνεῦμα",
          "transliteration": "pneuma",
          "relationship": "Spirit - sometimes distinguished from soul (1 Thess 5:23)"
        },
        {
          "greek": "καρδία",
          "transliteration": "kardia",
          "relationship": "Heart - inner person, often overlapping with soul"
        }
      ],
      "tags": ["essential", "synoptic", "anthropology"],
      "volume": 9,
      "pages": "608-666"
    },
    {
      "id": "eirene",
      "category": "salvation",
      "greek": "εἰρήνη",
      "transliteration": "eirēnē",
      "strongs": "G1515",
      "shortDef": "peace, harmony, wholeness",
      "title": "Peace: The Gift of Reconciliation",
      "summary": "Εἰρήνη encompasses the Hebrew concept of shalom - wholeness, well-being, and right relationships. In the NT, peace is the fruit of reconciliation with God through Christ, the gift of the Spirit, and the goal of Christian community.",
      "classicalGreek": "In classical Greek, εἰρήνη primarily meant the absence of war - the opposite of πόλεμος. It was a negative concept: cessation of hostilities, treaty, rest from conflict. The Greek goddess Eirene personified civic peace and prosperity.",
      "lxxBackground": "The LXX uses εἰρήνη for שָׁלוֹם (shalom) - a rich, positive concept meaning wholeness, well-being, prosperity, right relationships. Shalom is God's gift: 'The Lord give you peace' (Num 6:26). It includes health, prosperity, safety, and covenant blessing. 'Peace to the far and near' (Isa 57:19).",
      "intertestamental": "Peace remained a messianic hope. The Messiah would be 'Prince of Peace' (Isa 9:6). Apocalyptic texts anticipated final peace in God's kingdom. The greeting 'peace' was standard. Rome's 'Pax Romana' offered counterfeit peace through military might.",
      "ntUsage": "Christ is our peace (Eph 2:14), made peace through His blood (Col 1:20), and gives peace (John 14:27; 16:33). Peace with God comes through justification (Rom 5:1). The gospel is 'gospel of peace' (Eph 6:15; Rom 10:15). Peace is fruit of the Spirit (Gal 5:22), a greeting (Rom 1:7), and command - 'live at peace' (Rom 12:18; Heb 12:14). God is 'God of peace' (Rom 15:33; 16:20; Phil 4:9). Peace rules hearts (Col 3:15) and guards minds (Phil 4:7).",
      "keyPassages": [
        {
          "reference": "Romans 5:1",
          "greek": "δικαιωθέντες οὖν ἐκ πίστεως εἰρήνην ἔχομεν πρὸς τὸν θεόν",
          "significance": "Justified by faith, we have peace with God - reconciliation accomplished."
        },
        {
          "reference": "Ephesians 2:14",
          "greek": "αὐτὸς γάρ ἐστιν ἡ εἰρήνη ἡμῶν",
          "significance": "He Himself is our peace - Christ as peace personified, unifying Jew and Gentile."
        },
        {
          "reference": "John 14:27",
          "greek": "εἰρήνην ἀφίημι ὑμῖν, εἰρήνην τὴν ἐμὴν δίδωμι ὑμῖν",
          "significance": "Peace I leave with you, my peace I give - Christ's unique peace gift."
        }
      ],
      "theologicalSignificance": "Peace is a comprehensive salvation term - not merely feeling peaceful but the objective reality of reconciliation with God. Where there was enmity (Rom 5:10; Col 1:21), there is now peace. This peace flows into all relationships: peace with God produces peaceful community. The 'peace of God' (Phil 4:7) guards believers amid turmoil - not absence of trouble but presence of Christ. Making peace is blessed (Matt 5:9); breaking peace is serious. Ultimate peace awaits the new creation, but believers experience its firstfruits now.",
      "relatedWords": [
        {
          "greek": "εἰρηνεύω",
          "transliteration": "eirēneuō",
          "relationship": "To live at peace (Mark 9:50; Rom 12:18)"
        },
        {
          "greek": "εἰρηνοποιός",
          "transliteration": "eirēnopoios",
          "relationship": "Peacemaker (Matt 5:9)"
        },
        {
          "greek": "εἰρηνοποιέω",
          "transliteration": "eirēnopoieō",
          "relationship": "To make peace (Col 1:20)"
        }
      ],
      "tags": ["essential", "pauline", "johannine", "salvation"],
      "volume": 2,
      "pages": "400-420"
    },
    {
      "id": "doulos",
      "category": "ethics",
      "greek": "δοῦλος",
      "transliteration": "doulos",
      "strongs": "G1401",
      "shortDef": "slave, bondservant, servant",
      "title": "Slave: The Radical Lordship of Christ",
      "summary": "Δοῦλος means 'slave' - one owned by another, with no independent rights. The NT uses this term for believers' relationship to Christ: total allegiance, complete belonging, and paradoxically, true freedom through service to the rightful Lord.",
      "classicalGreek": "In classical Greek, δοῦλος was a slave - property of another, without legal personhood. Slavery was fundamental to ancient economies. The δοῦλος had no freedom, belonged entirely to the master (κύριος), and could be sold, punished, or freed only by the owner's will.",
      "lxxBackground": "The LXX uses δοῦλος for עֶבֶד (ebed) - slave or servant. Israel was God's servant people (Isa 41:8-9). Moses, David, and the prophets were 'servants of the Lord.' The Servant of YHWH in Isaiah suffers for others (Isa 52-53). Service to God was highest honor.",
      "intertestamental": "Servant/slave of God remained a title of honor. The righteous were God's servants. Qumran members called themselves 'servants of God.' Slavery to God was contrasted with slavery to sin and the nations.",
      "ntUsage": "Believers are slaves of Christ (Rom 1:1; Gal 1:10; Phil 1:1; Jas 1:1) - Paul's favorite self-designation. We were slaves to sin, now slaves to righteousness (Rom 6:17-22). Christ took slave form (Phil 2:7). The greatest is servant/slave of all (Mark 10:44). 'You were bought with a price' - ownership transferred (1 Cor 6:19-20; 7:22-23). Literal slavery was transformed: slave and free are one in Christ (Gal 3:28; Col 3:11).",
      "keyPassages": [
        {
          "reference": "Romans 6:17-18",
          "greek": "ὅτι ἦτε δοῦλοι τῆς ἁμαρτίας... ἐλευθερωθέντες δὲ ἀπὸ τῆς ἁμαρτίας ἐδουλώθητε τῇ δικαιοσύνῃ",
          "significance": "Once slaves of sin, now enslaved to righteousness - transfer of lordship."
        },
        {
          "reference": "Philippians 2:7",
          "greek": "μορφὴν δούλου λαβών",
          "significance": "Christ took the form of a slave - the incarnation as self-enslavement."
        },
        {
          "reference": "1 Corinthians 7:22-23",
          "greek": "ὁ γὰρ ἐν κυρίῳ κληθεὶς δοῦλος ἀπελεύθερος κυρίου ἐστίν... τιμῆς ἠγοράσθητε",
          "significance": "The slave called in the Lord is the Lord's freedman; you were bought with a price."
        }
      ],
      "theologicalSignificance": "Everyone serves something - sin or righteousness, self or God. Freedom is not autonomy but service to the right master. Paradoxically, slavery to Christ is perfect freedom (John 8:32, 36). Christ's lordship (κύριος) implies our slavery. We are 'bought with a price' - ownership fully transferred. This shapes ethics: we live for Him who died for us. Modern translations often soften δοῦλος to 'servant,' losing the radical claim of Christ's ownership and the complete surrender of the believer.",
      "relatedWords": [
        {
          "greek": "δουλεύω",
          "transliteration": "douleuō",
          "relationship": "To serve as a slave, to be enslaved"
        },
        {
          "greek": "δουλόω",
          "transliteration": "douloō",
          "relationship": "To enslave, make a slave"
        },
        {
          "greek": "σύνδουλος",
          "transliteration": "syndoulos",
          "relationship": "Fellow slave (Matt 18:28; Col 4:7)"
        }
      ],
      "tags": ["essential", "pauline", "ethics", "christology"],
      "volume": 2,
      "pages": "261-280"
    },
    {
      "id": "hypakoe",
      "category": "ethics",
      "greek": "ὑπακοή",
      "transliteration": "hypakoē",
      "strongs": "G5218",
      "shortDef": "obedience, compliance, submission",
      "title": "Obedience: The Response of Faith",
      "summary": "Ὑπακοή is obedience - literally 'hearing under.' In the NT, obedience is the necessary response to the gospel, the expression of faith, and the fruit of the Spirit. Christ's obedience secured salvation; believers' obedience evidences it.",
      "classicalGreek": "In classical Greek, ὑπακοή (from ὑπό 'under' + ἀκούω 'hear') meant 'listening,' then 'obedience.' It implied subordination to authority. The word emphasized hearing that leads to compliance - not mere hearing but heeding.",
      "lxxBackground": "The LXX concept comes through שָׁמַע (shama) - 'to hear/obey.' In Hebrew, hearing and obeying are inseparable: 'Hear, O Israel' (Deut 6:4) implies 'obey.' Obedience is better than sacrifice (1 Sam 15:22). Israel's history is characterized by disobedience (Jer 7:23-26).",
      "intertestamental": "Obedience to Torah was central to Jewish identity. Various groups debated what obedience required - Pharisees emphasized oral law, Essenes strict covenant observance. Obedience to God sometimes conflicted with obedience to foreign rulers.",
      "ntUsage": "Christ learned obedience through suffering (Heb 5:8) and was obedient to death (Phil 2:8). His one act of obedience justifies many (Rom 5:19). The gospel demands 'obedience of faith' (Rom 1:5; 16:26). Faith without obedience is dead (Jas 2:17). Obedience is to be 'from the heart' (Rom 6:17) and 'to Christ' (2 Cor 10:5). Children obey parents (Eph 6:1); wives husbands (1 Pet 3:6); slaves masters (Eph 6:5); all obey governing authorities (Rom 13:1-5).",
      "keyPassages": [
        {
          "reference": "Romans 1:5",
          "greek": "εἰς ὑπακοὴν πίστεως ἐν πᾶσιν τοῖς ἔθνεσιν",
          "significance": "For the obedience of faith among all nations - faith's inseparability from obedience."
        },
        {
          "reference": "Philippians 2:8",
          "greek": "ἐταπείνωσεν ἑαυτὸν γενόμενος ὑπήκοος μέχρι θανάτου, θανάτου δὲ σταυροῦ",
          "significance": "He humbled Himself, becoming obedient to the point of death - Christ's redemptive obedience."
        },
        {
          "reference": "Hebrews 5:8-9",
          "greek": "ἔμαθεν ἀφ᾽ ὧν ἔπαθεν τὴν ὑπακοήν... αἴτιος σωτηρίας αἰωνίου",
          "significance": "He learned obedience through suffering, becoming source of eternal salvation."
        }
      ],
      "theologicalSignificance": "Obedience and faith are inseparable - 'obedience of faith' is a single concept. Saving faith always issues in obedience. Yet obedience is not the ground of salvation but its fruit. Christ's active obedience (fulfilling the law) and passive obedience (suffering its penalty) constitute our righteousness. His obedience reversed Adam's disobedience (Rom 5:19). Believers obey 'from the heart' because transformed by grace. Obedience is loving response to the Lord who bought us, not legalistic compliance. Disobedience remains serious - it characterizes those who perish (Rom 2:8; 2 Thess 1:8).",
      "relatedWords": [
        {
          "greek": "ὑπακούω",
          "transliteration": "hypakouō",
          "relationship": "To obey, listen under"
        },
        {
          "greek": "ὑπήκοος",
          "transliteration": "hypēkoos",
          "relationship": "Obedient (Phil 2:8)"
        },
        {
          "greek": "παρακοή",
          "transliteration": "parakoē",
          "relationship": "Disobedience (Rom 5:19; 2 Cor 10:6)"
        }
      ],
      "tags": ["essential", "pauline", "ethics", "faith"],
      "volume": 1,
      "pages": "216-225"
    },
    {
      "id": "semeion",
      "category": "revelation",
      "greek": "σημεῖον",
      "transliteration": "sēmeion",
      "strongs": "G4592",
      "shortDef": "sign, miracle, portent",
      "title": "Sign: The Revelatory Miracle",
      "summary": "Σημεῖον is a sign - something that points beyond itself. In John's Gospel, Jesus' miracles are 'signs' revealing His glory and identity. Signs authenticate divine messengers but also demand faith; those who seek signs only miss their significance.",
      "classicalGreek": "In classical Greek, σημεῖον meant 'sign, mark, token' - something distinguishing or indicating. It could refer to military standards, proof, or omens. The word emphasized the pointing function - the sign directs attention beyond itself.",
      "lxxBackground": "The LXX uses σημεῖον for אוֹת (ot) - sign, miracle, portent. God gave signs: rainbow (Gen 9:12-13), circumcision (Gen 17:11), Sabbath (Exod 31:13), plagues (Exod 7:3). Signs validated prophets (Deut 13:1-2) and confirmed God's word. Israel demanded signs repeatedly.",
      "intertestamental": "Signs were expected to accompany the Messiah and end times. False prophets would show signs (testing required). Apocalyptic literature featured cosmic signs preceding God's intervention. Signs belonged to God's self-disclosure through history.",
      "ntUsage": "John calls Jesus' miracles 'signs' (σημεῖα) - they reveal glory and identity (John 2:11; 20:30-31). Seven signs structure John's Gospel. Synoptics use 'sign' for validation requests that Jesus often rejects (Matt 12:38-39; 16:4 - only sign of Jonah). Signs accompanied apostles (Acts 2:22, 43; 2 Cor 12:12; Heb 2:4). End-time signs are predicted (Matt 24:3, 30; Luke 21:11, 25). False christs show signs (Matt 24:24; 2 Thess 2:9).",
      "keyPassages": [
        {
          "reference": "John 2:11",
          "greek": "ταύτην ἐποίησεν ἀρχὴν τῶν σημείων ὁ Ἰησοῦς... καὶ ἐφανέρωσεν τὴν δόξαν αὐτοῦ",
          "significance": "The first of signs, manifesting His glory - signs as revelation of Christ's identity."
        },
        {
          "reference": "John 20:30-31",
          "greek": "ταῦτα δὲ γέγραπται ἵνα πιστεύ[σ]ητε ὅτι Ἰησοῦς ἐστιν ὁ χριστὸς ὁ υἱὸς τοῦ θεοῦ",
          "significance": "These are written so you may believe - signs recorded to produce faith."
        },
        {
          "reference": "Matthew 12:39",
          "greek": "γενεὰ πονηρὰ καὶ μοιχαλὶς σημεῖον ἐπιζητεῖ",
          "significance": "An evil and adulterous generation seeks a sign - sign-seeking as unbelief."
        }
      ],
      "theologicalSignificance": "Signs point beyond themselves to Christ and His mission. They are not ends in themselves but windows into divine reality. Faith should not require signs, yet signs are given to strengthen faith. The danger is seeking signs without seeing what they signify - missing the revelation while demanding more miracles. John's signs progressively reveal Jesus: authority over nature, sickness, death, culminating in His own resurrection. Signs authenticate messengers (apostolic signs - 2 Cor 12:12) but can be counterfeited (2 Thess 2:9). True faith penetrates beyond sign to significance.",
      "relatedWords": [
        {
          "greek": "σημαίνω",
          "transliteration": "sēmainō",
          "relationship": "To signify, indicate (John 12:33; Rev 1:1)"
        },
        {
          "greek": "τέρας",
          "transliteration": "teras",
          "relationship": "Wonder, portent (often paired: signs and wonders)"
        },
        {
          "greek": "δύναμις",
          "transliteration": "dynamis",
          "relationship": "Power, miracle - emphasizes power rather than revelatory function"
        }
      ],
      "tags": ["essential", "johannine", "synoptic", "revelation"],
      "volume": 7,
      "pages": "200-269"
    },
    {
      "id": "dynamis",
      "category": "pneumatology",
      "greek": "δύναμις",
      "transliteration": "dynamis",
      "strongs": "G1411",
      "shortDef": "power, might, miracle, ability",
      "title": "Power: The Divine Energy at Work",
      "summary": "Δύναμις is power - the inherent ability to accomplish. It describes God's omnipotent power, Christ's miraculous power, the Spirit's enabling power, and the gospel's saving power. Divine power works in human weakness.",
      "classicalGreek": "In classical Greek, δύναμις meant 'power, strength, ability' - the capacity to act or produce effects. It applied to physical, political, and military power. Aristotle distinguished δύναμις (potentiality) from ἐνέργεια (actuality). The term had both concrete and abstract applications.",
      "lxxBackground": "The LXX uses δύναμις for various Hebrew words expressing God's power: גְּבוּרָה (geburah, 'might'), חַיִל (chayil, 'strength'). God's power created, delivers, and judges. 'Power' and 'glory' are frequently paired (Ps 63:2; 145:11). 'Lord of hosts' (צְבָאוֹת) becomes κύριος τῶν δυνάμεων - Lord of powers/armies.",
      "intertestamental": "God's power in creation, history, and coming salvation remained central. Apocalyptic texts emphasized God's power to judge and transform. 'Powers' (δυνάμεις) could refer to angelic beings. God's power would be revealed decisively in the end times.",
      "ntUsage": "God's power is unlimited (Matt 22:29; Rom 1:20). Christ performed δυνάμεις (miracles/mighty works - Matt 11:20-21). The Spirit provides power (Acts 1:8; Rom 15:13, 19). The gospel is God's power for salvation (Rom 1:16; 1 Cor 1:18). Power is perfected in weakness (2 Cor 12:9). Believers are kept by God's power (1 Pet 1:5). Christ is the power of God (1 Cor 1:24). Resurrection power is available to believers (Eph 1:19-20; Phil 3:10).",
      "keyPassages": [
        {
          "reference": "Acts 1:8",
          "greek": "λήμψεσθε δύναμιν ἐπελθόντος τοῦ ἁγίου πνεύματος ἐφ᾽ ὑμᾶς",
          "significance": "You will receive power when the Holy Spirit comes - Spirit as source of missional power."
        },
        {
          "reference": "2 Corinthians 12:9",
          "greek": "ἀρκεῖ σοι ἡ χάρις μου, ἡ γὰρ δύναμις ἐν ἀσθενείᾳ τελεῖται",
          "significance": "My grace is sufficient; power is perfected in weakness - divine power, human weakness."
        },
        {
          "reference": "Ephesians 1:19-20",
          "greek": "τὸ ὑπερβάλλον μέγεθος τῆς δυνάμεως αὐτοῦ... κατὰ τὴν ἐνέργειαν τοῦ κράτους τῆς ἰσχύος αὐτοῦ",
          "significance": "The surpassing greatness of His power - resurrection power available to believers."
        }
      ],
      "theologicalSignificance": "Divine power (δύναμις) distinguishes true Christianity. The gospel is not philosophy but power - it actually transforms. The Spirit enables what law could only command. Paradoxically, this power works through weakness: the cross is God's power (1 Cor 1:18, 24), and human weakness displays divine strength (2 Cor 12:9-10). Believers are 'filled with power' (Col 1:11) but never possess it independently - it flows from abiding in Christ. Power-seeking apart from service corrupts; divine power always serves love's purposes.",
      "relatedWords": [
        {
          "greek": "δυνατός",
          "transliteration": "dynatos",
          "relationship": "Powerful, able, possible"
        },
        {
          "greek": "δυναμόω",
          "transliteration": "dynamoō",
          "relationship": "To strengthen, make powerful"
        },
        {
          "greek": "ἐνδυναμόω",
          "transliteration": "endynamoō",
          "relationship": "To strengthen, empower (Phil 4:13)"
        }
      ],
      "tags": ["essential", "pauline", "pneumatology", "miracles"],
      "volume": 2,
      "pages": "284-317"
    },
    {
      "id": "exousia",
      "category": "christology",
      "greek": "ἐξουσία",
      "transliteration": "exousia",
      "strongs": "G1849",
      "shortDef": "authority, right, power, domain",
      "title": "Authority: The Rightful Power to Act",
      "summary": "Ἐξουσία is authority - the right or freedom to act, delegated power, jurisdiction. Christ received all authority, delegated authority to apostles, and His authority extends over disease, demons, death, and all creation.",
      "classicalGreek": "In classical Greek, ἐξουσία (from ἔξεστι, 'it is permitted') meant 'freedom of action, right, authority.' It emphasized not raw power but legitimate power - the right to act, permission granted, authority possessed. It could denote political authority, personal liberty, or capability.",
      "lxxBackground": "The LXX uses ἐξουσία for various terms relating to rule, authority, and domain. Daniel 7:14 gives the Son of Man 'authority' (ἐξουσία) and dominion. Human rulers exercise authority under God's sovereignty. All authority ultimately derives from God (Prov 8:15-16).",
      "intertestamental": "Authority belonged to God, delegated to human and angelic rulers. Apocalyptic literature distinguished God's authority from illegitimate demonic usurpation. The coming kingdom would restore proper authority structures. Various 'authorities' (angelic powers) featured in cosmological speculation.",
      "ntUsage": "Christ has all authority (Matt 28:18). He taught with authority (Matt 7:29), forgave with authority (Matt 9:6), and commanded spirits with authority (Mark 1:27). He gave authority to disciples (Matt 10:1; Luke 10:19). All authority comes from God (John 19:11; Rom 13:1-2). Believers have authority to become God's children (John 1:12). Powers and authorities were defeated (Col 2:15) but remain active (Eph 6:12). Christ will hand kingdom authority to the Father (1 Cor 15:24).",
      "keyPassages": [
        {
          "reference": "Matthew 28:18",
          "greek": "ἐδόθη μοι πᾶσα ἐξουσία ἐν οὐρανῷ καὶ ἐπὶ γῆς",
          "significance": "All authority in heaven and on earth given to me - Christ's universal lordship."
        },
        {
          "reference": "John 1:12",
          "greek": "ἔδωκεν αὐτοῖς ἐξουσίαν τέκνα θεοῦ γενέσθαι",
          "significance": "He gave them authority to become children of God - the right of adoption."
        },
        {
          "reference": "Romans 13:1",
          "greek": "οὐ γὰρ ἔστιν ἐξουσία εἰ μὴ ὑπὸ θεοῦ",
          "significance": "There is no authority except from God - divine source of all authority."
        }
      ],
      "theologicalSignificance": "Authority (ἐξουσία) differs from mere power (δύναμις): it is rightful power, legitimate rule. Christ's authority is absolute and delegated from the Father. His authority demonstrates His divine identity. All human and spiritual authorities are under Christ's authority. Believers exercise delegated authority in spiritual warfare and mission. Authority must be exercised in service, not domination (Mark 10:42-45). The spiritual 'authorities' (Eph 6:12) are defeated but active; believers resist them by Christ's authority. Ultimate authority will be exercised when Christ subjects all things to the Father.",
      "relatedWords": [
        {
          "greek": "ἐξουσιάζω",
          "transliteration": "exousiazō",
          "relationship": "To exercise authority over (Luke 22:25; 1 Cor 6:12)"
        },
        {
          "greek": "κατεξουσιάζω",
          "transliteration": "katexousiazō",
          "relationship": "To lord it over, tyrannize"
        },
        {
          "greek": "δύναμις",
          "transliteration": "dynamis",
          "relationship": "Power, might - often paired with authority"
        }
      ],
      "tags": ["essential", "synoptic", "pauline", "christology"],
      "volume": 2,
      "pages": "560-575"
    },
    {
      "id": "martyria",
      "category": "revelation",
      "greek": "μαρτυρία",
      "transliteration": "martyria",
      "strongs": "G3141",
      "shortDef": "testimony, witness, evidence",
      "title": "Testimony: The Witness That Establishes Truth",
      "summary": "Μαρτυρία is testimony or witness - the attestation of truth. God, Christ, the Spirit, Scripture, and believers all bear witness. In John's writings especially, testimony language pervades: the Father testifies to the Son, and believers testify to the world.",
      "classicalGreek": "In classical Greek, μαρτυρία meant 'testimony, witness, evidence' - especially in legal contexts. The μάρτυς (witness) gave μαρτυρία (testimony). Truth required witnesses; testimony established facts. The concept was fundamentally forensic.",
      "lxxBackground": "The LXX uses μαρτυρία for עֵדוּת (edut, 'testimony'). Two or three witnesses established truth (Deut 19:15). The covenant tablets were 'testimony' (Ex 25:16). False witness was forbidden (Ex 20:16). God Himself is witness (Gen 31:50; Jer 29:23).",
      "intertestamental": "Legal witness procedures remained important. God's witness was ultimate. Martyrdom (dying for one's witness) began developing its specialized meaning. The righteous were witnesses to truth even unto death.",
      "ntUsage": "John's Gospel emphasizes testimony: John the Baptist testified (John 1:7, 19, 32); Jesus testified (John 3:11, 32); the Father testified (John 5:37; 8:18); the works testified (John 5:36; 10:25); Scripture testified (John 5:39); the Spirit testified (John 15:26; 1 John 5:6-8). Believers are witnesses (Acts 1:8; 1 John 1:2). The 'testimony of Jesus' is central (Rev 1:2, 9; 12:17; 19:10). Martyrdom is the ultimate witness (Rev 6:9; 12:11).",
      "keyPassages": [
        {
          "reference": "John 5:36-37",
          "greek": "τὰ ἔργα... μαρτυρεῖ περὶ ἐμοῦ... καὶ ὁ πέμψας με πατὴρ ἐκεῖνος μεμαρτύρηκεν περὶ ἐμοῦ",
          "significance": "The works and the Father testify about me - multiple divine witnesses to Christ."
        },
        {
          "reference": "1 John 5:9-11",
          "greek": "ἡ μαρτυρία τοῦ θεοῦ μείζων ἐστίν... αὕτη ἐστὶν ἡ μαρτυρία, ὅτι ζωὴν αἰώνιον ἔδωκεν ἡμῖν ὁ θεός",
          "significance": "God's testimony is greater - His testimony is that He gave us eternal life."
        },
        {
          "reference": "Revelation 12:11",
          "greek": "αὐτοὶ ἐνίκησαν αὐτὸν διὰ τὸ αἷμα τοῦ ἀρνίου καὶ διὰ τὸν λόγον τῆς μαρτυρίας αὐτῶν",
          "significance": "They conquered by the blood of the Lamb and the word of their testimony."
        }
      ],
      "theologicalSignificance": "Truth is established through witness. The Trinity testifies: Father to Son, Spirit to both. Scripture testifies to Christ. Believers receive and pass on testimony. Faithful witness may cost life - hence μάρτυς becomes 'martyr.' The testimony focuses on Christ: who He is, what He has done. Rejecting testimony brings judgment (John 3:32-33). Faithful witness is part of spiritual warfare (Rev 12:11). The church's mission is witness (Acts 1:8). This is not mere opinion-sharing but solemn attestation to divine truth.",
      "relatedWords": [
        {
          "greek": "μάρτυς",
          "transliteration": "martys",
          "relationship": "Witness, martyr"
        },
        {
          "greek": "μαρτυρέω",
          "transliteration": "martyreō",
          "relationship": "To testify, bear witness"
        },
        {
          "greek": "μαρτύριον",
          "transliteration": "martyrion",
          "relationship": "Testimony, evidence (Matt 8:4; 24:14)"
        }
      ],
      "tags": ["essential", "johannine", "revelation", "mission"],
      "volume": 4,
      "pages": "474-514"
    },
    {
      "id": "kosmos",
      "category": "eschatology",
      "greek": "κόσμος",
      "transliteration": "kosmos",
      "strongs": "G2889",
      "shortDef": "world, universe, humanity, world-system",
      "title": "World: Creation Under Judgment and Redemption",
      "summary": "Κόσμος has multiple meanings: the created order, humanity, or the world-system opposed to God. God loved the world and sent His Son to save it, yet the world lies in the evil one. Believers are in the world but not of it.",
      "classicalGreek": "In classical Greek, κόσμος meant 'order, arrangement, ornament' - hence 'cosmetics.' Philosophers applied it to the ordered universe (world). The term emphasizes ordered beauty - the world as structured, harmonious whole. It could also mean 'adornment.'",
      "lxxBackground": "The LXX uses κόσμος occasionally for 'ornament' (Ex 33:5-6; Isa 49:18) and for the ordered world (Gen 2:1; Deut 4:19 - 'host of heaven'). However, Hebrew thought typically spoke of 'heaven and earth' rather than κόσμος. The term gains theological significance primarily in later Judaism and the NT.",
      "intertestamental": "Greek philosophical concepts increasingly influenced Jewish thought. Wisdom literature personified Wisdom present at creation (Wisdom 9:9). 'This world' and 'the world to come' became standard eschatological categories. The world was God's creation but corrupted by evil.",
      "ntUsage": "Κόσμος means: (1) the created universe (John 1:10a; Acts 17:24); (2) humanity (John 3:16; Rom 3:19); (3) the world-system opposed to God (John 15:18-19; 1 John 2:15-17; 5:19). God made the world (John 1:10), loves it (3:16), sent Christ to save it (3:17; 1 John 4:14). Yet the world doesn't know God (John 1:10; 1 Cor 1:21), hates believers (John 15:18), and lies in the evil one (1 John 5:19). Believers must not love the world (1 John 2:15-17). Christ has overcome the world (John 16:33).",
      "keyPassages": [
        {
          "reference": "John 3:16",
          "greek": "οὕτως γὰρ ἠγάπησεν ὁ θεὸς τὸν κόσμον, ὥστε τὸν υἱὸν τὸν μονογενῆ ἔδωκεν",
          "significance": "God so loved the world - the extent of divine redemptive love."
        },
        {
          "reference": "1 John 2:15-16",
          "greek": "μὴ ἀγαπᾶτε τὸν κόσμον μηδὲ τὰ ἐν τῷ κόσμῳ... ὅτι πᾶν τὸ ἐν τῷ κόσμῳ... οὐκ ἔστιν ἐκ τοῦ πατρός",
          "significance": "Do not love the world - the world-system as opposed to the Father."
        },
        {
          "reference": "John 17:14-16",
          "greek": "οὐκ εἰσὶν ἐκ τοῦ κόσμου καθὼς ἐγὼ οὐκ εἰμὶ ἐκ τοῦ κόσμου",
          "significance": "Not of the world, even as I am not - in the world but not of it."
        }
      ],
      "theologicalSignificance": "The semantic range of κόσμος requires careful interpretation. God loves the world (humanity) and sent Christ to save it - this is not universalism but the scope of the offer. Yet believers must not 'love the world' (the anti-God system of values, priorities, and powers). The world-system is passing away (1 John 2:17; 1 Cor 7:31). Christ has overcome it (John 16:33). Believers are sent into the world (John 17:18) without being of it. Mission requires engagement without absorption. The tension between loving people and rejecting worldliness defines Christian existence until Christ returns.",
      "relatedWords": [
        {
          "greek": "κοσμικός",
          "transliteration": "kosmikos",
          "relationship": "Worldly, earthly (Titus 2:12; Heb 9:1)"
        },
        {
          "greek": "αἰών",
          "transliteration": "aiōn",
          "relationship": "Age, era - 'this age' parallels 'this world'"
        },
        {
          "greek": "γῆ",
          "transliteration": "gē",
          "relationship": "Earth, land - physical world"
        }
      ],
      "tags": ["essential", "johannine", "pauline", "eschatology"],
      "volume": 3,
      "pages": "868-898"
    }
  ]
}
