{
  "books": [
    { "id": "matt", "name": "Matthew", "chapters": 28 },
    { "id": "mark", "name": "Mark", "chapters": 16 },
    { "id": "luke", "name": "Luke", "chapters": 24 },
    { "id": "john", "name": "John", "chapters": 21 },
    { "id": "acts", "name": "Acts", "chapters": 28 },
    { "id": "rom", "name": "Romans", "chapters": 16 },
    { "id": "1cor", "name": "1 Corinthians", "chapters": 16 },
    { "id": "2cor", "name": "2 Corinthians", "chapters": 13 },
    { "id": "gal", "name": "Galatians", "chapters": 6 },
    { "id": "eph", "name": "Ephesians", "chapters": 6 },
    { "id": "phil", "name": "Philippians", "chapters": 4 },
    { "id": "col", "name": "Colossians", "chapters": 4 },
    { "id": "1thess", "name": "1 Thessalonians", "chapters": 5 },
    { "id": "2thess", "name": "2 Thessalonians", "chapters": 3 },
    { "id": "1tim", "name": "1 Timothy", "chapters": 6 },
    { "id": "2tim", "name": "2 Timothy", "chapters": 4 },
    { "id": "titus", "name": "Titus", "chapters": 3 },
    { "id": "phlm", "name": "Philemon", "chapters": 1 },
    { "id": "heb", "name": "Hebrews", "chapters": 13 },
    { "id": "jas", "name": "James", "chapters": 5 },
    { "id": "1pet", "name": "1 Peter", "chapters": 5 },
    { "id": "2pet", "name": "2 Peter", "chapters": 3 },
    { "id": "1john", "name": "1 John", "chapters": 5 },
    { "id": "2john", "name": "2 John", "chapters": 1 },
    { "id": "3john", "name": "3 John", "chapters": 1 },
    { "id": "jude", "name": "Jude", "chapters": 1 },
    { "id": "rev", "name": "Revelation", "chapters": 22 }
  ],
  "verses": [
    {
      "id": "john-1-1",
      "book": "john",
      "chapter": 1,
      "verse": 1,
      "reference": "John 1:1",
      "greek": "Ἐν ἀρχῇ ἦν ὁ λόγος, καὶ ὁ λόγος ἦν πρὸς τὸν θεόν, καὶ θεὸς ἦν ὁ λόγος.",
      "transliteration": "En archē ēn ho logos, kai ho logos ēn pros ton theon, kai theos ēn ho logos.",
      "referenceTranslation": "In the beginning was the Word, and the Word was with God, and the Word was God.",
      "keyTerms": ["beginning", "Word", "God"],
      "difficulty": 1,
      "notes": "Famous prologue of John's Gospel. Note the articular vs anarthrous θεός."
    },
    {
      "id": "john-1-14",
      "book": "john",
      "chapter": 1,
      "verse": 14,
      "reference": "John 1:14",
      "greek": "Καὶ ὁ λόγος σὰρξ ἐγένετο καὶ ἐσκήνωσεν ἐν ἡμῖν, καὶ ἐθεασάμεθα τὴν δόξαν αὐτοῦ, δόξαν ὡς μονογενοῦς παρὰ πατρός, πλήρης χάριτος καὶ ἀληθείας.",
      "transliteration": "Kai ho logos sarx egeneto kai eskēnōsen en hēmin, kai etheasametha tēn doxan autou, doxan hōs monogenous para patros, plērēs charitos kai alētheias.",
      "referenceTranslation": "And the Word became flesh and dwelt among us, and we have seen his glory, glory as of the only Son from the Father, full of grace and truth.",
      "keyTerms": ["Word", "flesh", "dwelt", "glory", "only Son", "grace", "truth"],
      "difficulty": 2,
      "notes": "The incarnation. ἐσκήνωσεν literally 'tabernacled' among us."
    },
    {
      "id": "john-3-16",
      "book": "john",
      "chapter": 3,
      "verse": 16,
      "reference": "John 3:16",
      "greek": "οὕτως γὰρ ἠγάπησεν ὁ θεὸς τὸν κόσμον, ὥστε τὸν υἱὸν τὸν μονογενῆ ἔδωκεν, ἵνα πᾶς ὁ πιστεύων εἰς αὐτὸν μὴ ἀπόληται ἀλλ᾽ ἔχῃ ζωὴν αἰώνιον.",
      "transliteration": "Houtōs gar ēgapēsen ho theos ton kosmon, hōste ton huion ton monogenē edōken, hina pas ho pisteuōn eis auton mē apolētai all' echē zōēn aiōnion.",
      "referenceTranslation": "For God so loved the world, that he gave his only Son, that whoever believes in him should not perish but have eternal life.",
      "keyTerms": ["loved", "world", "Son", "believes", "perish", "eternal life"],
      "difficulty": 2,
      "notes": "One of the most well-known verses. Note the purpose clause with ἵνα."
    },
    {
      "id": "john-11-35",
      "book": "john",
      "chapter": 11,
      "verse": 35,
      "reference": "John 11:35",
      "greek": "ἐδάκρυσεν ὁ Ἰησοῦς.",
      "transliteration": "Edakrysen ho Iēsous.",
      "referenceTranslation": "Jesus wept.",
      "keyTerms": ["wept", "Jesus"],
      "difficulty": 1,
      "notes": "The shortest verse in the Bible. Ingressive aorist - 'burst into tears'."
    },
    {
      "id": "john-14-6",
      "book": "john",
      "chapter": 14,
      "verse": 6,
      "reference": "John 14:6",
      "greek": "λέγει αὐτῷ ὁ Ἰησοῦς· ἐγώ εἰμι ἡ ὁδὸς καὶ ἡ ἀλήθεια καὶ ἡ ζωή· οὐδεὶς ἔρχεται πρὸς τὸν πατέρα εἰ μὴ δι᾽ ἐμοῦ.",
      "transliteration": "Legei autō ho Iēsous: Egō eimi hē hodos kai hē alētheia kai hē zōē; oudeis erchetai pros ton patera ei mē di' emou.",
      "referenceTranslation": "Jesus said to him, 'I am the way, and the truth, and the life. No one comes to the Father except through me.'",
      "keyTerms": ["way", "truth", "life", "Father", "through me"],
      "difficulty": 2,
      "notes": "One of the 'I am' statements. Note the emphatic ἐγώ εἰμι."
    },
    {
      "id": "matt-5-3",
      "book": "matt",
      "chapter": 5,
      "verse": 3,
      "reference": "Matthew 5:3",
      "greek": "Μακάριοι οἱ πτωχοὶ τῷ πνεύματι, ὅτι αὐτῶν ἐστιν ἡ βασιλεία τῶν οὐρανῶν.",
      "transliteration": "Makarioi hoi ptōchoi tō pneumati, hoti autōn estin hē basileia tōn ouranōn.",
      "referenceTranslation": "Blessed are the poor in spirit, for theirs is the kingdom of heaven.",
      "keyTerms": ["blessed", "poor", "spirit", "kingdom", "heaven"],
      "difficulty": 1,
      "notes": "First Beatitude. Dative of reference τῷ πνεύματι."
    },
    {
      "id": "matt-6-9",
      "book": "matt",
      "chapter": 6,
      "verse": 9,
      "reference": "Matthew 6:9",
      "greek": "Οὕτως οὖν προσεύχεσθε ὑμεῖς· Πάτερ ἡμῶν ὁ ἐν τοῖς οὐρανοῖς, ἁγιασθήτω τὸ ὄνομά σου·",
      "transliteration": "Houtōs oun proseuchesthe hymeis: Pater hēmōn ho en tois ouranois, hagiasthētō to onoma sou;",
      "referenceTranslation": "Pray then like this: 'Our Father in heaven, hallowed be your name.'",
      "keyTerms": ["pray", "Father", "heaven", "hallowed", "name"],
      "difficulty": 2,
      "notes": "Beginning of the Lord's Prayer. Aorist passive imperative ἁγιασθήτω."
    },
    {
      "id": "matt-28-19",
      "book": "matt",
      "chapter": 28,
      "verse": 19,
      "reference": "Matthew 28:19",
      "greek": "πορευθέντες οὖν μαθητεύσατε πάντα τὰ ἔθνη, βαπτίζοντες αὐτοὺς εἰς τὸ ὄνομα τοῦ πατρὸς καὶ τοῦ υἱοῦ καὶ τοῦ ἁγίου πνεύματος,",
      "transliteration": "Poreuthentes oun mathēteusate panta ta ethnē, baptizontes autous eis to onoma tou patros kai tou huiou kai tou hagiou pneumatos,",
      "referenceTranslation": "Go therefore and make disciples of all nations, baptizing them in the name of the Father and of the Son and of the Holy Spirit,",
      "keyTerms": ["go", "make disciples", "nations", "baptizing", "name", "Father", "Son", "Holy Spirit"],
      "difficulty": 2,
      "notes": "The Great Commission. Main verb is μαθητεύσατε (aorist imperative)."
    },
    {
      "id": "rom-1-16",
      "book": "rom",
      "chapter": 1,
      "verse": 16,
      "reference": "Romans 1:16",
      "greek": "Οὐ γὰρ ἐπαισχύνομαι τὸ εὐαγγέλιον, δύναμις γὰρ θεοῦ ἐστιν εἰς σωτηρίαν παντὶ τῷ πιστεύοντι, Ἰουδαίῳ τε πρῶτον καὶ Ἕλληνι.",
      "transliteration": "Ou gar epaischynomai to euangelion, dynamis gar theou estin eis sōtērian panti tō pisteuonti, Ioudaiō te prōton kai Hellēni.",
      "referenceTranslation": "For I am not ashamed of the gospel, for it is the power of God for salvation to everyone who believes, to the Jew first and also to the Greek.",
      "keyTerms": ["ashamed", "gospel", "power", "God", "salvation", "believes", "Jew", "Greek"],
      "difficulty": 2,
      "notes": "Theme verse of Romans. Note the substantival participle τῷ πιστεύοντι."
    },
    {
      "id": "rom-3-23",
      "book": "rom",
      "chapter": 3,
      "verse": 23,
      "reference": "Romans 3:23",
      "greek": "πάντες γὰρ ἥμαρτον καὶ ὑστεροῦνται τῆς δόξης τοῦ θεοῦ,",
      "transliteration": "Pantes gar hēmarton kai hysterountai tēs doxēs tou theou,",
      "referenceTranslation": "for all have sinned and fall short of the glory of God,",
      "keyTerms": ["all", "sinned", "fall short", "glory", "God"],
      "difficulty": 1,
      "notes": "Key verse on universal sinfulness. Gnomic aorist ἥμαρτον."
    },
    {
      "id": "rom-5-8",
      "book": "rom",
      "chapter": 5,
      "verse": 8,
      "reference": "Romans 5:8",
      "greek": "συνίστησιν δὲ τὴν ἑαυτοῦ ἀγάπην εἰς ἡμᾶς ὁ θεός, ὅτι ἔτι ἁμαρτωλῶν ὄντων ἡμῶν Χριστὸς ὑπὲρ ἡμῶν ἀπέθανεν.",
      "transliteration": "Synistēsin de tēn heautou agapēn eis hēmas ho theos, hoti eti hamartōlōn ontōn hēmōn Christos hyper hēmōn apethanen.",
      "referenceTranslation": "but God shows his love for us in that while we were still sinners, Christ died for us.",
      "keyTerms": ["shows", "love", "sinners", "Christ", "died"],
      "difficulty": 2,
      "notes": "God's demonstration of love. Genitive absolute ἁμαρτωλῶν ὄντων ἡμῶν."
    },
    {
      "id": "rom-6-23",
      "book": "rom",
      "chapter": 6,
      "verse": 23,
      "reference": "Romans 6:23",
      "greek": "τὰ γὰρ ὀψώνια τῆς ἁμαρτίας θάνατος, τὸ δὲ χάρισμα τοῦ θεοῦ ζωὴ αἰώνιος ἐν Χριστῷ Ἰησοῦ τῷ κυρίῳ ἡμῶν.",
      "transliteration": "Ta gar opsōnia tēs hamartias thanatos, to de charisma tou theou zōē aiōnios en Christō Iēsou tō kyriō hēmōn.",
      "referenceTranslation": "For the wages of sin is death, but the free gift of God is eternal life in Christ Jesus our Lord.",
      "keyTerms": ["wages", "sin", "death", "gift", "God", "eternal life", "Christ Jesus", "Lord"],
      "difficulty": 2,
      "notes": "Contrast between sin's wages and God's gift. ὀψώνια is a military term for soldier's pay."
    },
    {
      "id": "rom-8-28",
      "book": "rom",
      "chapter": 8,
      "verse": 28,
      "reference": "Romans 8:28",
      "greek": "οἴδαμεν δὲ ὅτι τοῖς ἀγαπῶσιν τὸν θεὸν πάντα συνεργεῖ εἰς ἀγαθόν, τοῖς κατὰ πρόθεσιν κλητοῖς οὖσιν.",
      "transliteration": "Oidamen de hoti tois agapōsin ton theon panta synergei eis agathon, tois kata prothesin klētois ousin.",
      "referenceTranslation": "And we know that for those who love God all things work together for good, for those who are called according to his purpose.",
      "keyTerms": ["know", "love", "God", "all things", "work together", "good", "called", "purpose"],
      "difficulty": 2,
      "notes": "Divine providence. Substantival participle τοῖς ἀγαπῶσιν."
    },
    {
      "id": "rom-12-1",
      "book": "rom",
      "chapter": 12,
      "verse": 1,
      "reference": "Romans 12:1",
      "greek": "Παρακαλῶ οὖν ὑμᾶς, ἀδελφοί, διὰ τῶν οἰκτιρμῶν τοῦ θεοῦ παραστῆσαι τὰ σώματα ὑμῶν θυσίαν ζῶσαν ἁγίαν εὐάρεστον τῷ θεῷ, τὴν λογικὴν λατρείαν ὑμῶν·",
      "transliteration": "Parakalō oun hymas, adelphoi, dia tōn oiktirmōn tou theou parastēsai ta sōmata hymōn thysian zōsan hagian euareston tō theō, tēn logikēn latreian hymōn;",
      "referenceTranslation": "I appeal to you therefore, brothers, by the mercies of God, to present your bodies as a living sacrifice, holy and acceptable to God, which is your spiritual worship.",
      "keyTerms": ["appeal", "brothers", "mercies", "God", "present", "bodies", "living sacrifice", "holy", "acceptable", "spiritual worship"],
      "difficulty": 3,
      "notes": "Transition to ethical exhortation. λογικὴν can mean 'rational' or 'spiritual'."
    },
    {
      "id": "1cor-13-4",
      "book": "1cor",
      "chapter": 13,
      "verse": 4,
      "reference": "1 Corinthians 13:4",
      "greek": "Ἡ ἀγάπη μακροθυμεῖ, χρηστεύεται ἡ ἀγάπη, οὐ ζηλοῖ, ἡ ἀγάπη οὐ περπερεύεται, οὐ φυσιοῦται,",
      "transliteration": "Hē agapē makrothymei, chrēsteuetai hē agapē, ou zēloi, hē agapē ou perpereuetai, ou physioutai,",
      "referenceTranslation": "Love is patient and kind; love does not envy or boast; it is not arrogant",
      "keyTerms": ["love", "patient", "kind", "envy", "boast", "arrogant"],
      "difficulty": 2,
      "notes": "The love chapter. Series of present tense verbs describing love's character."
    },
    {
      "id": "1cor-15-3-4",
      "book": "1cor",
      "chapter": 15,
      "verse": 3,
      "reference": "1 Corinthians 15:3-4",
      "greek": "παρέδωκα γὰρ ὑμῖν ἐν πρώτοις, ὃ καὶ παρέλαβον, ὅτι Χριστὸς ἀπέθανεν ὑπὲρ τῶν ἁμαρτιῶν ἡμῶν κατὰ τὰς γραφάς, καὶ ὅτι ἐτάφη, καὶ ὅτι ἐγήγερται τῇ ἡμέρᾳ τῇ τρίτῃ κατὰ τὰς γραφάς,",
      "transliteration": "Paredōka gar hymin en prōtois, ho kai parelabon, hoti Christos apethanen hyper tōn hamartiōn hēmōn kata tas graphas, kai hoti etaphē, kai hoti egēgertai tē hēmera tē tritē kata tas graphas,",
      "referenceTranslation": "For I delivered to you as of first importance what I also received: that Christ died for our sins in accordance with the Scriptures, that he was buried, that he was raised on the third day in accordance with the Scriptures,",
      "keyTerms": ["delivered", "received", "Christ", "died", "sins", "Scriptures", "buried", "raised", "third day"],
      "difficulty": 3,
      "notes": "Early Christian creed. Perfect tense ἐγήγερται emphasizes ongoing state of being raised."
    },
    {
      "id": "gal-2-20",
      "book": "gal",
      "chapter": 2,
      "verse": 20,
      "reference": "Galatians 2:20",
      "greek": "ζῶ δὲ οὐκέτι ἐγώ, ζῇ δὲ ἐν ἐμοὶ Χριστός· ὃ δὲ νῦν ζῶ ἐν σαρκί, ἐν πίστει ζῶ τῇ τοῦ υἱοῦ τοῦ θεοῦ τοῦ ἀγαπήσαντός με καὶ παραδόντος ἑαυτὸν ὑπὲρ ἐμοῦ.",
      "transliteration": "Zō de ouketi egō, zē de en emoi Christos; ho de nyn zō en sarki, en pistei zō tē tou huiou tou theou tou agapēsantos me kai paradontos heauton hyper emou.",
      "referenceTranslation": "It is no longer I who live, but Christ who lives in me. And the life I now live in the flesh I live by faith in the Son of God, who loved me and gave himself for me.",
      "keyTerms": ["live", "Christ", "flesh", "faith", "Son of God", "loved", "gave himself"],
      "difficulty": 3,
      "notes": "Union with Christ. Attributive participles τοῦ ἀγαπήσαντός... καὶ παραδόντος."
    },
    {
      "id": "gal-5-22-23",
      "book": "gal",
      "chapter": 5,
      "verse": 22,
      "reference": "Galatians 5:22-23",
      "greek": "ὁ δὲ καρπὸς τοῦ πνεύματός ἐστιν ἀγάπη, χαρά, εἰρήνη, μακροθυμία, χρηστότης, ἀγαθωσύνη, πίστις, πραΰτης, ἐγκράτεια· κατὰ τῶν τοιούτων οὐκ ἔστιν νόμος.",
      "transliteration": "Ho de karpos tou pneumatos estin agapē, chara, eirēnē, makrothymia, chrēstotēs, agathōsynē, pistis, prautēs, enkrateia; kata tōn toioutōn ouk estin nomos.",
      "referenceTranslation": "But the fruit of the Spirit is love, joy, peace, patience, kindness, goodness, faithfulness, gentleness, self-control; against such things there is no law.",
      "keyTerms": ["fruit", "Spirit", "love", "joy", "peace", "patience", "kindness", "goodness", "faithfulness", "gentleness", "self-control", "law"],
      "difficulty": 2,
      "notes": "The fruit of the Spirit. Singular καρπός with multiple manifestations."
    },
    {
      "id": "eph-2-8-9",
      "book": "eph",
      "chapter": 2,
      "verse": 8,
      "reference": "Ephesians 2:8-9",
      "greek": "τῇ γὰρ χάριτί ἐστε σεσῳσμένοι διὰ πίστεως· καὶ τοῦτο οὐκ ἐξ ὑμῶν, θεοῦ τὸ δῶρον· οὐκ ἐξ ἔργων, ἵνα μή τις καυχήσηται.",
      "transliteration": "Tē gar chariti este sesōsmenoi dia pisteōs; kai touto ouk ex hymōn, theou to dōron; ouk ex ergōn, hina mē tis kauchēsētai.",
      "referenceTranslation": "For by grace you have been saved through faith. And this is not your own doing; it is the gift of God, not a result of works, so that no one may boast.",
      "keyTerms": ["grace", "saved", "faith", "gift", "God", "works", "boast"],
      "difficulty": 2,
      "notes": "Salvation by grace through faith. Periphrastic perfect ἐστε σεσῳσμένοι."
    },
    {
      "id": "phil-2-5-7",
      "book": "phil",
      "chapter": 2,
      "verse": 5,
      "reference": "Philippians 2:5-7",
      "greek": "τοῦτο φρονεῖτε ἐν ὑμῖν ὃ καὶ ἐν Χριστῷ Ἰησοῦ, ὃς ἐν μορφῇ θεοῦ ὑπάρχων οὐχ ἁρπαγμὸν ἡγήσατο τὸ εἶναι ἴσα θεῷ, ἀλλ᾽ ἑαυτὸν ἐκένωσεν μορφὴν δούλου λαβών, ἐν ὁμοιώματι ἀνθρώπων γενόμενος·",
      "transliteration": "Touto phroneite en hymin ho kai en Christō Iēsou, hos en morphē theou hyparchōn ouch harpagmon hēgēsato to einai isa theō, all' heauton ekenōsen morphēn doulou labōn, en homoiōmati anthrōpōn genomenos;",
      "referenceTranslation": "Have this mind among yourselves, which is yours in Christ Jesus, who, though he was in the form of God, did not count equality with God a thing to be grasped, but emptied himself, by taking the form of a servant, being born in the likeness of men.",
      "keyTerms": ["mind", "Christ Jesus", "form", "God", "equality", "grasped", "emptied", "servant", "likeness", "men"],
      "difficulty": 3,
      "notes": "The Christ hymn. μορφῇ refers to essential nature, not mere appearance."
    },
    {
      "id": "phil-4-13",
      "book": "phil",
      "chapter": 4,
      "verse": 13,
      "reference": "Philippians 4:13",
      "greek": "πάντα ἰσχύω ἐν τῷ ἐνδυναμοῦντί με.",
      "transliteration": "Panta ischyō en tō endynamounti me.",
      "referenceTranslation": "I can do all things through him who strengthens me.",
      "keyTerms": ["all things", "can do", "strengthens"],
      "difficulty": 1,
      "notes": "Short but powerful. Substantival participle τῷ ἐνδυναμοῦντί."
    },
    {
      "id": "col-1-15-16",
      "book": "col",
      "chapter": 1,
      "verse": 15,
      "reference": "Colossians 1:15-16",
      "greek": "ὅς ἐστιν εἰκὼν τοῦ θεοῦ τοῦ ἀοράτου, πρωτότοκος πάσης κτίσεως, ὅτι ἐν αὐτῷ ἐκτίσθη τὰ πάντα ἐν τοῖς οὐρανοῖς καὶ ἐπὶ τῆς γῆς, τὰ ὁρατὰ καὶ τὰ ἀόρατα,",
      "transliteration": "Hos estin eikōn tou theou tou aoratou, prōtotokos pasēs ktiseōs, hoti en autō ektisthē ta panta en tois ouranois kai epi tēs gēs, ta horata kai ta aorata,",
      "referenceTranslation": "He is the image of the invisible God, the firstborn of all creation. For by him all things were created, in heaven and on earth, visible and invisible,",
      "keyTerms": ["image", "invisible", "God", "firstborn", "creation", "created", "heaven", "earth", "visible"],
      "difficulty": 3,
      "notes": "Colossian hymn. πρωτότοκος indicates priority and sovereignty, not creation."
    },
    {
      "id": "1thess-5-16-18",
      "book": "1thess",
      "chapter": 5,
      "verse": 16,
      "reference": "1 Thessalonians 5:16-18",
      "greek": "Πάντοτε χαίρετε, ἀδιαλείπτως προσεύχεσθε, ἐν παντὶ εὐχαριστεῖτε· τοῦτο γὰρ θέλημα θεοῦ ἐν Χριστῷ Ἰησοῦ εἰς ὑμᾶς.",
      "transliteration": "Pantote chairete, adialeiptōs proseuchesthe, en panti eucharisteite; touto gar thelēma theou en Christō Iēsou eis hymas.",
      "referenceTranslation": "Rejoice always, pray without ceasing, give thanks in all circumstances; for this is the will of God in Christ Jesus for you.",
      "keyTerms": ["rejoice", "always", "pray", "without ceasing", "give thanks", "circumstances", "will", "God"],
      "difficulty": 2,
      "notes": "Three short imperatives summarizing Christian living."
    },
    {
      "id": "2tim-3-16",
      "book": "2tim",
      "chapter": 3,
      "verse": 16,
      "reference": "2 Timothy 3:16",
      "greek": "πᾶσα γραφὴ θεόπνευστος καὶ ὠφέλιμος πρὸς διδασκαλίαν, πρὸς ἐλεγμόν, πρὸς ἐπανόρθωσιν, πρὸς παιδείαν τὴν ἐν δικαιοσύνῃ,",
      "transliteration": "Pasa graphē theopneustos kai ōphelimos pros didaskalian, pros elegmon, pros epanorthōsin, pros paideian tēn en dikaiosynē,",
      "referenceTranslation": "All Scripture is breathed out by God and profitable for teaching, for reproof, for correction, and for training in righteousness,",
      "keyTerms": ["Scripture", "breathed out", "God", "profitable", "teaching", "reproof", "correction", "training", "righteousness"],
      "difficulty": 2,
      "notes": "Inspiration of Scripture. θεόπνευστος is a compound: θεός + πνέω."
    },
    {
      "id": "heb-1-1-2",
      "book": "heb",
      "chapter": 1,
      "verse": 1,
      "reference": "Hebrews 1:1-2",
      "greek": "Πολυμερῶς καὶ πολυτρόπως πάλαι ὁ θεὸς λαλήσας τοῖς πατράσιν ἐν τοῖς προφήταις ἐπ᾽ ἐσχάτου τῶν ἡμερῶν τούτων ἐλάλησεν ἡμῖν ἐν υἱῷ,",
      "transliteration": "Polymerōs kai polytropōs palai ho theos lalēsas tois patrasin en tois prophētais ep' eschatou tōn hēmerōn toutōn elalēsen hēmin en huiō,",
      "referenceTranslation": "Long ago, at many times and in many ways, God spoke to our fathers by the prophets, but in these last days he has spoken to us by his Son,",
      "keyTerms": ["long ago", "many times", "many ways", "God", "spoke", "fathers", "prophets", "last days", "Son"],
      "difficulty": 3,
      "notes": "Elegant Greek prologue. Alliterative πολυμερῶς καὶ πολυτρόπως."
    },
    {
      "id": "heb-11-1",
      "book": "heb",
      "chapter": 11,
      "verse": 1,
      "reference": "Hebrews 11:1",
      "greek": "Ἔστιν δὲ πίστις ἐλπιζομένων ὑπόστασις, πραγμάτων ἔλεγχος οὐ βλεπομένων.",
      "transliteration": "Estin de pistis elpizomenōn hypostasis, pragmatōn elegchos ou blepomenōn.",
      "referenceTranslation": "Now faith is the assurance of things hoped for, the conviction of things not seen.",
      "keyTerms": ["faith", "assurance", "things hoped for", "conviction", "things not seen"],
      "difficulty": 2,
      "notes": "Definition of faith. ὑπόστασις can mean 'substance', 'assurance', or 'reality'."
    },
    {
      "id": "heb-12-1-2",
      "book": "heb",
      "chapter": 12,
      "verse": 1,
      "reference": "Hebrews 12:1-2",
      "greek": "τοιγαροῦν καὶ ἡμεῖς, τοσοῦτον ἔχοντες περικείμενον ἡμῖν νέφος μαρτύρων, ὄγκον ἀποθέμενοι πάντα καὶ τὴν εὐπερίστατον ἁμαρτίαν, δι᾽ ὑπομονῆς τρέχωμεν τὸν προκείμενον ἡμῖν ἀγῶνα, ἀφορῶντες εἰς τὸν τῆς πίστεως ἀρχηγὸν καὶ τελειωτὴν Ἰησοῦν,",
      "transliteration": "Toigaroun kai hēmeis, tosouton echontes perikeimenon hēmin nephos martyrōn, ogkon apothemenoi panta kai tēn euperistaton hamartian, di' hypomonēs trechōmen ton prokeimenon hēmin agōna, aphorontes eis ton tēs pisteōs archēgon kai teleiōtēn Iēsoun,",
      "referenceTranslation": "Therefore, since we are surrounded by so great a cloud of witnesses, let us also lay aside every weight, and sin which clings so closely, and let us run with endurance the race that is set before us, looking to Jesus, the founder and perfecter of our faith,",
      "keyTerms": ["cloud", "witnesses", "lay aside", "weight", "sin", "run", "endurance", "race", "looking", "Jesus", "founder", "perfecter", "faith"],
      "difficulty": 3,
      "notes": "Athletic imagery. νέφος μαρτύρων is a striking metaphor."
    },
    {
      "id": "jas-1-2-3",
      "book": "jas",
      "chapter": 1,
      "verse": 2,
      "reference": "James 1:2-3",
      "greek": "Πᾶσαν χαρὰν ἡγήσασθε, ἀδελφοί μου, ὅταν πειρασμοῖς περιπέσητε ποικίλοις, γινώσκοντες ὅτι τὸ δοκίμιον ὑμῶν τῆς πίστεως κατεργάζεται ὑπομονήν.",
      "transliteration": "Pasan charan hēgēsasthe, adelphoi mou, hotan peirasmois peripesēte poikilois, ginōskontes hoti to dokimion hymōn tēs pisteōs katergazetai hypomonēn.",
      "referenceTranslation": "Count it all joy, my brothers, when you meet trials of various kinds, for you know that the testing of your faith produces steadfastness.",
      "keyTerms": ["count", "joy", "brothers", "trials", "various kinds", "testing", "faith", "produces", "steadfastness"],
      "difficulty": 2,
      "notes": "Joy in trials. Aorist imperative ἡγήσασθε for decisive action."
    },
    {
      "id": "jas-1-22",
      "book": "jas",
      "chapter": 1,
      "verse": 22,
      "reference": "James 1:22",
      "greek": "Γίνεσθε δὲ ποιηταὶ λόγου καὶ μὴ μόνον ἀκροαταὶ παραλογιζόμενοι ἑαυτούς.",
      "transliteration": "Ginesthe de poiētai logou kai mē monon akroatai paralogizomenoi heautous.",
      "referenceTranslation": "But be doers of the word, and not hearers only, deceiving yourselves.",
      "keyTerms": ["doers", "word", "hearers only", "deceiving"],
      "difficulty": 1,
      "notes": "Faith and works. Present imperative γίνεσθε for ongoing action."
    },
    {
      "id": "1pet-2-9",
      "book": "1pet",
      "chapter": 2,
      "verse": 9,
      "reference": "1 Peter 2:9",
      "greek": "ὑμεῖς δὲ γένος ἐκλεκτόν, βασίλειον ἱεράτευμα, ἔθνος ἅγιον, λαὸς εἰς περιποίησιν, ὅπως τὰς ἀρετὰς ἐξαγγείλητε τοῦ ἐκ σκότους ὑμᾶς καλέσαντος εἰς τὸ θαυμαστὸν αὐτοῦ φῶς·",
      "transliteration": "Hymeis de genos eklekton, basileion hierateuma, ethnos hagion, laos eis peripoiēsin, hopōs tas aretas exangeilēte tou ek skotous hymas kalesantos eis to thaumaston autou phōs;",
      "referenceTranslation": "But you are a chosen race, a royal priesthood, a holy nation, a people for his own possession, that you may proclaim the excellencies of him who called you out of darkness into his marvelous light.",
      "keyTerms": ["chosen race", "royal priesthood", "holy nation", "people", "possession", "proclaim", "excellencies", "called", "darkness", "marvelous light"],
      "difficulty": 3,
      "notes": "OT allusions to Exodus 19:6 and Isaiah 43:20-21."
    },
    {
      "id": "1john-1-9",
      "book": "1john",
      "chapter": 1,
      "verse": 9,
      "reference": "1 John 1:9",
      "greek": "ἐὰν ὁμολογῶμεν τὰς ἁμαρτίας ἡμῶν, πιστός ἐστιν καὶ δίκαιος, ἵνα ἀφῇ ἡμῖν τὰς ἁμαρτίας καὶ καθαρίσῃ ἡμᾶς ἀπὸ πάσης ἀδικίας.",
      "transliteration": "Ean homologōmen tas hamartias hēmōn, pistos estin kai dikaios, hina aphē hēmin tas hamartias kai katharisē hēmas apo pasēs adikias.",
      "referenceTranslation": "If we confess our sins, he is faithful and just to forgive us our sins and to cleanse us from all unrighteousness.",
      "keyTerms": ["confess", "sins", "faithful", "just", "forgive", "cleanse", "unrighteousness"],
      "difficulty": 2,
      "notes": "Assurance of forgiveness. Third class condition (ἐάν + subjunctive)."
    },
    {
      "id": "1john-4-8",
      "book": "1john",
      "chapter": 4,
      "verse": 8,
      "reference": "1 John 4:8",
      "greek": "ὁ μὴ ἀγαπῶν οὐκ ἔγνω τὸν θεόν, ὅτι ὁ θεὸς ἀγάπη ἐστίν.",
      "transliteration": "Ho mē agapōn ouk egnō ton theon, hoti ho theos agapē estin.",
      "referenceTranslation": "Anyone who does not love does not know God, because God is love.",
      "keyTerms": ["love", "know", "God"],
      "difficulty": 1,
      "notes": "God's essential nature. Note anarthrous ἀγάπη as predicate nominative."
    },
    {
      "id": "rev-1-8",
      "book": "rev",
      "chapter": 1,
      "verse": 8,
      "reference": "Revelation 1:8",
      "greek": "Ἐγώ εἰμι τὸ ἄλφα καὶ τὸ ὦ, λέγει κύριος ὁ θεός, ὁ ὢν καὶ ὁ ἦν καὶ ὁ ἐρχόμενος, ὁ παντοκράτωρ.",
      "transliteration": "Egō eimi to alpha kai to ō, legei kyrios ho theos, ho ōn kai ho ēn kai ho erchomenos, ho pantokratōr.",
      "referenceTranslation": "'I am the Alpha and the Omega,' says the Lord God, 'who is and who was and who is to come, the Almighty.'",
      "keyTerms": ["Alpha", "Omega", "Lord God", "who is", "who was", "who is to come", "Almighty"],
      "difficulty": 2,
      "notes": "Divine self-declaration. Unusual grammar with periphrastic ὁ ἦν."
    },
    {
      "id": "rev-21-4",
      "book": "rev",
      "chapter": 21,
      "verse": 4,
      "reference": "Revelation 21:4",
      "greek": "καὶ ἐξαλείψει πᾶν δάκρυον ἐκ τῶν ὀφθαλμῶν αὐτῶν, καὶ ὁ θάνατος οὐκ ἔσται ἔτι· οὔτε πένθος οὔτε κραυγὴ οὔτε πόνος οὐκ ἔσται ἔτι, ὅτι τὰ πρῶτα ἀπῆλθαν.",
      "transliteration": "Kai exaleipsei pan dakryon ek tōn ophthalmōn autōn, kai ho thanatos ouk estai eti; oute penthos oute kraugē oute ponos ouk estai eti, hoti ta prōta apēlthan.",
      "referenceTranslation": "He will wipe away every tear from their eyes, and death shall be no more, neither shall there be mourning, nor crying, nor pain anymore, for the former things have passed away.",
      "keyTerms": ["wipe away", "tear", "eyes", "death", "no more", "mourning", "crying", "pain", "former things", "passed away"],
      "difficulty": 2,
      "notes": "New creation promise. Allusion to Isaiah 25:8."
    },
    {
      "id": "mark-1-15",
      "book": "mark",
      "chapter": 1,
      "verse": 15,
      "reference": "Mark 1:15",
      "greek": "καὶ λέγων ὅτι πεπλήρωται ὁ καιρὸς καὶ ἤγγικεν ἡ βασιλεία τοῦ θεοῦ· μετανοεῖτε καὶ πιστεύετε ἐν τῷ εὐαγγελίῳ.",
      "transliteration": "Kai legōn hoti peplērōtai ho kairos kai ēngiken hē basileia tou theou; metanoeite kai pisteuete en tō euangeliō.",
      "referenceTranslation": "and saying, 'The time is fulfilled, and the kingdom of God is at hand; repent and believe in the gospel.'",
      "keyTerms": ["time", "fulfilled", "kingdom", "God", "at hand", "repent", "believe", "gospel"],
      "difficulty": 2,
      "notes": "Jesus' inaugural message. Perfect tenses πεπλήρωται and ἤγγικεν."
    },
    {
      "id": "luke-2-10-11",
      "book": "luke",
      "chapter": 2,
      "verse": 10,
      "reference": "Luke 2:10-11",
      "greek": "καὶ εἶπεν αὐτοῖς ὁ ἄγγελος· μὴ φοβεῖσθε· ἰδοὺ γὰρ εὐαγγελίζομαι ὑμῖν χαρὰν μεγάλην ἥτις ἔσται παντὶ τῷ λαῷ, ὅτι ἐτέχθη ὑμῖν σήμερον σωτὴρ ὅς ἐστιν Χριστὸς κύριος ἐν πόλει Δαυίδ.",
      "transliteration": "Kai eipen autois ho angelos: Mē phobeisthe; idou gar euangelizomai hymin charan megalēn hētis estai panti tō laō, hoti etechthē hymin sēmeron sōtēr hos estin Christos kyrios en polei Dauid.",
      "referenceTranslation": "And the angel said to them, 'Fear not, for behold, I bring you good news of great joy that will be for all the people. For unto you is born this day in the city of David a Savior, who is Christ the Lord.'",
      "keyTerms": ["angel", "fear not", "good news", "great joy", "all the people", "born", "today", "city of David", "Savior", "Christ", "Lord"],
      "difficulty": 2,
      "notes": "Christmas narrative. εὐαγγελίζομαι is cognate with εὐαγγέλιον."
    },
    {
      "id": "acts-1-8",
      "book": "acts",
      "chapter": 1,
      "verse": 8,
      "reference": "Acts 1:8",
      "greek": "ἀλλὰ λήμψεσθε δύναμιν ἐπελθόντος τοῦ ἁγίου πνεύματος ἐφ᾽ ὑμᾶς καὶ ἔσεσθέ μου μάρτυρες ἔν τε Ἰερουσαλὴμ καὶ ἐν πάσῃ τῇ Ἰουδαίᾳ καὶ Σαμαρείᾳ καὶ ἕως ἐσχάτου τῆς γῆς.",
      "transliteration": "Alla lēmpsesthe dynamin epelthontos tou hagiou pneumatos eph' hymas kai esesthe mou martyres en te Ierousalēm kai en pasē tē Ioudaia kai Samareia kai heōs eschatou tēs gēs.",
      "referenceTranslation": "But you will receive power when the Holy Spirit has come upon you, and you will be my witnesses in Jerusalem and in all Judea and Samaria, and to the end of the earth.",
      "keyTerms": ["receive", "power", "Holy Spirit", "come upon", "witnesses", "Jerusalem", "Judea", "Samaria", "end", "earth"],
      "difficulty": 2,
      "notes": "Programmatic verse for Acts. Genitive absolute ἐπελθόντος τοῦ ἁγίου πνεύματος."
    },
    {
      "id": "acts-2-38",
      "book": "acts",
      "chapter": 2,
      "verse": 38,
      "reference": "Acts 2:38",
      "greek": "Πέτρος δὲ πρὸς αὐτούς· μετανοήσατε, φησίν, καὶ βαπτισθήτω ἕκαστος ὑμῶν ἐπὶ τῷ ὀνόματι Ἰησοῦ Χριστοῦ εἰς ἄφεσιν τῶν ἁμαρτιῶν ὑμῶν καὶ λήμψεσθε τὴν δωρεὰν τοῦ ἁγίου πνεύματος.",
      "transliteration": "Petros de pros autous: Metanoēsate, phēsin, kai baptisthētō hekastos hymōn epi tō onomati Iēsou Christou eis aphesin tōn hamartiōn hymōn kai lēmpsesthe tēn dōrean tou hagiou pneumatos.",
      "referenceTranslation": "And Peter said to them, 'Repent and be baptized every one of you in the name of Jesus Christ for the forgiveness of your sins, and you will receive the gift of the Holy Spirit.'",
      "keyTerms": ["Peter", "repent", "baptized", "name", "Jesus Christ", "forgiveness", "sins", "receive", "gift", "Holy Spirit"],
      "difficulty": 2,
      "notes": "Pentecost response. εἰς ἄφεσιν can be purpose or result."
    }
  ]
}
