{
  "synonymGroups": [
    {
      "id": "love-agapao-phileo",
      "category": "love",
      "title": "Words for Love",
      "englishWord": "love",
      "introduction": "English has only one primary word for 'love,' but Greek distinguishes between different types and expressions of love. Understanding these distinctions illuminates Jesus' famous exchange with Peter in John 21 and reveals the depth of God's love throughout Scripture.",
      "words": [
        {
          "greek": "ἀγαπάω",
          "transliteration": "agapaō",
          "strongs": "G25",
          "shortDef": "to love (unconditionally, sacrificially)",
          "nuance": "The distinctively Christian word for love. It denotes a deliberate, reasoned, purposeful love that seeks the highest good of the beloved regardless of their merit or response. This is the love of choice and will, not merely emotion.",
          "ntUsage": 143
        },
        {
          "greek": "φιλέω",
          "transliteration": "phileō",
          "strongs": "G5368",
          "shortDef": "to love (with affection, friendship)",
          "nuance": "Denotes tender affection, the love of friendship and natural emotional attachment. It implies warmth, fondness, and personal delight in the one loved. Often used for family affection and close friendship.",
          "ntUsage": 25
        },
        {
          "greek": "στέργω",
          "transliteration": "stergō",
          "strongs": "G4748",
          "shortDef": "to love (family affection)",
          "nuance": "Natural family affection, especially between parents and children. Appears only in compounds in the NT (ἄστοργος, φιλόστοργος), emphasizing natural bonds of kinship.",
          "ntUsage": 2
        }
      ],
      "vineQuote": "Agapaō is distinguished from phileō in this, that the former more frequently involves the idea of showing love by action, the latter more frequently suggests the idea of cherishing, of having affection for.",
      "exampleVerse": {
        "reference": "John 21:15-17",
        "greek": "Σίμων Ἰωάννου, ἀγαπᾷς με πλέον τούτων;... φιλῶ σε",
        "english": "Simon son of John, do you love (agapaō) me more than these?... I love (phileō) you.",
        "wordHighlighted": "ἀγαπάω and φιλέω"
      },
      "practicalTip": "When you see 'love' in your English Bible, ask: Is this ἀγαπάω (deliberate, sacrificial choice) or φιλέω (warm affection)? The distinction often reveals whether the emphasis is on commitment or emotion.",
      "tags": [
        "essential",
        "johannine",
        "famous-passage"
      ]
    },
    {
      "id": "know-ginosko-oida",
      "category": "know",
      "title": "Words for Know",
      "englishWord": "know",
      "introduction": "Greek distinguishes between knowledge gained through experience or learning and knowledge that is intuitive or complete. This distinction appears throughout the NT and affects our understanding of how we come to know God and truth.",
      "words": [
        {
          "greek": "γινώσκω",
          "transliteration": "ginōskō",
          "strongs": "G1097",
          "shortDef": "to know (by experience, progressively)",
          "nuance": "Denotes knowledge acquired through experience, observation, or learning. It suggests a progressive, growing knowledge that develops over time. Used for coming to know something that was previously unknown.",
          "ntUsage": 222
        },
        {
          "greek": "οἶδα",
          "transliteration": "oida",
          "strongs": "G1492",
          "shortDef": "to know (intuitively, completely)",
          "nuance": "Denotes fullness of knowledge, absolute or intuitive knowledge. It suggests knowing something completely without needing to learn it progressively. Often used of divine knowledge or settled convictions.",
          "ntUsage": 318
        },
        {
          "greek": "ἐπίσταμαι",
          "transliteration": "epistamai",
          "strongs": "G1987",
          "shortDef": "to know (by understanding, skill)",
          "nuance": "Knowledge based on close acquaintance or expertise. Suggests understanding how something works or being skilled in something. The root of our word 'epistemology.'",
          "ntUsage": 14
        }
      ],
      "vineQuote": "Ginōskō frequently suggests inception or progress in knowledge, while oida suggests fullness of knowledge.",
      "exampleVerse": {
        "reference": "John 8:55",
        "greek": "καὶ οὐκ ἐγνώκατε αὐτόν, ἐγὼ δὲ οἶδα αὐτόν",
        "english": "You do not know (ginōskō) him, but I know (oida) him.",
        "wordHighlighted": "γινώσκω and οἶδα"
      },
      "practicalTip": "γινώσκω often appears for growing in knowledge of God (Phil 3:10 'that I may know him'), while οἶδα appears for settled certainties (1 John 5:13 'that you may know you have eternal life').",
      "tags": [
        "essential",
        "johannine",
        "theological"
      ]
    },
    {
      "id": "see-blepo-horao",
      "category": "see",
      "title": "Words for See",
      "englishWord": "see",
      "introduction": "Greek has multiple words for seeing, each emphasizing a different aspect of perception. Some stress physical sight, others contemplation, and still others spiritual perception or revelation.",
      "words": [
        {
          "greek": "βλέπω",
          "transliteration": "blepō",
          "strongs": "G991",
          "shortDef": "to see, look at (physical sight)",
          "nuance": "The most general word for seeing, emphasizing the physical act of seeing or looking. Often used for ordinary observation without implying deep understanding.",
          "ntUsage": 133
        },
        {
          "greek": "ὁράω",
          "transliteration": "horaō",
          "strongs": "G3708",
          "shortDef": "to see (with perception, understanding)",
          "nuance": "Denotes seeing with understanding or spiritual perception. Often used for supernatural visions, seeing the significance of something, or perceiving truth. The aorist εἶδον emphasizes the completed act of perception.",
          "ntUsage": 454
        },
        {
          "greek": "θεωρέω",
          "transliteration": "theōreō",
          "strongs": "G2334",
          "shortDef": "to view, contemplate (as a spectator)",
          "nuance": "To view attentively, contemplate. Originally used for spectators at games or theater. Suggests careful observation and consideration of what is seen. Root of our word 'theory.'",
          "ntUsage": 58
        },
        {
          "greek": "θεάομαι",
          "transliteration": "theaomai",
          "strongs": "G2300",
          "shortDef": "to gaze upon, behold (with wonder)",
          "nuance": "To behold, view with a sense of wonder or appreciation. Emphasizes the impressive nature of what is seen. Often used for beholding Christ's glory.",
          "ntUsage": 22
        }
      ],
      "vineQuote": "Horaō and blepō both denote the physical sense of seeing; horaō, in general, implies direction of the thoughts to what is seen, while blepō denotes the act of seeing more specifically.",
      "exampleVerse": {
        "reference": "John 1:14",
        "greek": "καὶ ἐθεασάμεθα τὴν δόξαν αὐτοῦ",
        "english": "And we beheld (theaomai) his glory",
        "wordHighlighted": "θεάομαι"
      },
      "practicalTip": "When Scripture uses θεάομαι or θεωρέω instead of simple βλέπω, it's inviting you to contemplate and marvel, not just observe. Slow down and wonder.",
      "tags": [
        "perception",
        "johannine",
        "revelation"
      ]
    },
    {
      "id": "new-neos-kainos",
      "category": "new",
      "title": "Words for New",
      "englishWord": "new",
      "introduction": "English uses 'new' for both something recently made and something of a different quality. Greek distinguishes between new in time (νέος) and new in quality or nature (καινός). This distinction is crucial for understanding the 'new covenant' and 'new creation.'",
      "words": [
        {
          "greek": "νέος",
          "transliteration": "neos",
          "strongs": "G3501",
          "shortDef": "new (in time, recently made)",
          "nuance": "New in respect to time, recently made or come into existence. Young as opposed to old. Emphasizes recency rather than difference in kind. A νέος garment is a recently-made garment of the same type.",
          "ntUsage": 24
        },
        {
          "greek": "καινός",
          "transliteration": "kainos",
          "strongs": "G2537",
          "shortDef": "new (in quality, of a different kind)",
          "nuance": "New in quality, nature, or character. Not merely recent but different from what existed before - fresh, unprecedented, superior. A καινός covenant is not just a recent covenant but one of a fundamentally different character.",
          "ntUsage": 42
        }
      ],
      "vineQuote": "Kainos denotes that which is unaccustomed or unused, not new in time, recent, but new as to form or quality, of different nature from what is contrasted as old.",
      "exampleVerse": {
        "reference": "2 Corinthians 5:17",
        "greek": "εἴ τις ἐν Χριστῷ, καινὴ κτίσις",
        "english": "If anyone is in Christ, he is a new (kainos) creation",
        "wordHighlighted": "καινός"
      },
      "practicalTip": "The 'new covenant' (καινή διαθήκη) is not just the most recent covenant but a covenant of an entirely different character. The 'new creation' is not just a refreshed version of the old but something qualitatively different.",
      "tags": [
        "essential",
        "theological",
        "covenant"
      ]
    },
    {
      "id": "time-chronos-kairos",
      "category": "time",
      "title": "Words for Time",
      "englishWord": "time",
      "introduction": "Greek distinguishes between time as duration (χρόνος) and time as opportune moment (καιρός). This distinction reveals God's sovereign ordering of history and helps us understand biblical statements about 'times and seasons.'",
      "words": [
        {
          "greek": "χρόνος",
          "transliteration": "chronos",
          "strongs": "G5550",
          "shortDef": "time (as duration, period)",
          "nuance": "Time in its extent or duration, the succession of moments. Measurable, quantitative time. The root of our word 'chronology.' Asks 'how long?' rather than 'what kind of time?'",
          "ntUsage": 54
        },
        {
          "greek": "καιρός",
          "transliteration": "kairos",
          "strongs": "G2540",
          "shortDef": "time (as opportunity, season)",
          "nuance": "The right, proper, or opportune time. A decisive moment, a season of unique significance. Qualitative rather than quantitative - emphasizing the character of the time rather than its length.",
          "ntUsage": 85
        },
        {
          "greek": "αἰών",
          "transliteration": "aiōn",
          "strongs": "G165",
          "shortDef": "age, eternity (era or epoch)",
          "nuance": "An age or era, a period of time with distinctive characteristics. Can refer to eternity when used of God's time. The biblical view of history as divided into 'this age' and 'the age to come.'",
          "ntUsage": 122
        }
      ],
      "vineQuote": "Chronos marks quantity, kairos marks quality. Chronos is time measured; kairos is time as it affects circumstances or affords opportunities.",
      "exampleVerse": {
        "reference": "Acts 1:7",
        "greek": "οὐχ ὑμῶν ἐστιν γνῶναι χρόνους ἢ καιροὺς",
        "english": "It is not for you to know times (chronos) or seasons (kairos)",
        "wordHighlighted": "χρόνος and καιρός"
      },
      "practicalTip": "When Scripture speaks of 'redeeming the time' (Eph 5:16), it uses καιρός - we are to make the most of opportune moments. Look for God-given opportunities, not just the passage of time.",
      "tags": [
        "essential",
        "theological",
        "practical"
      ]
    },
    {
      "id": "life-bios-zoe",
      "category": "life",
      "title": "Words for Life",
      "englishWord": "life",
      "introduction": "Greek distinguishes between physical/biological life (βίος) and the principle of life itself, especially spiritual life (ζωή). John's Gospel especially uses ζωή for the divine life that Christ gives.",
      "words": [
        {
          "greek": "βίος",
          "transliteration": "bios",
          "strongs": "G979",
          "shortDef": "life (physical existence, livelihood)",
          "nuance": "The period or manner of earthly life, the means of living (livelihood), or life in its outward manifestation. Concerns how we live in the world. Root of our word 'biology.'",
          "ntUsage": 11
        },
        {
          "greek": "ζωή",
          "transliteration": "zōē",
          "strongs": "G2222",
          "shortDef": "life (the principle of life, spiritual life)",
          "nuance": "Life in its fullest, highest sense. The vital principle, especially the divine life that belongs to God and is given through Christ. In John's writings, almost always refers to eternal, spiritual life.",
          "ntUsage": 135
        },
        {
          "greek": "ψυχή",
          "transliteration": "psychē",
          "strongs": "G5590",
          "shortDef": "soul, life (the seat of personality)",
          "nuance": "The soul, the seat of personality, desires, and emotions. Can refer to physical life that can be lost (Matt 16:25) or the inner person. Root of our word 'psychology.'",
          "ntUsage": 103
        }
      ],
      "vineQuote": "Zōē is used of life as a principle, life in the absolute sense, life as God has it. Bios is used of the period or duration of life.",
      "exampleVerse": {
        "reference": "John 14:6",
        "greek": "ἐγώ εἰμι ἡ ὁδὸς καὶ ἡ ἀλήθεια καὶ ἡ ζωή",
        "english": "I am the way, the truth, and the life (zōē)",
        "wordHighlighted": "ζωή"
      },
      "practicalTip": "When John speaks of 'eternal life' (ζωὴ αἰώνιος), he means not just life that lasts forever but a quality of life - God's own life shared with us. It's not just duration but divine nature.",
      "tags": [
        "essential",
        "johannine",
        "theological"
      ]
    },
    {
      "id": "word-logos-rhema",
      "category": "word",
      "title": "Words for Word",
      "englishWord": "word",
      "introduction": "Greek has multiple terms for 'word,' each with distinct emphases. The most famous is λόγος, used for Christ in John 1, but ῥῆμα also appears frequently with its own nuances.",
      "words": [
        {
          "greek": "λόγος",
          "transliteration": "logos",
          "strongs": "G3056",
          "shortDef": "word (expression of thought, reason)",
          "nuance": "A word as the expression of thought, not the mere name of an object. Can mean word, speech, account, reason, or the divine Word (Christ). Emphasizes the underlying thought or meaning expressed.",
          "ntUsage": 330
        },
        {
          "greek": "ῥῆμα",
          "transliteration": "rhēma",
          "strongs": "G4487",
          "shortDef": "word (as spoken, utterance)",
          "nuance": "A word as spoken, a specific saying or utterance. Emphasizes the word as actually communicated, the spoken expression rather than the underlying concept. Often used for specific divine commands or promises.",
          "ntUsage": 68
        }
      ],
      "vineQuote": "The distinction between logos and rhēma is that the former denotes the expression of thought, the latter a saying or statement. In regard to the Scriptures, logos is the expression of divine thought as a whole; rhēma denotes particular words or sayings.",
      "exampleVerse": {
        "reference": "Romans 10:17",
        "greek": "ἄρα ἡ πίστις ἐξ ἀκοῆς, ἡ δὲ ἀκοὴ διὰ ῥήματος Χριστοῦ",
        "english": "So faith comes from hearing, and hearing through the word (rhēma) of Christ",
        "wordHighlighted": "ῥῆμα"
      },
      "practicalTip": "λόγος emphasizes Scripture as God's complete revelation and thought; ῥῆμα emphasizes specific words God speaks to us. Both are essential - the whole counsel of God and His specific direction.",
      "tags": [
        "essential",
        "johannine",
        "scripture"
      ]
    },
    {
      "id": "temple-hieron-naos",
      "category": "temple",
      "title": "Words for Temple",
      "englishWord": "temple",
      "introduction": "Greek distinguishes between the entire temple complex (ἱερόν) and the inner sanctuary where God's presence dwelt (ναός). This distinction illuminates many NT passages about worship, Jesus' body, and the church.",
      "words": [
        {
          "greek": "ἱερόν",
          "transliteration": "hieron",
          "strongs": "G2411",
          "shortDef": "temple (the entire sacred precinct)",
          "nuance": "The whole temple complex including courts, porticos, and surrounding areas. Where the people gathered, commerce occurred, and daily activities took place. Anyone could enter certain areas.",
          "ntUsage": 71
        },
        {
          "greek": "ναός",
          "transliteration": "naos",
          "strongs": "G3485",
          "shortDef": "temple (the inner sanctuary)",
          "nuance": "The inner shrine, the sanctuary proper where God's presence dwelt. Only priests could enter the Holy Place, only the high priest the Holy of Holies. Used figuratively for believers as God's dwelling.",
          "ntUsage": 45
        }
      ],
      "vineQuote": "Hieron denotes the entire precincts of the Temple in its enlarged form, while naos is used of the inner sanctuary, the shrine itself.",
      "exampleVerse": {
        "reference": "1 Corinthians 6:19",
        "greek": "τὸ σῶμα ὑμῶν ναὸς τοῦ ἐν ὑμῖν Ἁγίου Πνεύματός ἐστιν",
        "english": "Your body is a temple (naos) of the Holy Spirit within you",
        "wordHighlighted": "ναός"
      },
      "practicalTip": "When Paul says believers are God's ναός, he's not saying we're part of a religious complex - we are the very dwelling place of God's presence, as intimate and sacred as the Holy of Holies.",
      "tags": [
        "theological",
        "pauline",
        "ecclesiology"
      ]
    },
    {
      "id": "another-allos-heteros",
      "category": "another",
      "title": "Words for Another",
      "englishWord": "another",
      "introduction": "Greek distinguishes between another of the same kind (ἄλλος) and another of a different kind (ἕτερος). This distinction is crucial in passages about the Holy Spirit, false gospels, and Christ's uniqueness.",
      "words": [
        {
          "greek": "ἄλλος",
          "transliteration": "allos",
          "strongs": "G243",
          "shortDef": "another (of the same kind)",
          "nuance": "Another of the same sort, numerically distinct but qualitatively similar. When Jesus promises 'another Advocate' (ἄλλον παράκλητον), He means one of the same divine nature as Himself.",
          "ntUsage": 155
        },
        {
          "greek": "ἕτερος",
          "transliteration": "heteros",
          "strongs": "G2087",
          "shortDef": "another (of a different kind)",
          "nuance": "Another of a different quality or nature. Implies distinction not just in number but in kind. A 'different gospel' (ἕτερον εὐαγγέλιον) is fundamentally different from the true gospel.",
          "ntUsage": 98
        }
      ],
      "vineQuote": "Allos expresses a numerical difference and denotes another of the same sort; heteros expresses a qualitative difference and denotes another of a different sort.",
      "exampleVerse": {
        "reference": "John 14:16",
        "greek": "ἄλλον Παράκλητον δώσει ὑμῖν",
        "english": "He will give you another (allos) Helper",
        "wordHighlighted": "ἄλλος"
      },
      "practicalTip": "Jesus calls the Spirit 'another Helper' (ἄλλος) - same divine nature, same advocacy, same comfort. But Paul warns against 'another gospel' (ἕτερος in Gal 1:6) - fundamentally different and therefore damning.",
      "tags": [
        "essential",
        "pneumatology",
        "galatians"
      ]
    },
    {
      "id": "sin-hamartia-paraptoma",
      "category": "sin",
      "title": "Words for Sin",
      "englishWord": "sin",
      "introduction": "Greek has multiple words for human transgression, each highlighting a different aspect of sin. Together they give a comprehensive picture of humanity's fallen condition and need for redemption.",
      "words": [
        {
          "greek": "ἁμαρτία",
          "transliteration": "hamartia",
          "strongs": "G266",
          "shortDef": "sin (missing the mark)",
          "nuance": "The most common NT word for sin. Originally an archery term meaning to miss the mark or target. Emphasizes falling short of God's standard, failure to be what God intended.",
          "ntUsage": 173
        },
        {
          "greek": "παράβασις",
          "transliteration": "parabasis",
          "strongs": "G3847",
          "shortDef": "transgression (stepping across a line)",
          "nuance": "Transgression, overstepping a boundary. Implies a known law or command that has been deliberately crossed. Emphasizes willful disobedience to a clear standard.",
          "ntUsage": 7
        },
        {
          "greek": "παράπτωμα",
          "transliteration": "paraptōma",
          "strongs": "G3900",
          "shortDef": "trespass (falling aside)",
          "nuance": "A fall, slip, or false step. Suggests deviation from the right path, whether through carelessness or weakness. Less deliberate than parabasis but still culpable.",
          "ntUsage": 19
        },
        {
          "greek": "ἀνομία",
          "transliteration": "anomia",
          "strongs": "G458",
          "shortDef": "lawlessness (without law)",
          "nuance": "Lawlessness, disregard for law. Emphasizes the spirit of rebellion against God's authority, not just individual acts but a fundamental rejection of divine order.",
          "ntUsage": 15
        }
      ],
      "vineQuote": "Hamartia indicates a missing of the mark, the failure to attain to a fixed standard. Anomia indicates lawlessness, the disregard of law. Parabasis indicates the breaking of a definite law.",
      "exampleVerse": {
        "reference": "Romans 3:23",
        "greek": "πάντες γὰρ ἥμαρτον καὶ ὑστεροῦνται τῆς δόξης τοῦ θεοῦ",
        "english": "For all have sinned (hamartanō) and fall short of the glory of God",
        "wordHighlighted": "ἁμαρτάνω (verb form of ἁμαρτία)"
      },
      "practicalTip": "The variety of Greek words for sin shows that our problem is comprehensive - we miss God's mark, cross His boundaries, slip from His path, and rebel against His authority. We need a comprehensive Savior.",
      "tags": [
        "essential",
        "theological",
        "hamartiology"
      ]
    },
    {
      "id": "power-dynamis-exousia",
      "category": "power",
      "title": "Words for Power",
      "englishWord": "power",
      "introduction": "Greek distinguishes between inherent power or ability (δύναμις) and delegated authority or right (ἐξουσία). Both are used of God and given to believers, but in different senses.",
      "words": [
        {
          "greek": "δύναμις",
          "transliteration": "dynamis",
          "strongs": "G1411",
          "shortDef": "power (inherent ability, might)",
          "nuance": "Inherent power, ability, or might. The capacity to do something, often miraculous. Root of 'dynamite' and 'dynamic.' Emphasizes power as force or energy.",
          "ntUsage": 120
        },
        {
          "greek": "ἐξουσία",
          "transliteration": "exousia",
          "strongs": "G1849",
          "shortDef": "authority (right, permission)",
          "nuance": "Authority, the right or permission to act. Delegated power, jurisdiction, or liberty to do something. Emphasizes power as rightful authority rather than raw force.",
          "ntUsage": 102
        },
        {
          "greek": "ἰσχύς",
          "transliteration": "ischys",
          "strongs": "G2479",
          "shortDef": "strength (bodily or mental)",
          "nuance": "Strength, might, especially as manifested. Often used of physical strength or the capacity for forceful action.",
          "ntUsage": 10
        },
        {
          "greek": "κράτος",
          "transliteration": "kratos",
          "strongs": "G2904",
          "shortDef": "dominion (ruling power)",
          "nuance": "Dominion, ruling power, sovereignty. The power to control or govern. Often used in doxologies for God's supreme rule.",
          "ntUsage": 12
        }
      ],
      "vineQuote": "Dynamis is power in the sense of inherent ability or capability; exousia is authority, the right to exercise power.",
      "exampleVerse": {
        "reference": "Luke 4:36",
        "greek": "ἐν ἐξουσίᾳ καὶ δυνάμει ἐπιτάσσει τοῖς ἀκαθάρτοις πνεύμασιν",
        "english": "With authority (exousia) and power (dynamis) he commands the unclean spirits",
        "wordHighlighted": "ἐξουσία and δύναμις"
      },
      "practicalTip": "Jesus gave believers ἐξουσία (authority/right) to become children of God (John 1:12) and δύναμις (power/ability) through the Spirit (Acts 1:8). We have both the right and the resources.",
      "tags": [
        "essential",
        "christological",
        "pneumatology"
      ]
    },
    {
      "id": "servant-doulos-diakonos",
      "category": "servant",
      "title": "Words for Servant",
      "englishWord": "servant",
      "introduction": "Greek has several words for those who serve, each emphasizing different aspects of service. Understanding these distinctions clarifies roles in the church and the nature of Christian service.",
      "words": [
        {
          "greek": "δοῦλος",
          "transliteration": "doulos",
          "strongs": "G1401",
          "shortDef": "slave, bondservant",
          "nuance": "A slave, one bound to a master. Emphasizes complete ownership and absolute submission. Paul's favorite term for his relationship to Christ - total devotion with no rights of his own.",
          "ntUsage": 126
        },
        {
          "greek": "διάκονος",
          "transliteration": "diakonos",
          "strongs": "G1249",
          "shortDef": "servant, minister (one who serves)",
          "nuance": "A servant or attendant, one who renders service to another. Less emphasis on bondage, more on active ministry. Root of 'deacon.' Used for table service and general ministry.",
          "ntUsage": 29
        },
        {
          "greek": "ὑπηρέτης",
          "transliteration": "hypēretēs",
          "strongs": "G5257",
          "shortDef": "attendant, assistant (under-rower)",
          "nuance": "An under-rower, then any subordinate acting under another's direction. Suggests willing assistance and cooperation. Used for synagogue attendants and officers of various kinds.",
          "ntUsage": 20
        },
        {
          "greek": "θεράπων",
          "transliteration": "therapōn",
          "strongs": "G2324",
          "shortDef": "servant (with dignity, attendant)",
          "nuance": "A servant, but with dignity - a personal attendant. Used only of Moses in the NT (Heb 3:5), suggesting honored service. Root of 'therapist.'",
          "ntUsage": 1
        }
      ],
      "vineQuote": "Doulos denotes one who is in permanent relation of servitude to another, his will being wholly subject to the will of the other. Diakonos suggests more the idea of service than subjection.",
      "exampleVerse": {
        "reference": "Romans 1:1",
        "greek": "Παῦλος δοῦλος Χριστοῦ Ἰησοῦ",
        "english": "Paul, a servant (doulos) of Christ Jesus",
        "wordHighlighted": "δοῦλος"
      },
      "practicalTip": "Paul calls himself Christ's δοῦλος (slave) - he belongs entirely to Jesus. But to others he is a διάκονος (minister) - actively serving their needs. Total devotion upward, active service outward.",
      "tags": [
        "pauline",
        "ecclesiology",
        "practical"
      ]
    },
    {
      "id": "world-kosmos-aion",
      "category": "world",
      "title": "Words for World",
      "englishWord": "world",
      "introduction": "Greek uses several words translated 'world,' each with distinct meanings. Understanding these distinctions clarifies passages about Christian engagement with culture and eschatological hope.",
      "words": [
        {
          "greek": "κόσμος",
          "transliteration": "kosmos",
          "strongs": "G2889",
          "shortDef": "world (ordered system, humanity)",
          "nuance": "The ordered world, the universe, or humanity as a whole. Can be neutral (God so loved the world) or negative (the world's system opposed to God). Emphasizes order and arrangement.",
          "ntUsage": 186
        },
        {
          "greek": "αἰών",
          "transliteration": "aiōn",
          "strongs": "G165",
          "shortDef": "age, world (era or epoch)",
          "nuance": "An age, a period characterized by certain features. 'This age' vs 'the age to come.' When translated 'world,' emphasizes the temporal, passing nature of the present order.",
          "ntUsage": 122
        },
        {
          "greek": "οἰκουμένη",
          "transliteration": "oikoumenē",
          "strongs": "G3625",
          "shortDef": "world (the inhabited earth)",
          "nuance": "The inhabited world, the known world, the Roman Empire. Geographic rather than moral or temporal. Root of 'ecumenical.'",
          "ntUsage": 15
        },
        {
          "greek": "γῆ",
          "transliteration": "gē",
          "strongs": "G1093",
          "shortDef": "earth, land",
          "nuance": "The earth as opposed to heaven, or a particular land/region. Physical ground, territory. Can mean the whole earth or a specific country.",
          "ntUsage": 250
        }
      ],
      "vineQuote": "Kosmos is used of the earth as distinct from the universe, of mankind, and of the world system opposed to God. Aiōn stresses the idea of a period of time, an era.",
      "exampleVerse": {
        "reference": "Romans 12:2",
        "greek": "μὴ συσχηματίζεσθε τῷ αἰῶνι τούτῳ",
        "english": "Do not be conformed to this world (aiōn)",
        "wordHighlighted": "αἰών"
      },
      "practicalTip": "When Paul warns against conformity to 'this age' (αἰών), he emphasizes its temporary, passing nature. We live in this age but belong to the age to come. Don't invest too heavily in a passing order.",
      "tags": [
        "essential",
        "pauline",
        "eschatology"
      ]
    },
    {
      "id": "ask-aiteo-erotao",
      "category": "ask",
      "title": "Words for Ask",
      "englishWord": "ask",
      "introduction": "Greek distinguishes between asking as a request or petition and asking as inquiry. It also differentiates based on the relationship between the one asking and the one asked.",
      "words": [
        {
          "greek": "αἰτέω",
          "transliteration": "aiteō",
          "strongs": "G154",
          "shortDef": "to ask (request, petition)",
          "nuance": "To ask for something, to request or petition. Often implies asking from an inferior to a superior position. Used for prayer requests to God.",
          "ntUsage": 70
        },
        {
          "greek": "ἐρωτάω",
          "transliteration": "erōtaō",
          "strongs": "G2065",
          "shortDef": "to ask (inquire, or ask as equal)",
          "nuance": "To ask a question or inquire, or to make a request as one with a close relationship. Jesus uses this word for His intercession because He asks as the Son, not as a petitioner.",
          "ntUsage": 63
        },
        {
          "greek": "δέομαι",
          "transliteration": "deomai",
          "strongs": "G1189",
          "shortDef": "to beg, entreat (expressing need)",
          "nuance": "To beg or beseech, expressing an urgent need. More intense than aiteō, emphasizing the petitioner's felt need and earnestness.",
          "ntUsage": 22
        },
        {
          "greek": "παρακαλέω",
          "transliteration": "parakaleō",
          "strongs": "G3870",
          "shortDef": "to call alongside (appeal, comfort)",
          "nuance": "To call to one's side, hence to appeal, urge, comfort, or encourage. Can be asking but with the nuance of coming alongside to support or persuade.",
          "ntUsage": 109
        }
      ],
      "vineQuote": "Aiteō suggests the attitude of a suppliant, the petition of one who is lesser. Erōtaō suggests the familiarity of equals, or the request of one who has a right to ask.",
      "exampleVerse": {
        "reference": "John 16:26",
        "greek": "ἐν ἐκείνῃ τῇ ἡμέρᾳ ἐν τῷ ὀνόματί μου αἰτήσεσθε",
        "english": "In that day you will ask (aiteō) in my name",
        "wordHighlighted": "αἰτέω"
      },
      "practicalTip": "Jesus uses ἐρωτάω when He intercedes for us (John 17:9) - He asks as the beloved Son with intimate access. We use αἰτέω as petitioners, but through Christ we can 'ask in His name' with confidence.",
      "tags": [
        "prayer",
        "johannine",
        "practical"
      ]
    },
    {
      "id": "pray-proseuchomai-deomai",
      "category": "pray",
      "title": "Words for Prayer",
      "englishWord": "pray",
      "introduction": "The NT uses several words for prayer, each highlighting different aspects of communion with God. Together they give a rich vocabulary for our relationship with the Father.",
      "words": [
        {
          "greek": "προσεύχομαι",
          "transliteration": "proseuchomai",
          "strongs": "G4336",
          "shortDef": "to pray (general term for prayer)",
          "nuance": "The most general and comprehensive word for prayer. Includes adoration, confession, thanksgiving, and supplication. Exclusively used for prayer to God, never to humans.",
          "ntUsage": 85
        },
        {
          "greek": "δέομαι",
          "transliteration": "deomai",
          "strongs": "G1189",
          "shortDef": "to beg, supplicate (expressing need)",
          "nuance": "To beg or entreat, emphasizing the petitioner's sense of need. More intense than a general request, it expresses urgency and dependency.",
          "ntUsage": 22
        },
        {
          "greek": "αἰτέω",
          "transliteration": "aiteō",
          "strongs": "G154",
          "shortDef": "to ask (make specific requests)",
          "nuance": "To ask for something specific, to petition. When used of prayer, emphasizes specific requests brought to God.",
          "ntUsage": 70
        },
        {
          "greek": "ἐντυγχάνω",
          "transliteration": "entynchanō",
          "strongs": "G1793",
          "shortDef": "to intercede (meet with, plead)",
          "nuance": "To meet with, hence to make intercession. Used for Christ's and the Spirit's intercession for believers. Suggests personal access and pleading on another's behalf.",
          "ntUsage": 5
        }
      ],
      "vineQuote": "Proseuchomai is used of prayer in general; deomai stresses the sense of need; aiteō emphasizes the request for particular things.",
      "exampleVerse": {
        "reference": "Romans 8:26",
        "greek": "τὸ πνεῦμα ὑπερεντυγχάνει στεναγμοῖς ἀλαλήτοις",
        "english": "The Spirit himself intercedes (hyperentynchanō) with groanings too deep for words",
        "wordHighlighted": "ὑπερεντυγχάνω (intensive form of ἐντυγχάνω)"
      },
      "practicalTip": "When you don't know how to pray, remember that the Spirit ἐντυγχάνει (intercedes) for you - He has personal access to the Father and pleads on your behalf. Your weakness in prayer is covered.",
      "tags": [
        "prayer",
        "pneumatology",
        "pauline"
      ]
    },
    {
      "id": "faith-pistis-peitho",
      "category": "faith",
      "title": "Words for Faith and Belief",
      "englishWord": "faith/believe",
      "introduction": "Greek has related words for faith, belief, and trust that illuminate different aspects of saving faith. Understanding these distinctions enriches our grasp of how we relate to God through Christ.",
      "words": [
        {
          "greek": "πίστις",
          "transliteration": "pistis",
          "strongs": "G4102",
          "shortDef": "faith (trust, conviction, faithfulness)",
          "nuance": "Faith as a settled conviction, trust that rests on the character of another. Can mean the act of believing, the content of belief, or faithfulness/reliability. The primary NT word for saving faith.",
          "ntUsage": 243
        },
        {
          "greek": "πιστεύω",
          "transliteration": "pisteuō",
          "strongs": "G4100",
          "shortDef": "to believe (entrust oneself)",
          "nuance": "The verb form - to believe, to entrust. With εἰς ('into') suggests committing oneself to Christ, not mere intellectual assent. Used 98 times in John's Gospel alone.",
          "ntUsage": 241
        },
        {
          "greek": "πείθω",
          "transliteration": "peithō",
          "strongs": "G3982",
          "shortDef": "to persuade, be convinced",
          "nuance": "To persuade or win over, or (in perfect tense) to be persuaded, to have confidence. Emphasizes the process of becoming convinced rather than the state of faith.",
          "ntUsage": 52
        },
        {
          "greek": "πεποίθησις",
          "transliteration": "pepoithēsis",
          "strongs": "G4006",
          "shortDef": "confidence (settled trust)",
          "nuance": "Confidence, assurance, trust. The noun form of the perfect of πείθω. Emphasizes the settled state of trust that results from being convinced.",
          "ntUsage": 6
        }
      ],
      "vineQuote": "Pistis primarily means firm persuasion, a conviction based on hearing. It is used of faith in God or Christ, trust in the person and testimony of God.",
      "exampleVerse": {
        "reference": "Hebrews 11:1",
        "greek": "Ἔστιν δὲ πίστις ἐλπιζομένων ὑπόστασις",
        "english": "Now faith (pistis) is the substance of things hoped for",
        "wordHighlighted": "πίστις"
      },
      "practicalTip": "πιστεύω εἰς Χριστόν (believe INTO Christ) suggests more than mental assent - it's committing your whole self to Him, like stepping onto a bridge you trust to hold you.",
      "tags": [
        "essential",
        "theological",
        "johannine"
      ]
    },
    {
      "id": "grace-charis-eleos",
      "category": "grace",
      "title": "Words for Grace and Mercy",
      "englishWord": "grace/mercy",
      "introduction": "Greek distinguishes between unmerited favor (χάρις), compassion for the miserable (ἔλεος), and kindness in action (χρηστότης). These words together paint the full picture of God's gracious character.",
      "words": [
        {
          "greek": "χάρις",
          "transliteration": "charis",
          "strongs": "G5485",
          "shortDef": "grace (unmerited favor)",
          "nuance": "Grace, unmerited favor, the free gift of salvation. Emphasizes the giver's generosity and the recipient's unworthiness. The distinctively Christian understanding goes beyond classical Greek usage.",
          "ntUsage": 156
        },
        {
          "greek": "ἔλεος",
          "transliteration": "eleos",
          "strongs": "G1656",
          "shortDef": "mercy (compassion for the miserable)",
          "nuance": "Mercy, pity, compassion shown to those in distress or misery. Responds to human need and wretchedness. Often paired with grace - mercy for the miserable, grace for the guilty.",
          "ntUsage": 27
        },
        {
          "greek": "χρηστότης",
          "transliteration": "chrēstotēs",
          "strongs": "G5544",
          "shortDef": "kindness (goodness in action)",
          "nuance": "Kindness, goodness, benevolence. Grace and mercy expressed in tangible action. The practical outworking of a gracious disposition.",
          "ntUsage": 10
        },
        {
          "greek": "οἰκτιρμός",
          "transliteration": "oiktirmos",
          "strongs": "G3628",
          "shortDef": "compassion (deep feeling of pity)",
          "nuance": "Pity, compassion, the inward feeling of mercy. Often used in the plural to emphasize the depths of divine compassion. More emotional than ἔλεος.",
          "ntUsage": 5
        }
      ],
      "vineQuote": "Grace and mercy are to be distinguished. Grace is shown to the guilty, mercy to the miserable. Grace meets our guilt, mercy meets our misery.",
      "exampleVerse": {
        "reference": "Ephesians 2:4-5",
        "greek": "διὰ τὴν πολλὴν ἀγάπην αὐτοῦ ἣν ἠγάπησεν ἡμᾶς... χάριτί ἐστε σεσῳσμένοι",
        "english": "Because of his great love... by grace (charis) you have been saved",
        "wordHighlighted": "χάρις"
      },
      "practicalTip": "We need both χάρις and ἔλεος - grace because we are guilty before God, mercy because we are miserable in our sin. God provides both abundantly in Christ.",
      "tags": [
        "essential",
        "pauline",
        "salvation"
      ]
    },
    {
      "id": "forgive-aphiemi-charizomai",
      "category": "forgive",
      "title": "Words for Forgiveness",
      "englishWord": "forgive",
      "introduction": "Greek uses different words for forgiveness, each emphasizing a different aspect - releasing a debt, graciously canceling, or the divine act of pardon. These distinctions enrich our understanding of God's forgiveness.",
      "words": [
        {
          "greek": "ἀφίημι",
          "transliteration": "aphiēmi",
          "strongs": "G863",
          "shortDef": "to send away, release, forgive",
          "nuance": "To send away, release, let go. When used for forgiveness, emphasizes dismissing the offense as if sending it away. The most common NT word for divine forgiveness.",
          "ntUsage": 143
        },
        {
          "greek": "χαρίζομαι",
          "transliteration": "charizomai",
          "strongs": "G5483",
          "shortDef": "to forgive graciously (grant freely)",
          "nuance": "To show grace, forgive freely, grant as a favor. Related to χάρις (grace). Emphasizes the gracious, undeserved nature of forgiveness. Used for forgiving debts and sins.",
          "ntUsage": 23
        },
        {
          "greek": "πάρεσις",
          "transliteration": "paresis",
          "strongs": "G3929",
          "shortDef": "passing over (temporary suspension)",
          "nuance": "A passing by, pretermission. Used only in Rom 3:25 for God's temporary passing over of sins before Christ. Distinct from full forgiveness (ἄφεσις).",
          "ntUsage": 1
        },
        {
          "greek": "ἄφεσις",
          "transliteration": "aphesis",
          "strongs": "G859",
          "shortDef": "forgiveness, release (complete pardon)",
          "nuance": "Release, pardon, forgiveness. The noun form of ἀφίημι. Complete remission of sins, not just passing over. Often in the phrase 'forgiveness of sins.'",
          "ntUsage": 17
        }
      ],
      "vineQuote": "Aphiēmi literally means to send away. When applied to sins, it signifies letting them go, dismissing them as if they had never been. Charizomai adds the element of grace - forgiving freely and graciously.",
      "exampleVerse": {
        "reference": "Colossians 2:13",
        "greek": "χαρισάμενος ἡμῖν πάντα τὰ παραπτώματα",
        "english": "Having forgiven (charizomai) us all our trespasses",
        "wordHighlighted": "χαρίζομαι"
      },
      "practicalTip": "In Ephesians 4:32, we are to forgive (χαρίζομαι) 'as God in Christ forgave you' - freely, graciously, without demanding payment. This is costly forgiveness, not cheap tolerance.",
      "tags": [
        "salvation",
        "pauline",
        "practical"
      ]
    },
    {
      "id": "holy-hagios-hieros",
      "category": "holy",
      "title": "Words for Holy and Sacred",
      "englishWord": "holy",
      "introduction": "Greek has several words translated 'holy' or 'sacred,' each with distinct emphases. Understanding these helps us grasp both God's holiness and our calling to be holy.",
      "words": [
        {
          "greek": "ἅγιος",
          "transliteration": "hagios",
          "strongs": "G40",
          "shortDef": "holy (set apart, morally pure)",
          "nuance": "Set apart for God, morally pure, sacred. The primary NT word for holiness. Emphasizes both separation from the profane and positive dedication to God. Used for God, believers, and sacred things.",
          "ntUsage": 233
        },
        {
          "greek": "ἱερός",
          "transliteration": "hieros",
          "strongs": "G2413",
          "shortDef": "sacred (pertaining to worship)",
          "nuance": "Sacred, connected with religious rites and worship. Focuses on external, ceremonial holiness rather than moral purity. Root of 'hierarchy.' Rarely used in NT.",
          "ntUsage": 2
        },
        {
          "greek": "ὅσιος",
          "transliteration": "hosios",
          "strongs": "G3741",
          "shortDef": "holy (devout, pious, meeting divine standards)",
          "nuance": "Holy in the sense of meeting divine requirements, devout, pious. Emphasizes conformity to God's will and character. Used of Christ and believers who fulfill their obligations to God.",
          "ntUsage": 8
        },
        {
          "greek": "ἁγιάζω",
          "transliteration": "hagiazō",
          "strongs": "G37",
          "shortDef": "to sanctify (make holy, set apart)",
          "nuance": "To make holy, consecrate, sanctify. The verb form of ἅγιος. Can refer to initial sanctification (being set apart) or progressive sanctification (becoming more holy).",
          "ntUsage": 28
        }
      ],
      "vineQuote": "Hagios fundamentally signifies separated, and hence in Scripture is used of God, who is separated from all moral evil, and of persons and things separated to God.",
      "exampleVerse": {
        "reference": "1 Peter 1:15-16",
        "greek": "ἅγιοι ἔσεσθε, ὅτι ἐγὼ ἅγιος",
        "english": "Be holy (hagios), for I am holy (hagios)",
        "wordHighlighted": "ἅγιος"
      },
      "practicalTip": "NT holiness (ἅγιος) is not merely ceremonial or external (ἱερός) but moral and personal. We are called to share in God's moral character, not just participate in religious rituals.",
      "tags": [
        "essential",
        "theological",
        "petrine"
      ]
    },
    {
      "id": "righteous-dikaios-hosios",
      "category": "righteous",
      "title": "Words for Righteous",
      "englishWord": "righteous",
      "introduction": "Greek distinguishes between righteousness in relation to law (δίκαιος) and piety in relation to God (ὅσιος). Both are essential aspects of Christian character.",
      "words": [
        {
          "greek": "δίκαιος",
          "transliteration": "dikaios",
          "strongs": "G1342",
          "shortDef": "righteous (just, conforming to law)",
          "nuance": "Righteous, just, upright. Conforming to what is right by divine or human standards. The primary NT term for righteousness. Used both of legal standing before God and of actual conduct.",
          "ntUsage": 79
        },
        {
          "greek": "δικαιοσύνη",
          "transliteration": "dikaiosynē",
          "strongs": "G1343",
          "shortDef": "righteousness (the quality or state)",
          "nuance": "Righteousness, justice. The noun form. In Paul, often refers to the righteousness imputed by faith; in James and Matthew, often ethical righteousness in conduct.",
          "ntUsage": 92
        },
        {
          "greek": "ὅσιος",
          "transliteration": "hosios",
          "strongs": "G3741",
          "shortDef": "holy (pious, devout)",
          "nuance": "Holy, devout, meeting one's obligations to God. While δίκαιος focuses on conformity to law, ὅσιος emphasizes inner devotion and piety.",
          "ntUsage": 8
        },
        {
          "greek": "δικαιόω",
          "transliteration": "dikaioō",
          "strongs": "G1344",
          "shortDef": "to justify (declare righteous)",
          "nuance": "To justify, declare righteous, acquit. The forensic term for God's declaration that sinners are righteous in Christ. The heart of Pauline soteriology.",
          "ntUsage": 39
        }
      ],
      "vineQuote": "Dikaios denotes right conduct toward men; hosios, piety toward God. The dikaios fulfills his duty to man; the hosios to God.",
      "exampleVerse": {
        "reference": "Romans 3:26",
        "greek": "εἰς τὸ εἶναι αὐτὸν δίκαιον καὶ δικαιοῦντα τὸν ἐκ πίστεως Ἰησοῦ",
        "english": "So that he might be just (dikaios) and the justifier (dikaioō) of the one who has faith in Jesus",
        "wordHighlighted": "δίκαιος and δικαιόω"
      },
      "practicalTip": "God is both δίκαιος (just, maintaining his righteous standard) and the one who δικαιόω (justifies) sinners. The cross satisfies both - justice is upheld, sinners are declared righteous.",
      "tags": [
        "essential",
        "pauline",
        "salvation"
      ]
    },
    {
      "id": "truth-aletheia-alethinos",
      "category": "truth",
      "title": "Words for Truth",
      "englishWord": "truth",
      "introduction": "Greek has several words related to truth, distinguishing between truth as reality, truthful speech, and genuine/authentic things. John especially develops the theological meaning of truth.",
      "words": [
        {
          "greek": "ἀλήθεια",
          "transliteration": "alētheia",
          "strongs": "G225",
          "shortDef": "truth (reality, genuineness)",
          "nuance": "Truth as opposed to falsehood, reality as opposed to appearance. In John, truth is a theological concept connected to divine revelation and Christ himself. 'The truth shall set you free.'",
          "ntUsage": 109
        },
        {
          "greek": "ἀληθής",
          "transliteration": "alēthēs",
          "strongs": "G227",
          "shortDef": "true (truthful, genuine)",
          "nuance": "True, truthful, honest. Describes a person who speaks truth or a statement that accords with reality. Emphasizes the correspondence with fact.",
          "ntUsage": 26
        },
        {
          "greek": "ἀληθινός",
          "transliteration": "alēthinos",
          "strongs": "G228",
          "shortDef": "true (real, genuine, authentic)",
          "nuance": "True in the sense of real, genuine, authentic. Not a copy or counterfeit but the original reality. Used of God as the true God, Christ as the true light, and the heavenly tabernacle as the true sanctuary.",
          "ntUsage": 28
        },
        {
          "greek": "ἀληθῶς",
          "transliteration": "alēthōs",
          "strongs": "G230",
          "shortDef": "truly (in truth, really)",
          "nuance": "Truly, really, indeed. The adverb form, confirming the reality or certainty of something. 'Truly this was the Son of God.'",
          "ntUsage": 18
        }
      ],
      "vineQuote": "Alēthēs denotes true as opposed to false. Alēthinos denotes real, genuine, ideal, as opposed to what is fictitious, counterfeit, or merely typical.",
      "exampleVerse": {
        "reference": "John 14:6",
        "greek": "ἐγώ εἰμι ἡ ὁδὸς καὶ ἡ ἀλήθεια καὶ ἡ ζωή",
        "english": "I am the way, the truth (alētheia), and the life",
        "wordHighlighted": "ἀλήθεια"
      },
      "practicalTip": "Christ is ἀλήθεια (truth/reality) and ἀληθινός (the genuine, authentic one). False christs are counterfeits; Jesus is the real thing. All truth ultimately connects to Him.",
      "tags": [
        "essential",
        "johannine",
        "christological"
      ]
    },
    {
      "id": "wisdom-sophia-phronesis",
      "category": "wisdom",
      "title": "Words for Wisdom",
      "englishWord": "wisdom",
      "introduction": "Greek distinguishes between speculative wisdom (σοφία), practical wisdom (φρόνησις), and understanding (σύνεσις). These distinctions help us understand what Scripture means by true wisdom.",
      "words": [
        {
          "greek": "σοφία",
          "transliteration": "sophia",
          "strongs": "G4678",
          "shortDef": "wisdom (insight into truth)",
          "nuance": "Wisdom, insight into the nature of things, especially the wisdom of God. In Paul, contrasted with worldly wisdom. Can refer to wisdom as a divine attribute or as a gift to believers.",
          "ntUsage": 51
        },
        {
          "greek": "φρόνησις",
          "transliteration": "phronēsis",
          "strongs": "G5428",
          "shortDef": "prudence (practical wisdom)",
          "nuance": "Prudence, practical wisdom, the ability to discern the proper course of action. Wisdom applied to daily decisions and moral choices. Less philosophical than σοφία.",
          "ntUsage": 2
        },
        {
          "greek": "σύνεσις",
          "transliteration": "synesis",
          "strongs": "G4907",
          "shortDef": "understanding (putting things together)",
          "nuance": "Understanding, intelligence, the ability to put things together mentally. From συν (together) + ἵημι (send). The capacity to comprehend relationships between ideas.",
          "ntUsage": 7
        },
        {
          "greek": "γνῶσις",
          "transliteration": "gnōsis",
          "strongs": "G1108",
          "shortDef": "knowledge (acquired understanding)",
          "nuance": "Knowledge, especially as acquired through learning or experience. In 1 Corinthians, sometimes used negatively of knowledge that puffs up without love. Distinguished from wisdom.",
          "ntUsage": 29
        }
      ],
      "vineQuote": "Sophia is insight into the true nature of things. Phronesis is the ability to discern modes of action with a view to their results. Synesis is understanding, the capacity to bring things together.",
      "exampleVerse": {
        "reference": "Colossians 1:9",
        "greek": "πληρωθῆτε τὴν ἐπίγνωσιν τοῦ θελήματος αὐτοῦ ἐν πάσῃ σοφίᾳ καὶ συνέσει πνευματικῇ",
        "english": "Be filled with the knowledge of his will in all spiritual wisdom (sophia) and understanding (synesis)",
        "wordHighlighted": "σοφία and σύνεσις"
      },
      "practicalTip": "We need both σοφία (seeing truth) and φρόνησις (applying it wisely). Knowledge without practical wisdom leads to pride; practical wisdom without truth leads to pragmatism.",
      "tags": [
        "practical",
        "pauline",
        "wisdom"
      ]
    },
    {
      "id": "fear-phobos-deilia",
      "category": "fear",
      "title": "Words for Fear",
      "englishWord": "fear",
      "introduction": "Greek distinguishes between reverential awe (εὐλάβεια), fear that may be good or bad (φόβος), and cowardly fear (δειλία). The fear of the Lord is fundamentally different from sinful terror.",
      "words": [
        {
          "greek": "φόβος",
          "transliteration": "phobos",
          "strongs": "G5401",
          "shortDef": "fear (awe or terror)",
          "nuance": "Fear, terror, or reverential awe. The most general word for fear. Can be negative (sinful fear) or positive (godly fear). Context determines whether it's healthy reverence or unhealthy terror.",
          "ntUsage": 47
        },
        {
          "greek": "εὐλάβεια",
          "transliteration": "eulabeia",
          "strongs": "G2124",
          "shortDef": "godly fear (reverent caution)",
          "nuance": "Godly fear, reverence, pious caution. Always used positively for proper reverence toward God. From εὖ (well) + λαμβάνω (take) - handling sacred things with care.",
          "ntUsage": 2
        },
        {
          "greek": "δειλία",
          "transliteration": "deilia",
          "strongs": "G1167",
          "shortDef": "cowardice (timidity)",
          "nuance": "Cowardice, timidity, fearfulness. Always used negatively in the NT. The opposite of the boldness believers should have. 'God has not given us a spirit of fear (δειλία).'",
          "ntUsage": 1
        },
        {
          "greek": "φοβέομαι",
          "transliteration": "phobeomai",
          "strongs": "G5399",
          "shortDef": "to fear (be afraid, revere)",
          "nuance": "To fear, be afraid, or reverence. The verb form of φόβος. Used both for unhealthy fear ('fear not') and proper reverence for God ('fear God').",
          "ntUsage": 95
        }
      ],
      "vineQuote": "Eulabeia is godly fear, the caution and carefulness that comes from a right view of God. Deilia is cowardice, a sinful fear that shrinks from difficulty or danger.",
      "exampleVerse": {
        "reference": "2 Timothy 1:7",
        "greek": "οὐ γὰρ ἔδωκεν ἡμῖν ὁ θεὸς πνεῦμα δειλίας",
        "english": "For God gave us not a spirit of fear (deilia)",
        "wordHighlighted": "δειλία"
      },
      "practicalTip": "The 'fear of the Lord' (φόβος θεοῦ) is not δειλία (cowardice) but εὐλάβεια (reverence). It's the awe of a child before a loving Father, not the terror of a criminal before a judge.",
      "tags": [
        "essential",
        "practical",
        "wisdom"
      ]
    },
    {
      "id": "joy-chara-agalliasis",
      "category": "joy",
      "title": "Words for Joy and Rejoicing",
      "englishWord": "joy",
      "introduction": "Greek has several words for joy and gladness, ranging from quiet contentment to exuberant celebration. NT joy is distinctive - it persists through suffering and is rooted in relationship with God.",
      "words": [
        {
          "greek": "χαρά",
          "transliteration": "chara",
          "strongs": "G5479",
          "shortDef": "joy (deep-seated gladness)",
          "nuance": "Joy, gladness, delight. The primary NT word for joy. Related to χάρις (grace). A deep-seated gladness that doesn't depend on circumstances. A fruit of the Spirit.",
          "ntUsage": 59
        },
        {
          "greek": "χαίρω",
          "transliteration": "chairō",
          "strongs": "G5463",
          "shortDef": "to rejoice (be glad)",
          "nuance": "To rejoice, be glad, hail. The verb form of χαρά. Often used as a greeting ('Greetings!'). Commanded even in suffering - 'Rejoice in the Lord always.'",
          "ntUsage": 74
        },
        {
          "greek": "ἀγαλλίασις",
          "transliteration": "agalliasis",
          "strongs": "G20",
          "shortDef": "exultation (wild, exuberant joy)",
          "nuance": "Exultation, exuberant joy, intense gladness. More demonstrative than χαρά. Often associated with worship and the presence of God. Root meaning suggests 'leaping for joy.'",
          "ntUsage": 5
        },
        {
          "greek": "εὐφροσύνη",
          "transliteration": "euphrosynē",
          "strongs": "G2167",
          "shortDef": "gladness (mirth, festive joy)",
          "nuance": "Gladness, mirth, joyfulness. Often associated with feasting and celebration. The outward expression of a glad heart. From εὖ (well) + φρήν (mind).",
          "ntUsage": 2
        }
      ],
      "vineQuote": "Chara is joy in the deeper sense, more related to character. Agalliasis is exultation, the joyful expression of gladness. Euphrosynē is festive, merry joy.",
      "exampleVerse": {
        "reference": "1 Peter 1:8",
        "greek": "ἀγαλλιᾶσθε χαρᾷ ἀνεκλαλήτῳ καὶ δεδοξασμένῃ",
        "english": "You rejoice (agalliaō) with joy (chara) inexpressible and full of glory",
        "wordHighlighted": "ἀγαλλιάω and χαρά"
      },
      "practicalTip": "NT joy is not mere happiness (dependent on happenings) but χαρά rooted in God. Paul commands joy (Phil 4:4) - it's a choice rooted in relationship, not a feeling dependent on circumstances.",
      "tags": [
        "fruit",
        "essential",
        "practical"
      ]
    },
    {
      "id": "peace-eirene-hesychia",
      "category": "peace",
      "title": "Words for Peace",
      "englishWord": "peace",
      "introduction": "Greek distinguishes between peace as harmony with God and others (εἰρήνη) and quietness of spirit or behavior (ἡσυχία). The Hebrew 'shalom' deeply influences the NT concept of peace.",
      "words": [
        {
          "greek": "εἰρήνη",
          "transliteration": "eirēnē",
          "strongs": "G1515",
          "shortDef": "peace (harmony, well-being)",
          "nuance": "Peace, harmony, tranquility. In the NT, infused with the OT concept of shalom - total well-being, not just absence of conflict. Peace with God through Christ; peace among believers.",
          "ntUsage": 92
        },
        {
          "greek": "ἡσυχία",
          "transliteration": "hēsychia",
          "strongs": "G2271",
          "shortDef": "quietness (tranquil demeanor)",
          "nuance": "Quietness, stillness, a quiet spirit. More about demeanor than relationship. The quiet confidence of trusting God rather than anxious striving.",
          "ntUsage": 4
        },
        {
          "greek": "εἰρηνεύω",
          "transliteration": "eirēneuō",
          "strongs": "G1514",
          "shortDef": "to be at peace (live peaceably)",
          "nuance": "To live at peace, be reconciled. The verb form calling believers to pursue harmony with others. 'If possible, so far as it depends on you, live peaceably with all.'",
          "ntUsage": 4
        },
        {
          "greek": "εἰρηνοποιός",
          "transliteration": "eirēnopoios",
          "strongs": "G1518",
          "shortDef": "peacemaker",
          "nuance": "A peacemaker, one who makes peace. Used only in Matt 5:9, 'Blessed are the peacemakers.' Not passive peacekeeping but active reconciliation.",
          "ntUsage": 1
        }
      ],
      "vineQuote": "Eirēnē in the NT sense includes more than absence of war. It embraces all that makes for a person's highest good, reflecting the OT shalom.",
      "exampleVerse": {
        "reference": "Romans 5:1",
        "greek": "δικαιωθέντες οὖν ἐκ πίστεως εἰρήνην ἔχομεν πρὸς τὸν θεόν",
        "english": "Having been justified by faith, we have peace (eirēnē) with God",
        "wordHighlighted": "εἰρήνη"
      },
      "practicalTip": "εἰρήνη with God (Rom 5:1) is the foundation for the εἰρήνη of God (Phil 4:7). We must first be reconciled to God, then His peace guards our hearts.",
      "tags": [
        "fruit",
        "essential",
        "pauline"
      ]
    },
    {
      "id": "hope-elpis-apekdechomai",
      "category": "hope",
      "title": "Words for Hope",
      "englishWord": "hope",
      "introduction": "Greek ἐλπίς differs from English 'hope.' While we often use 'hope' for uncertain wishes, biblical hope is confident expectation based on God's promises. Other words add nuances of eager anticipation.",
      "words": [
        {
          "greek": "ἐλπίς",
          "transliteration": "elpis",
          "strongs": "G1680",
          "shortDef": "hope (confident expectation)",
          "nuance": "Hope, confident expectation. Not wishful thinking but assured anticipation based on God's character and promises. One of the three abiding virtues (faith, hope, love).",
          "ntUsage": 53
        },
        {
          "greek": "ἐλπίζω",
          "transliteration": "elpizō",
          "strongs": "G1679",
          "shortDef": "to hope (trust, expect)",
          "nuance": "To hope, expect, trust. The verb form. Can be used with εἰς or ἐπί to show the object of hope. 'We have set our hope on the living God.'",
          "ntUsage": 31
        },
        {
          "greek": "ἀπεκδέχομαι",
          "transliteration": "apekdechomai",
          "strongs": "G553",
          "shortDef": "to wait eagerly (expect intently)",
          "nuance": "To await eagerly, expect with stretched-out head. Compound word intensifying the idea of expectation. Used for waiting for Christ's return and the resurrection.",
          "ntUsage": 8
        },
        {
          "greek": "προσδοκάω",
          "transliteration": "prosdokaō",
          "strongs": "G4328",
          "shortDef": "to expect (look forward to)",
          "nuance": "To expect, look forward to, wait for. Can be positive (expecting good) or negative (dreading evil). General expectation without the intensity of ἀπεκδέχομαι.",
          "ntUsage": 16
        }
      ],
      "vineQuote": "Elpis is not a mere wish but confident expectation. In the NT it is always directed toward God and the blessings He promises.",
      "exampleVerse": {
        "reference": "Romans 8:24-25",
        "greek": "τῇ γὰρ ἐλπίδι ἐσώθημεν... δι᾽ ὑπομονῆς ἀπεκδεχόμεθα",
        "english": "For in hope (elpis) we were saved... we wait eagerly (apekdechomai) for it with patience",
        "wordHighlighted": "ἐλπίς and ἀπεκδέχομαι"
      },
      "practicalTip": "Biblical ἐλπίς is not 'I hope it doesn't rain' but 'I know God will keep His promises.' Our hope has a sure foundation - Christ's resurrection guarantees our future.",
      "tags": [
        "essential",
        "eschatology",
        "pauline"
      ]
    },
    {
      "id": "wrath-orge-thymos",
      "category": "wrath",
      "title": "Words for Anger and Wrath",
      "englishWord": "anger/wrath",
      "introduction": "Greek distinguishes between settled indignation (ὀργή) and passionate outburst (θυμός). Both are attributed to God, yet without the sinful elements of human anger.",
      "words": [
        {
          "greek": "ὀργή",
          "transliteration": "orgē",
          "strongs": "G3709",
          "shortDef": "wrath (settled indignation)",
          "nuance": "Wrath, anger, indignation. A settled disposition of righteous indignation rather than a sudden outburst. God's ὀργή is His consistent opposition to sin. Slow to develop but persistent.",
          "ntUsage": 36
        },
        {
          "greek": "θυμός",
          "transliteration": "thymos",
          "strongs": "G2372",
          "shortDef": "wrath (passionate outburst)",
          "nuance": "Wrath, passion, hot anger. More sudden and explosive than ὀργή. Associated with boiling emotions. In humans, often sinful; in God, the consuming fire of judgment.",
          "ntUsage": 18
        },
        {
          "greek": "ἀγανάκτησις",
          "transliteration": "aganaktēsis",
          "strongs": "G24",
          "shortDef": "indignation (vexation)",
          "nuance": "Indignation, vexation at something wrong. Righteous frustration at injustice or misunderstanding. The disciples' indignation at the anointing woman (Mark 14:4).",
          "ntUsage": 1
        },
        {
          "greek": "παροργισμός",
          "transliteration": "parorgismos",
          "strongs": "G3950",
          "shortDef": "provocation to anger",
          "nuance": "Provocation to anger, the state of being angered. Used in Eph 4:26 - 'do not let the sun go down on your parorgismos.' Anger that has been provoked.",
          "ntUsage": 1
        }
      ],
      "vineQuote": "Thumos indicates a more agitated condition of the feelings, an outburst of wrath from inward indignation. Orgē suggests a more settled or abiding condition of mind.",
      "exampleVerse": {
        "reference": "Romans 1:18",
        "greek": "Ἀποκαλύπτεται γὰρ ὀργὴ θεοῦ ἀπ᾽ οὐρανοῦ",
        "english": "For the wrath (orgē) of God is revealed from heaven",
        "wordHighlighted": "ὀργή"
      },
      "practicalTip": "God's ὀργή is not petty irritation but settled opposition to evil. We can be angry (ὀργίζεσθε) without sin (Eph 4:26) when our anger reflects God's holy opposition to injustice.",
      "tags": [
        "theological",
        "pauline",
        "attributes"
      ]
    },
    {
      "id": "send-apostello-pempo",
      "category": "send",
      "title": "Words for Send",
      "englishWord": "send",
      "introduction": "Greek distinguishes between sending with a commission (ἀποστέλλω) and simply dispatching someone (πέμπω). This distinction illuminates the nature of Jesus' mission and apostolic authority.",
      "words": [
        {
          "greek": "ἀποστέλλω",
          "transliteration": "apostellō",
          "strongs": "G649",
          "shortDef": "to send (with commission, authority)",
          "nuance": "To send forth with a commission, dispatch with authority and purpose. The root of 'apostle.' Emphasizes the authority of the sender and the mission of the one sent.",
          "ntUsage": 132
        },
        {
          "greek": "πέμπω",
          "transliteration": "pempō",
          "strongs": "G3992",
          "shortDef": "to send (dispatch)",
          "nuance": "To send, dispatch. More general than ἀποστέλλω, without the same emphasis on commission or authority. Often interchangeable but lacking the official, commissioned sense.",
          "ntUsage": 79
        },
        {
          "greek": "ἐκβάλλω",
          "transliteration": "ekballō",
          "strongs": "G1544",
          "shortDef": "to send out (thrust forth)",
          "nuance": "To cast out, thrust forth, send out. Stronger than simple sending - implies urgency or force. Used for casting out demons and for the Spirit 'driving' Jesus into the wilderness.",
          "ntUsage": 81
        },
        {
          "greek": "ἐξαποστέλλω",
          "transliteration": "exapostellō",
          "strongs": "G1821",
          "shortDef": "to send away (intensified)",
          "nuance": "Intensified form of ἀποστέλλω - to send forth, send away. Often used for God sending the Spirit or sending prophets. Emphasizes the origin (from God) and purpose.",
          "ntUsage": 13
        }
      ],
      "vineQuote": "Apostellō stresses the commission, the relation of the one sent to the sender. Pempō stresses simply the sending, without the same emphasis on the nature of the mission.",
      "exampleVerse": {
        "reference": "John 20:21",
        "greek": "καθὼς ἀπέσταλκέν με ὁ πατήρ, κἀγὼ πέμπω ὑμᾶς",
        "english": "As the Father has sent (apostellō) me, even so I am sending (pempō) you",
        "wordHighlighted": "ἀποστέλλω and πέμπω"
      },
      "practicalTip": "Jesus was ἀπεσταλμένος - sent with full authority from the Father. An 'apostle' (ἀπόστολος) carries the sender's authority. We too are sent - with Christ's commission and authority.",
      "tags": [
        "essential",
        "johannine",
        "mission"
      ]
    },
    {
      "id": "receive-lambano-dechomai",
      "category": "receive",
      "title": "Words for Receive",
      "englishWord": "receive",
      "introduction": "Greek distinguishes between taking/receiving actively (λαμβάνω) and welcoming/accepting (δέχομαι). A third word (παραλαμβάνω) emphasizes receiving something passed on. These nuances appear throughout the NT.",
      "words": [
        {
          "greek": "λαμβάνω",
          "transliteration": "lambanō",
          "strongs": "G2983",
          "shortDef": "to take, receive (grasp)",
          "nuance": "To take, receive, grasp. The most common word for receiving. Emphasizes the action of the recipient in taking hold of what is offered. Active reception.",
          "ntUsage": 258
        },
        {
          "greek": "δέχομαι",
          "transliteration": "dechomai",
          "strongs": "G1209",
          "shortDef": "to receive (welcome, accept)",
          "nuance": "To receive by way of welcome, accept deliberately and readily. Implies hospitality and positive response. Used for receiving guests, the gospel, and the kingdom.",
          "ntUsage": 56
        },
        {
          "greek": "παραλαμβάνω",
          "transliteration": "paralambanō",
          "strongs": "G3880",
          "shortDef": "to receive (take alongside, inherit)",
          "nuance": "To take to oneself, receive from another, take along. Often used for receiving tradition or teaching passed down. Paul 'received' (παρέλαβον) the gospel tradition.",
          "ntUsage": 49
        },
        {
          "greek": "ἀποδέχομαι",
          "transliteration": "apodechomai",
          "strongs": "G588",
          "shortDef": "to receive gladly (welcome warmly)",
          "nuance": "To accept with approval, receive gladly. Intensified form of δέχομαι. Emphasizes the warmth and joy of reception. The Bereans 'received the word with all eagerness.'",
          "ntUsage": 7
        }
      ],
      "vineQuote": "Dechomai suggests a favorable reception, a deliberate and ready acceptance. Lambanō is more neutral, simply indicating the act of receiving or taking.",
      "exampleVerse": {
        "reference": "1 Corinthians 15:3",
        "greek": "παρέδωκα γὰρ ὑμῖν ἐν πρώτοις ὃ καὶ παρέλαβον",
        "english": "For I delivered to you what I also received (paralambanō)",
        "wordHighlighted": "παραλαμβάνω"
      },
      "practicalTip": "Paul παρέλαβεν (received as tradition) the gospel and παρέδωκεν (passed on) to others. We too are links in the chain - faithfully receiving and transmitting the apostolic faith.",
      "tags": [
        "pauline",
        "tradition",
        "gospel"
      ]
    },
    {
      "id": "work-ergazomai-poieo",
      "category": "work",
      "title": "Words for Work and Do",
      "englishWord": "work/do",
      "introduction": "Greek has several words for working and doing, each with distinct nuances. Understanding these helps clarify passages about faith and works, and about Christian service.",
      "words": [
        {
          "greek": "ἐργάζομαι",
          "transliteration": "ergazomai",
          "strongs": "G2038",
          "shortDef": "to work (labor, perform)",
          "nuance": "To work, labor, perform work. Emphasizes labor and effort in accomplishing something. Related to ἔργον (work, deed). Used for working for wages and for spiritual labor.",
          "ntUsage": 41
        },
        {
          "greek": "ποιέω",
          "transliteration": "poieō",
          "strongs": "G4160",
          "shortDef": "to do, make (create, accomplish)",
          "nuance": "To do, make, create. The most general word for doing. Emphasizes the product or result rather than the process. God 'made' (ἐποίησεν) heaven and earth.",
          "ntUsage": 568
        },
        {
          "greek": "πράσσω",
          "transliteration": "prassō",
          "strongs": "G4238",
          "shortDef": "to practice (do habitually)",
          "nuance": "To practice, do habitually, accomplish. More ethical than ποιέω - often used for practicing good or evil. Emphasizes the ongoing nature of the action.",
          "ntUsage": 39
        },
        {
          "greek": "κατεργάζομαι",
          "transliteration": "katergazomai",
          "strongs": "G2716",
          "shortDef": "to work out (accomplish fully)",
          "nuance": "To work out, accomplish, bring about. Intensified form of ἐργάζομαι. Suggests completing or achieving something. 'Work out your salvation' (Phil 2:12).",
          "ntUsage": 22
        }
      ],
      "vineQuote": "Poieō and prassō differ in that poieō implies a single act, while prassō suggests repeated or continuous practice. Prassō often has an ethical quality absent from poieō.",
      "exampleVerse": {
        "reference": "Philippians 2:12-13",
        "greek": "τὴν ἑαυτῶν σωτηρίαν κατεργάζεσθε... θεὸς γάρ ἐστιν ὁ ἐνεργῶν ἐν ὑμῖν",
        "english": "Work out (katergazomai) your own salvation... for it is God who works (energeō) in you",
        "wordHighlighted": "κατεργάζομαι and ἐνεργέω"
      },
      "practicalTip": "We κατεργάζομαι (work out) our salvation because God ἐνεργέω (works in) us. Divine sovereignty and human responsibility work together - we labor because He empowers.",
      "tags": [
        "essential",
        "pauline",
        "practical"
      ]
    },
    {
      "id": "follow-akoloutheo-mimeomai",
      "category": "follow",
      "title": "Words for Follow",
      "englishWord": "follow",
      "introduction": "Greek has different words for following - physical accompaniment, discipleship, and imitation. These distinctions illuminate what it means to follow Christ.",
      "words": [
        {
          "greek": "ἀκολουθέω",
          "transliteration": "akoloutheō",
          "strongs": "G190",
          "shortDef": "to follow (accompany, be a disciple)",
          "nuance": "To follow, accompany as a disciple. The primary discipleship word. Originally meant following on the same road. Used for following Jesus physically and spiritually.",
          "ntUsage": 90
        },
        {
          "greek": "μιμέομαι",
          "transliteration": "mimeomai",
          "strongs": "G3401",
          "shortDef": "to imitate (mimic, copy)",
          "nuance": "To imitate, follow as an example. Not mere external copying but deep emulation. Root of 'mimic.' Paul says 'imitate me as I imitate Christ.'",
          "ntUsage": 4
        },
        {
          "greek": "ἐπακολουθέω",
          "transliteration": "epakoloutheō",
          "strongs": "G1872",
          "shortDef": "to follow closely (track)",
          "nuance": "To follow closely, track. Intensified form of ἀκολουθέω. Used for following doctrine (1 Tim 4:6) and for sins following after judgment.",
          "ntUsage": 4
        },
        {
          "greek": "συνακολουθέω",
          "transliteration": "synakoloutheō",
          "strongs": "G4870",
          "shortDef": "to follow together (accompany)",
          "nuance": "To follow together with, accompany. Compound with συν (together). Emphasizes companionship in following. The women 'followed with' Jesus from Galilee.",
          "ntUsage": 3
        }
      ],
      "vineQuote": "Akoloutheō is the characteristic word of discipleship in the Gospels. It signifies following as a disciple, with the thought of cleaving to the one followed.",
      "exampleVerse": {
        "reference": "Mark 1:17",
        "greek": "δεῦτε ὀπίσω μου, καὶ ποιήσω ὑμᾶς γενέσθαι ἁλιεῖς ἀνθρώπων",
        "english": "Follow (after) me, and I will make you fishers of men",
        "wordHighlighted": "ὀπίσω (behind, after)"
      },
      "practicalTip": "Discipleship is both ἀκολουθέω (following Jesus) and μιμέομαι (imitating Him). We walk where He walked and become like Him as we do. Following produces transformation.",
      "tags": [
        "discipleship",
        "synoptic",
        "practical"
      ]
    },
    {
      "id": "think-logizomai-phroneo",
      "category": "think",
      "title": "Words for Think and Consider",
      "englishWord": "think",
      "introduction": "Greek has multiple words for thinking, each emphasizing different mental activities - calculating, setting the mind, reasoning, and supposing. Paul especially uses these to describe the transformed mind.",
      "words": [
        {
          "greek": "λογίζομαι",
          "transliteration": "logizomai",
          "strongs": "G3049",
          "shortDef": "to reckon, count, consider",
          "nuance": "To reckon, calculate, consider as. Originally a commercial term for counting or calculating. Used for imputing righteousness and for deliberate mental consideration.",
          "ntUsage": 40
        },
        {
          "greek": "φρονέω",
          "transliteration": "phroneō",
          "strongs": "G5426",
          "shortDef": "to set the mind on (be minded)",
          "nuance": "To think, be minded, set the mind on. More than momentary thought - a settled disposition or mindset. 'Set your minds on things above.' The direction of one's thinking.",
          "ntUsage": 26
        },
        {
          "greek": "νομίζω",
          "transliteration": "nomizō",
          "strongs": "G3543",
          "shortDef": "to suppose (assume, think customarily)",
          "nuance": "To suppose, assume, think according to custom. From νόμος (custom, law). Often introduces a supposition that may be mistaken. 'Do not think that I came to abolish the Law.'",
          "ntUsage": 15
        },
        {
          "greek": "ἡγέομαι",
          "transliteration": "hēgeomai",
          "strongs": "G2233",
          "shortDef": "to consider (regard, account)",
          "nuance": "To consider, regard, count. Often used for deliberate evaluation. Paul 'considers' all things loss compared to Christ. Root of 'hegemony' - leading thought.",
          "ntUsage": 28
        }
      ],
      "vineQuote": "Logizomai involves the bringing together of different reasons to make a decision. Phroneō implies the direction of the mind, the bent of the thoughts.",
      "exampleVerse": {
        "reference": "Philippians 4:8",
        "greek": "ὅσα ἐστὶν ἀληθῆ... ταῦτα λογίζεσθε",
        "english": "Whatever is true... think (logizomai) about these things",
        "wordHighlighted": "λογίζομαι"
      },
      "practicalTip": "Paul commands us to λογίζομαι (deliberately calculate and consider) what is true, noble, right. We choose what occupies our minds. Transformed thinking is intentional, not accidental.",
      "tags": [
        "pauline",
        "practical",
        "sanctification"
      ]
    },
    {
      "id": "judge-krino-anakrino",
      "category": "judge",
      "title": "Words for Judge",
      "englishWord": "judge",
      "introduction": "Greek distinguishes between different kinds of judging - making distinctions, examining, condemning, and the final eschatological judgment. Understanding these clarifies when judgment is appropriate.",
      "words": [
        {
          "greek": "κρίνω",
          "transliteration": "krinō",
          "strongs": "G2919",
          "shortDef": "to judge (distinguish, decide)",
          "nuance": "To judge, distinguish, decide. The basic word for judging. Can be neutral (making necessary distinctions), positive (judicial decision), or negative (condemning). Context determines the nuance.",
          "ntUsage": 114
        },
        {
          "greek": "ἀνακρίνω",
          "transliteration": "anakrinō",
          "strongs": "G350",
          "shortDef": "to examine (investigate carefully)",
          "nuance": "To examine, investigate, question. Thorough investigation before judgment. The Bereans 'examined' the Scriptures. Used for judicial examination.",
          "ntUsage": 16
        },
        {
          "greek": "διακρίνω",
          "transliteration": "diakrinō",
          "strongs": "G1252",
          "shortDef": "to discern (distinguish between)",
          "nuance": "To separate, distinguish, discern. Making distinctions between things. Discerning spirits, discerning the body. Also used for doubting (being divided in mind).",
          "ntUsage": 19
        },
        {
          "greek": "κατακρίνω",
          "transliteration": "katakrinō",
          "strongs": "G2632",
          "shortDef": "to condemn (judge against)",
          "nuance": "To condemn, pass sentence against. Intensified form of κρίνω with κατά (against). Always negative - judging adversely. 'There is now no condemnation for those in Christ.'",
          "ntUsage": 18
        }
      ],
      "vineQuote": "Krinō primarily denotes to distinguish, select, choose; hence to determine, to decide judicially. Katakrinō denotes to give judgment against, to condemn.",
      "exampleVerse": {
        "reference": "1 Corinthians 2:15",
        "greek": "ὁ δὲ πνευματικὸς ἀνακρίνει μὲν πάντα",
        "english": "The spiritual person examines (anakrinō) all things",
        "wordHighlighted": "ἀνακρίνω"
      },
      "practicalTip": "Not all 'judging' is forbidden. We must διακρίνω (discern) between truth and error, ἀνακρίνω (examine) teaching. What's forbidden is κατακρίνω (condemning) others hypocritically.",
      "tags": [
        "essential",
        "pauline",
        "practical"
      ]
    },
    {
      "id": "hear-akouo-hypakouo",
      "category": "hear",
      "title": "Words for Hear and Listen",
      "englishWord": "hear",
      "introduction": "Greek distinguishes between mere physical hearing (ἀκούω), obedient hearing (ὑπακούω), and answered prayer (εἰσακούω). True biblical 'hearing' involves response and obedience.",
      "words": [
        {
          "greek": "ἀκούω",
          "transliteration": "akouō",
          "strongs": "G191",
          "shortDef": "to hear (perceive sound)",
          "nuance": "To hear, listen, understand. The basic word for hearing. Can be physical hearing or attentive listening. Root of 'acoustic.' 'He who has ears to hear, let him hear.'",
          "ntUsage": 428
        },
        {
          "greek": "ὑπακούω",
          "transliteration": "hypakouō",
          "strongs": "G5219",
          "shortDef": "to obey (hear under, respond)",
          "nuance": "To obey, hearken, answer the door. Compound: ὑπό (under) + ἀκούω (hear). Hearing that submits to what is heard. Obedience as the proper response to hearing God's word.",
          "ntUsage": 21
        },
        {
          "greek": "εἰσακούω",
          "transliteration": "eisakouō",
          "strongs": "G1522",
          "shortDef": "to hear and answer (heed prayer)",
          "nuance": "To hear with favor, answer prayer. Compound: εἰς (into) + ἀκούω (hear). God 'hearing' in the sense of granting the request. 'Your prayer has been heard.'",
          "ntUsage": 5
        },
        {
          "greek": "παρακούω",
          "transliteration": "parakouō",
          "strongs": "G3878",
          "shortDef": "to mishear (overhear, disobey)",
          "nuance": "To hear carelessly, mishear, refuse to listen. Can mean overhearing accidentally or deliberately not heeding. 'If he refuses to listen (parakouō) to them, tell the church.'",
          "ntUsage": 3
        }
      ],
      "vineQuote": "Akouo denotes hearing; the perception of sound. Hypakouo signifies to hearken submissively, to obey. The connection between hearing and obeying is fundamental in Scripture.",
      "exampleVerse": {
        "reference": "Romans 10:17",
        "greek": "ἄρα ἡ πίστις ἐξ ἀκοῆς, ἡ δὲ ἀκοὴ διὰ ῥήματος Χριστοῦ",
        "english": "So faith comes from hearing (akoē), and hearing through the word of Christ",
        "wordHighlighted": "ἀκοή (noun from ἀκούω)"
      },
      "practicalTip": "In Hebrew thought (influencing NT Greek), 'hearing' implies obedience. The Shema says 'Hear, O Israel' - meaning 'Listen and obey.' True hearing (ἀκούω) leads to obedience (ὑπακούω).",
      "tags": [
        "essential",
        "practical",
        "obedience"
      ]
    },
    {
      "id": "speak-lego-laleo",
      "category": "speak",
      "title": "Words for Speak and Say",
      "englishWord": "speak/say",
      "introduction": "Greek distinguishes between speaking with emphasis on content (λέγω) and speaking with emphasis on the act of utterance (λαλέω). Other words add nuances of proclaiming and declaring.",
      "words": [
        {
          "greek": "λέγω",
          "transliteration": "legō",
          "strongs": "G3004",
          "shortDef": "to say (with content emphasis)",
          "nuance": "To say, speak, tell. Emphasizes the content of what is said - the meaning, the message. Related to λόγος. 'Jesus said' typically uses λέγω when the content matters.",
          "ntUsage": 2354
        },
        {
          "greek": "λαλέω",
          "transliteration": "laleō",
          "strongs": "G2980",
          "shortDef": "to speak (the act of speaking)",
          "nuance": "To speak, utter, talk. Emphasizes the act of speaking rather than the content. Often used for inspired utterance or ordinary conversation. 'He who speaks in a tongue.'",
          "ntUsage": 296
        },
        {
          "greek": "φημί",
          "transliteration": "phēmi",
          "strongs": "G5346",
          "shortDef": "to affirm (declare, say)",
          "nuance": "To affirm, assert, say. Often introduces direct speech, especially in replies. 'He said' in the sense of making an affirmation or reply. More formal than λέγω.",
          "ntUsage": 66
        },
        {
          "greek": "ἀποφθέγγομαι",
          "transliteration": "apophtheggomai",
          "strongs": "G669",
          "shortDef": "to speak forth (utter boldly)",
          "nuance": "To speak forth, utter clearly and boldly. Used for inspired prophetic speech. The disciples at Pentecost 'spoke forth' as the Spirit gave utterance.",
          "ntUsage": 3
        }
      ],
      "vineQuote": "Lego affirms the purport of what is said; laleo marks the act of speaking. Lego is more for the matter, laleo for the manner of discourse.",
      "exampleVerse": {
        "reference": "John 12:49",
        "greek": "ὁ πέμψας με πατὴρ αὐτός μοι ἐντολὴν δέδωκεν τί εἴπω καὶ τί λαλήσω",
        "english": "The Father who sent me has given me a command - what to say (eipō) and how to speak (laleō)",
        "wordHighlighted": "εἴπω (from λέγω) and λαλήσω"
      },
      "practicalTip": "In John 12:49, Jesus distinguishes what to say (content) and how to speak (manner). Both matter in Christian witness - we need the right message delivered in the right way.",
      "tags": [
        "johannine",
        "practical",
        "speech"
      ]
    },
    {
      "id": "save-sozo-ryomai",
      "category": "save",
      "title": "Words for Save and Rescue",
      "englishWord": "save",
      "introduction": "Greek has several words for salvation and deliverance, each emphasizing different aspects - rescue from danger, redemption through payment, and preservation. Together they paint a full picture of what God has done for us.",
      "words": [
        {
          "greek": "σῴζω",
          "transliteration": "sōzō",
          "strongs": "G4982",
          "shortDef": "to save (deliver, preserve)",
          "nuance": "To save, deliver, make whole, preserve. The primary NT word for salvation. Can refer to physical healing, rescue from danger, or spiritual salvation. Comprehensive deliverance.",
          "ntUsage": 106
        },
        {
          "greek": "ῥύομαι",
          "transliteration": "rhyomai",
          "strongs": "G4506",
          "shortDef": "to rescue (snatch from danger)",
          "nuance": "To rescue, deliver, snatch from danger. Emphasizes the act of rescue from peril or evil. 'Deliver us from evil' uses this word. More dramatic than σῴζω.",
          "ntUsage": 17
        },
        {
          "greek": "λυτρόω",
          "transliteration": "lytroō",
          "strongs": "G3084",
          "shortDef": "to redeem (ransom, buy back)",
          "nuance": "To redeem, ransom, buy back. From λύτρον (ransom price). Emphasizes the payment made to secure release. Christ 'redeemed' us with His blood.",
          "ntUsage": 3
        },
        {
          "greek": "ἐλευθερόω",
          "transliteration": "eleutheroō",
          "strongs": "G1659",
          "shortDef": "to set free (liberate)",
          "nuance": "To set free, liberate. Emphasizes the resulting freedom rather than the means of deliverance. 'The truth shall set you free.' From bondage to liberty.",
          "ntUsage": 7
        }
      ],
      "vineQuote": "Sōzō is the comprehensive word for salvation in all its aspects. Rhyomai emphasizes deliverance from danger. Lytroō emphasizes the price paid for redemption.",
      "exampleVerse": {
        "reference": "Titus 3:5",
        "greek": "ἔσωσεν ἡμᾶς... διὰ λουτροῦ παλιγγενεσίας",
        "english": "He saved (sōzō) us... through the washing of regeneration",
        "wordHighlighted": "σῴζω"
      },
      "practicalTip": "Salvation is comprehensive: σῴζω (saved from sin's penalty and power), ῥύομαι (rescued from Satan's grip), λυτρόω (redeemed by Christ's blood), ἐλευθερόω (freed for new life).",
      "tags": [
        "essential",
        "salvation",
        "pauline"
      ]
    },
    {
      "id": "preach-kerysso-euangelizo",
      "category": "preach",
      "title": "Words for Preach and Proclaim",
      "englishWord": "preach",
      "introduction": "Greek distinguishes between herald-proclamation (κηρύσσω), gospel-announcement (εὐαγγελίζω), and teaching (διδάσκω). These represent different aspects of Christian ministry.",
      "words": [
        {
          "greek": "κηρύσσω",
          "transliteration": "kēryssō",
          "strongs": "G2784",
          "shortDef": "to herald, proclaim (as a herald)",
          "nuance": "To herald, proclaim as a public crier. The herald (κῆρυξ) proclaimed the king's message with authority. Emphasizes the authoritative announcement of the message, not the messenger's own ideas.",
          "ntUsage": 61
        },
        {
          "greek": "εὐαγγελίζω",
          "transliteration": "euangelizō",
          "strongs": "G2097",
          "shortDef": "to announce good news (evangelize)",
          "nuance": "To announce good news, preach the gospel. From εὖ (good) + ἄγγελος (messenger). Emphasizes the content as good news. Root of 'evangelize.'",
          "ntUsage": 54
        },
        {
          "greek": "διδάσκω",
          "transliteration": "didaskō",
          "strongs": "G1321",
          "shortDef": "to teach (instruct)",
          "nuance": "To teach, instruct. More systematic than preaching - explaining, training, building understanding. Root of 'didactic.' Jesus 'taught' in synagogues.",
          "ntUsage": 97
        },
        {
          "greek": "καταγγέλλω",
          "transliteration": "katangellō",
          "strongs": "G2605",
          "shortDef": "to proclaim (announce thoroughly)",
          "nuance": "To proclaim, announce publicly and thoroughly. Intensified form emphasizing complete and open proclamation. Paul 'proclaimed' Christ in the synagogues.",
          "ntUsage": 18
        }
      ],
      "vineQuote": "Kēryssō is to proclaim as a herald; it suggests formality, gravity, authority. Euangelizō is to announce glad tidings. Didaskō is to instruct in doctrine.",
      "exampleVerse": {
        "reference": "Romans 10:14",
        "greek": "πῶς δὲ ἀκούσωσιν χωρὶς κηρύσσοντος;",
        "english": "How are they to hear without someone preaching (kēryssō)?",
        "wordHighlighted": "κηρύσσω"
      },
      "practicalTip": "Effective ministry includes κηρύσσω (authoritative proclamation), εὐαγγελίζω (good news announcement), and διδάσκω (systematic teaching). Herald the truth, share the good news, build understanding.",
      "tags": [
        "essential",
        "mission",
        "ministry"
      ]
    },
    {
      "id": "worship-proskyneo-latreuo",
      "category": "worship",
      "title": "Words for Worship",
      "englishWord": "worship",
      "introduction": "Greek has several words for worship, from prostrating before deity (προσκυνέω) to rendering religious service (λατρεύω) to reverential fear (σέβομαι). Each illuminates an aspect of true worship.",
      "words": [
        {
          "greek": "προσκυνέω",
          "transliteration": "proskyneō",
          "strongs": "G4352",
          "shortDef": "to worship (prostrate, bow down)",
          "nuance": "To worship, bow down, prostrate oneself. The most common NT word for worship. From πρός (toward) + κυνέω (kiss). Expressing homage and reverence, especially to deity.",
          "ntUsage": 60
        },
        {
          "greek": "λατρεύω",
          "transliteration": "latreuō",
          "strongs": "G3000",
          "shortDef": "to serve (render religious service)",
          "nuance": "To serve, render religious service or homage. Worship expressed through service. The whole of Christian life as worship-service. Root of 'liturgy.'",
          "ntUsage": 21
        },
        {
          "greek": "σέβομαι",
          "transliteration": "sebomai",
          "strongs": "G4576",
          "shortDef": "to revere (worship with awe)",
          "nuance": "To revere, worship with devotion. Emphasizes the attitude of reverent awe. Often used for Gentile 'God-fearers' who worshiped the true God without full conversion.",
          "ntUsage": 10
        },
        {
          "greek": "λειτουργέω",
          "transliteration": "leitourgeō",
          "strongs": "G3008",
          "shortDef": "to minister (public service)",
          "nuance": "To minister, perform public service. Originally civic duty, then priestly service. Root of 'liturgy.' Worship as public service rendered to God.",
          "ntUsage": 3
        }
      ],
      "vineQuote": "Proskyneō denotes an act of homage or reverence to God. Latreuō adds the thought of service. True worship involves both attitude (proskyneō) and action (latreuō).",
      "exampleVerse": {
        "reference": "John 4:24",
        "greek": "πνεῦμα ὁ θεός, καὶ τοὺς προσκυνοῦντας αὐτὸν ἐν πνεύματι καὶ ἀληθείᾳ δεῖ προσκυνεῖν",
        "english": "God is spirit, and those who worship (proskyneō) him must worship in spirit and truth",
        "wordHighlighted": "προσκυνέω"
      },
      "practicalTip": "Worship is both προσκυνέω (bowing in homage) and λατρεύω (serving in life). Sunday worship continues in Monday service. All of life is λατρεία - worship-service to God (Rom 12:1).",
      "tags": [
        "essential",
        "johannine",
        "worship"
      ]
    },
    {
      "id": "repent-metanoeo-metamelomai",
      "category": "repent",
      "title": "Words for Repent",
      "englishWord": "repent",
      "introduction": "Greek distinguishes between genuine repentance (μετανοέω) involving a complete change of mind and life, and mere regret (μεταμέλομαι). This distinction is crucial for understanding biblical conversion.",
      "words": [
        {
          "greek": "μετανοέω",
          "transliteration": "metanoeō",
          "strongs": "G3340",
          "shortDef": "to repent (change of mind/life)",
          "nuance": "To repent, change one's mind and purpose. From μετά (change) + νοέω (think). A complete transformation of thought and direction. The repentance that leads to salvation.",
          "ntUsage": 34
        },
        {
          "greek": "μετάνοια",
          "transliteration": "metanoia",
          "strongs": "G3341",
          "shortDef": "repentance (change of mind)",
          "nuance": "Repentance, a change of mind. The noun form. Not mere emotion but a fundamental reorientation of thought, attitude, and life direction. 'Repentance unto life.'",
          "ntUsage": 24
        },
        {
          "greek": "μεταμέλομαι",
          "transliteration": "metamelomai",
          "strongs": "G3338",
          "shortDef": "to regret (feel remorse)",
          "nuance": "To regret, feel remorse, have second thoughts. Different from μετανοέω - refers to the emotional response of regret without necessarily implying life change. Judas 'regretted' betraying Jesus.",
          "ntUsage": 6
        },
        {
          "greek": "ἐπιστρέφω",
          "transliteration": "epistrephō",
          "strongs": "G1994",
          "shortDef": "to turn (convert, return)",
          "nuance": "To turn, turn around, convert. Often paired with μετανοέω - repent (change mind) and turn (change direction). Emphasizes the action of turning to God.",
          "ntUsage": 36
        }
      ],
      "vineQuote": "Metanoeo signifies to change one's mind or purpose, always in the NT involving a change for the better. Metamelomai signifies to regret, to experience an emotional change.",
      "exampleVerse": {
        "reference": "2 Corinthians 7:10",
        "greek": "ἡ γὰρ κατὰ θεὸν λύπη μετάνοιαν εἰς σωτηρίαν ἀμεταμέλητον ἐργάζεται",
        "english": "Godly sorrow produces repentance (metanoia) leading to salvation without regret (ametamelēton)",
        "wordHighlighted": "μετάνοια and ἀμεταμέλητος"
      },
      "practicalTip": "Judas μεταμέλομαι (regretted) but did not μετανοέω (repent). Peter wept bitterly and μετανοέω - his life changed. True repentance isn't just feeling sorry; it's a complete turnaround.",
      "tags": [
        "essential",
        "salvation",
        "synoptic"
      ]
    },
    {
      "id": "body-soma-sarx",
      "category": "body",
      "title": "Words for Body and Flesh",
      "englishWord": "body/flesh",
      "introduction": "Greek distinguishes between the body as an organized whole (σῶμα) and flesh as material substance (σάρξ). In Paul, σάρξ often has a theological sense of sinful human nature.",
      "words": [
        {
          "greek": "σῶμα",
          "transliteration": "sōma",
          "strongs": "G4983",
          "shortDef": "body (organized whole)",
          "nuance": "Body as an organized, living whole. Can refer to the physical body, the resurrection body, or metaphorically to the church as the 'body of Christ.' Generally neutral or positive.",
          "ntUsage": 142
        },
        {
          "greek": "σάρξ",
          "transliteration": "sarx",
          "strongs": "G4561",
          "shortDef": "flesh (physical or sinful nature)",
          "nuance": "Flesh, either literally (physical tissue) or theologically (the sinful nature). In Paul, often the principle of sin operating in unredeemed humanity. 'The flesh lusts against the Spirit.'",
          "ntUsage": 147
        },
        {
          "greek": "μέλος",
          "transliteration": "melos",
          "strongs": "G3196",
          "shortDef": "member (part of body)",
          "nuance": "A member or part of the body. Used for body parts and for members of the church body. 'We are members one of another.'",
          "ntUsage": 34
        },
        {
          "greek": "σκεῦος",
          "transliteration": "skeuos",
          "strongs": "G4632",
          "shortDef": "vessel (container, instrument)",
          "nuance": "A vessel, container, instrument. Metaphorically for the body as a container of the soul or as an instrument for use. 'We have this treasure in earthen vessels.'",
          "ntUsage": 23
        }
      ],
      "vineQuote": "Sarx is the material of the body, soma is the body itself as an organized whole. In Paul, sarx often denotes mere human nature, especially in its weakness or sinfulness.",
      "exampleVerse": {
        "reference": "Romans 8:13",
        "greek": "εἰ γὰρ κατὰ σάρκα ζῆτε, μέλλετε ἀποθνῄσκειν",
        "english": "For if you live according to the flesh (sarx), you will die",
        "wordHighlighted": "σάρξ"
      },
      "practicalTip": "The body (σῶμα) is not evil - it will be resurrected. But the 'flesh' (σάρξ) as sinful nature must be put to death. We honor our bodies while crucifying our flesh.",
      "tags": [
        "essential",
        "pauline",
        "anthropology"
      ]
    },
    {
      "id": "spirit-pneuma-psyche",
      "category": "spirit",
      "title": "Words for Spirit and Soul",
      "englishWord": "spirit/soul",
      "introduction": "Greek distinguishes between spirit (πνεῦμα) and soul (ψυχή). While related, they emphasize different aspects of the inner person. Understanding this illuminates NT anthropology.",
      "words": [
        {
          "greek": "πνεῦμα",
          "transliteration": "pneuma",
          "strongs": "G4151",
          "shortDef": "spirit (breath, spirit, Spirit)",
          "nuance": "Spirit, breath, wind. Can refer to the Holy Spirit, the human spirit, evil spirits, or the breath of life. The human spirit is the God-conscious aspect that relates to the divine.",
          "ntUsage": 379
        },
        {
          "greek": "ψυχή",
          "transliteration": "psychē",
          "strongs": "G5590",
          "shortDef": "soul (life, self, personality)",
          "nuance": "Soul, life, self. The seat of feelings, desires, and personality. The life that can be lost (Matt 16:25) or the inner person. Root of 'psychology.'",
          "ntUsage": 103
        },
        {
          "greek": "νοῦς",
          "transliteration": "nous",
          "strongs": "G3563",
          "shortDef": "mind (intellect, understanding)",
          "nuance": "Mind, intellect, understanding. The faculty of thinking and reasoning. The renewed mind transforms behavior (Rom 12:2). Can be darkened by sin or enlightened by the Spirit.",
          "ntUsage": 24
        },
        {
          "greek": "καρδία",
          "transliteration": "kardia",
          "strongs": "G2588",
          "shortDef": "heart (center of being)",
          "nuance": "Heart, the center and seat of physical and spiritual life. Includes mind, will, and emotions. In Hebrew thought, the heart is the whole inner person, not just emotions.",
          "ntUsage": 156
        }
      ],
      "vineQuote": "Pneuma is that part of man which is related to God. Psyche is the seat of personality and natural life. The spirit is God-conscious, the soul is self-conscious.",
      "exampleVerse": {
        "reference": "1 Thessalonians 5:23",
        "greek": "ὁλόκληρον ὑμῶν τὸ πνεῦμα καὶ ἡ ψυχὴ καὶ τὸ σῶμα",
        "english": "Your whole spirit (pneuma) and soul (psychē) and body (sōma)",
        "wordHighlighted": "πνεῦμα, ψυχή, and σῶμα"
      },
      "practicalTip": "God renews our πνεῦμα (spirit - our connection to Him), transforms our νοῦς (mind - our thinking), heals our ψυχή (soul - our emotions), and will resurrect our σῶμα (body).",
      "tags": [
        "essential",
        "anthropology",
        "pauline"
      ]
    },
    {
      "id": "remain-meno-diameno",
      "category": "remain",
      "title": "Words for Remain and Abide",
      "englishWord": "remain/abide",
      "introduction": "Greek has several words for remaining and continuing. In John especially, 'abiding' (μένω) becomes a key concept for the believer's relationship with Christ.",
      "words": [
        {
          "greek": "μένω",
          "transliteration": "menō",
          "strongs": "G3306",
          "shortDef": "to remain, abide (stay, dwell)",
          "nuance": "To remain, stay, abide, dwell. The key Johannine word for the believer's union with Christ. Not temporary lodging but permanent residence. 'Abide in me, and I in you.'",
          "ntUsage": 118
        },
        {
          "greek": "διαμένω",
          "transliteration": "diamenō",
          "strongs": "G1265",
          "shortDef": "to continue (remain throughout)",
          "nuance": "To remain throughout, continue permanently. Intensified form of μένω. Emphasizes duration and persistence through time. 'Your years will never end.'",
          "ntUsage": 5
        },
        {
          "greek": "ἐπιμένω",
          "transliteration": "epimenō",
          "strongs": "G1961",
          "shortDef": "to persist (stay on, continue in)",
          "nuance": "To stay on, persist, continue in. Remaining with purpose and determination. 'Shall we continue in sin?' The perseverance aspect of remaining.",
          "ntUsage": 16
        },
        {
          "greek": "ὑπομένω",
          "transliteration": "hypomenō",
          "strongs": "G5278",
          "shortDef": "to endure (remain under pressure)",
          "nuance": "To endure, remain under, persevere. Remaining steadfast under trial. From ὑπό (under) + μένω. 'He who endures to the end will be saved.'",
          "ntUsage": 17
        }
      ],
      "vineQuote": "Meno denotes to remain, abide, whether in a place or in a state. It is the characteristic word in John for the mutual indwelling of the Father, Son, and believers.",
      "exampleVerse": {
        "reference": "John 15:4",
        "greek": "μείνατε ἐν ἐμοί, κἀγὼ ἐν ὑμῖν",
        "english": "Abide (menō) in me, and I in you",
        "wordHighlighted": "μένω"
      },
      "practicalTip": "John uses μένω 40 times! Salvation isn't just a moment but a permanent dwelling. We μένω (remain in Christ), διαμένω (continue consistently), ὑπομένω (endure through trials).",
      "tags": [
        "essential",
        "johannine",
        "practical"
      ]
    },
    {
      "id": "destroy-apollymi-katalyo",
      "category": "destroy",
      "title": "Words for Destroy",
      "englishWord": "destroy",
      "introduction": "Greek has several words for destruction, from perishing eternally to demolishing structures. These distinctions clarify passages about eternal punishment and the temporary nature of created things.",
      "words": [
        {
          "greek": "ἀπόλλυμι",
          "transliteration": "apollymi",
          "strongs": "G622",
          "shortDef": "to destroy, perish (ruin completely)",
          "nuance": "To destroy, lose, perish. Can be active (destroy something) or middle (perish). Used for eternal destruction and for losing something valuable. 'Fear him who can destroy both soul and body.'",
          "ntUsage": 92
        },
        {
          "greek": "καταλύω",
          "transliteration": "katalyō",
          "strongs": "G2647",
          "shortDef": "to destroy (demolish, dissolve)",
          "nuance": "To dissolve, demolish, destroy by taking apart. Used for destroying the temple, abolishing law, or lodging (loosing one's pack). Breaking down structures.",
          "ntUsage": 17
        },
        {
          "greek": "φθείρω",
          "transliteration": "phtheirō",
          "strongs": "G5351",
          "shortDef": "to corrupt, ruin (moral decay)",
          "nuance": "To corrupt, destroy through corruption. Emphasizes the process of decay and ruin. Used for moral and physical corruption. 'Bad company corrupts good morals.'",
          "ntUsage": 9
        },
        {
          "greek": "ὄλεθρος",
          "transliteration": "olethros",
          "strongs": "G3639",
          "shortDef": "destruction (ruin, death)",
          "nuance": "Ruin, destruction, death. The noun for destruction. Not annihilation but ruination. 'Sudden destruction' comes upon those who say 'peace and safety.'",
          "ntUsage": 4
        }
      ],
      "vineQuote": "Apollymi signifies to destroy utterly. The idea is not extinction but ruin, loss, not of being but of well-being. Eternal destruction is eternal ruin.",
      "exampleVerse": {
        "reference": "Matthew 10:28",
        "greek": "φοβεῖσθε τὸν δυνάμενον καὶ ψυχὴν καὶ σῶμα ἀπολέσαι ἐν γεέννῃ",
        "english": "Fear him who can destroy (apollymi) both soul and body in hell",
        "wordHighlighted": "ἀπόλλυμι"
      },
      "practicalTip": "ἀπόλλυμι doesn't mean annihilation but ruin. The 'lost' (ἀπολωλότα) sheep exists but is ruined. Hell is not ceasing to exist but eternal ruin - existing apart from all good.",
      "tags": [
        "eschatology",
        "theological",
        "synoptic"
      ]
    },
    {
      "id": "glory-doxa-time",
      "category": "glory",
      "title": "Words for Glory and Honor",
      "englishWord": "glory/honor",
      "introduction": "Greek distinguishes between divine glory/radiance (δόξα), honor/value (τιμή), and praise (αἶνος). These help us understand both God's nature and our calling to glorify Him.",
      "words": [
        {
          "greek": "δόξα",
          "transliteration": "doxa",
          "strongs": "G1391",
          "shortDef": "glory (radiance, majesty, praise)",
          "nuance": "Glory, splendor, radiance. God's glory is His manifested perfections. Can mean reputation, praise, or the visible manifestation of divine majesty. Root of 'doxology.'",
          "ntUsage": 166
        },
        {
          "greek": "τιμή",
          "transliteration": "timē",
          "strongs": "G5092",
          "shortDef": "honor (value, respect, price)",
          "nuance": "Honor, value, respect. The recognition of worth. Also used for price (we were bought with a 'price'). 'Honor your father and mother.'",
          "ntUsage": 41
        },
        {
          "greek": "δοξάζω",
          "transliteration": "doxazō",
          "strongs": "G1392",
          "shortDef": "to glorify (honor, magnify)",
          "nuance": "To glorify, honor, magnify. The verb form of δόξα. Used for glorifying God and for the Father glorifying the Son. Making known the glory that exists.",
          "ntUsage": 61
        },
        {
          "greek": "αἶνος",
          "transliteration": "ainos",
          "strongs": "G136",
          "shortDef": "praise (expressed commendation)",
          "nuance": "Praise, commendation. Specifically verbal expression of praise. Related to αἰνέω (to praise). 'Out of the mouth of infants you have perfected praise.'",
          "ntUsage": 2
        }
      ],
      "vineQuote": "Doxa denotes the manifested excellence of God's character. The glory of God is what He is essentially. To glorify God is to acknowledge His glory.",
      "exampleVerse": {
        "reference": "John 17:5",
        "greek": "δόξασόν με σύ, πάτερ, παρὰ σεαυτῷ τῇ δόξῃ ᾗ εἶχον πρὸ τοῦ τὸν κόσμον εἶναι παρὰ σοί",
        "english": "Glorify (doxazō) me in your presence with the glory (doxa) I had with you before the world began",
        "wordHighlighted": "δοξάζω and δόξα"
      },
      "practicalTip": "We δοξάζω (glorify) God not by adding to His δόξα (glory) - that's impossible. We glorify Him by acknowledging, displaying, and praising the glory that already belongs to Him.",
      "tags": [
        "essential",
        "johannine",
        "worship"
      ]
    },
    {
      "id": "appear-phaino-phaneroo",
      "category": "appear",
      "title": "Words for Appear and Manifest",
      "englishWord": "appear/manifest",
      "introduction": "Greek distinguishes between shining forth (φαίνω), being made manifest (φανερόω), and a visible appearance (ἐπιφάνεια). These illuminate passages about Christ's incarnation and return.",
      "words": [
        {
          "greek": "φαίνω",
          "transliteration": "phainō",
          "strongs": "G5316",
          "shortDef": "to shine, appear (become visible)",
          "nuance": "To shine, give light, appear, become visible. Emphasizes the shining forth of what was hidden. The light 'shines' in the darkness. Root of 'phenomenon.'",
          "ntUsage": 31
        },
        {
          "greek": "φανερόω",
          "transliteration": "phaneroō",
          "strongs": "G5319",
          "shortDef": "to manifest (make visible, reveal)",
          "nuance": "To make manifest, reveal, make known what was hidden. More intentional than φαίνω - actively revealing something. Christ was 'manifested' to take away sins.",
          "ntUsage": 49
        },
        {
          "greek": "ἐπιφάνεια",
          "transliteration": "epiphaneia",
          "strongs": "G2015",
          "shortDef": "appearing (manifestation, epiphany)",
          "nuance": "Appearing, manifestation, visible arrival. A technical term for Christ's visible appearances. Root of 'epiphany.' Used for both His first and second comings.",
          "ntUsage": 6
        },
        {
          "greek": "ἀποκαλύπτω",
          "transliteration": "apokalyptō",
          "strongs": "G601",
          "shortDef": "to reveal (uncover, disclose)",
          "nuance": "To uncover, reveal, disclose. From ἀπό (away) + καλύπτω (cover). Removing the veil to reveal what was hidden. Root of 'apocalypse.' Divine revelation.",
          "ntUsage": 26
        }
      ],
      "vineQuote": "Phaino is to shine, to become evident. Phaneroo is to make manifest, to make clear. Apokalypto is to uncover, to reveal what has been concealed.",
      "exampleVerse": {
        "reference": "1 John 3:2",
        "greek": "οὔπω ἐφανερώθη τί ἐσόμεθα... ὅταν φανερωθῇ, ὅμοιοι αὐτῷ ἐσόμεθα",
        "english": "What we will be has not yet been made manifest (phaneroō); when he appears (phaneroō), we shall be like him",
        "wordHighlighted": "φανερόω"
      },
      "practicalTip": "Christ's ἐπιφάνεια (appearing) will φανερόω (manifest) what we truly are. Our transformation isn't uncertain - it's simply not yet visible. When He appears, we appear with Him in glory.",
      "tags": [
        "eschatology",
        "johannine",
        "christological"
      ]
    },
    {
      "id": "call-kaleo-krazo",
      "category": "call",
      "title": "Words for Call",
      "englishWord": "call",
      "introduction": "Greek distinguishes between calling by name (καλέω), crying out (κράζω), and calling upon for help (ἐπικαλέω). These nuances illuminate God's calling of believers and our calling upon Him.",
      "words": [
        {
          "greek": "καλέω",
          "transliteration": "kaleō",
          "strongs": "G2564",
          "shortDef": "to call (name, invite, summon)",
          "nuance": "To call, name, invite, summon. God's effectual calling of believers to salvation. 'Called according to His purpose.' Also for naming ('His name shall be called Jesus').",
          "ntUsage": 148
        },
        {
          "greek": "κράζω",
          "transliteration": "krazō",
          "strongs": "G2896",
          "shortDef": "to cry out (shout, scream)",
          "nuance": "To cry out, shout, scream. Strong vocal expression, often in distress or prayer. 'Abba, Father' cry of the Spirit. The blind man 'cried out' to Jesus.",
          "ntUsage": 55
        },
        {
          "greek": "ἐπικαλέω",
          "transliteration": "epikaleō",
          "strongs": "G1941",
          "shortDef": "to call upon (invoke, appeal)",
          "nuance": "To call upon, invoke, appeal to. Calling on a name for help or witness. 'Whoever calls on the name of the Lord will be saved.' Paul 'appealed' to Caesar.",
          "ntUsage": 30
        },
        {
          "greek": "προσκαλέω",
          "transliteration": "proskaleō",
          "strongs": "G4341",
          "shortDef": "to summon (call to oneself)",
          "nuance": "To call to oneself, summon. Jesus 'calling' disciples to Himself. More personal than simple καλέω - inviting into relationship.",
          "ntUsage": 29
        }
      ],
      "vineQuote": "Kaleō is to call, to invite. Epikaleō is to call upon, to invoke for aid or witness. God's calling (klēsis) of believers is His effectual summons to salvation.",
      "exampleVerse": {
        "reference": "Romans 10:13",
        "greek": "πᾶς γὰρ ὃς ἂν ἐπικαλέσηται τὸ ὄνομα κυρίου σωθήσεται",
        "english": "Everyone who calls on (epikaleō) the name of the Lord will be saved",
        "wordHighlighted": "ἐπικαλέω"
      },
      "practicalTip": "God καλέω (calls) us to salvation; we ἐπικαλέω (call upon) His name for salvation. His call is effectual, enabling our response. We call because He first called.",
      "tags": [
        "essential",
        "salvation",
        "pauline"
      ]
    },
    {
      "id": "confess-homologeo-exomologeo",
      "category": "confess",
      "title": "Words for Confess",
      "englishWord": "confess",
      "introduction": "Greek has different words for confession, from public acknowledgment (ὁμολογέω) to grateful confession (ἐξομολογέω). Both are essential to Christian faith and practice.",
      "words": [
        {
          "greek": "ὁμολογέω",
          "transliteration": "homologeō",
          "strongs": "G3670",
          "shortDef": "to confess (acknowledge openly)",
          "nuance": "To confess, profess, acknowledge. From ὁμός (same) + λέγω (speak) - to say the same thing. Public profession of faith or acknowledgment of sin. 'If you confess with your mouth.'",
          "ntUsage": 23
        },
        {
          "greek": "ἐξομολογέω",
          "transliteration": "exomologeō",
          "strongs": "G1843",
          "shortDef": "to confess fully (praise, acknowledge)",
          "nuance": "To confess openly, acknowledge, praise. Intensified form with ἐκ. Often used for praise and thanksgiving, or for full confession of sins. 'Every tongue shall confess.'",
          "ntUsage": 10
        },
        {
          "greek": "ὁμολογία",
          "transliteration": "homologia",
          "strongs": "G3671",
          "shortDef": "confession (profession)",
          "nuance": "Confession, profession. The noun form - our stated faith, our public declaration. 'Hold fast the confession of our hope.' The content of what we confess.",
          "ntUsage": 6
        }
      ],
      "vineQuote": "Homologeō signifies to speak the same thing, to agree, to confess. It involves the confession of facts, of faith, and of sins. Exomologeō adds the thought of open, full acknowledgment.",
      "exampleVerse": {
        "reference": "Romans 10:9",
        "greek": "ἐὰν ὁμολογήσῃς ἐν τῷ στόματί σου κύριον Ἰησοῦν",
        "english": "If you confess (homologeō) with your mouth that Jesus is Lord",
        "wordHighlighted": "ὁμολογέω"
      },
      "practicalTip": "ὁμολογέω means to say the same thing as God - about our sin (agreeing it's wrong) and about Christ (agreeing He is Lord). Confession aligns our words with God's truth.",
      "tags": [
        "salvation",
        "practical",
        "pauline"
      ]
    },
    {
      "id": "sign-semeion-teras",
      "category": "sign",
      "title": "Words for Sign and Miracle",
      "englishWord": "sign/miracle",
      "introduction": "Greek uses different words for miraculous events, each emphasizing a different aspect - the significance (σημεῖον), the wonder (τέρας), or the power (δύναμις). John especially emphasizes signs that point to Christ.",
      "words": [
        {
          "greek": "σημεῖον",
          "transliteration": "sēmeion",
          "strongs": "G4592",
          "shortDef": "sign (significant indicator)",
          "nuance": "A sign, token, indication. Emphasizes the meaning and significance of the miraculous event. John's Gospel calls Jesus' miracles 'signs' - they point to His identity and mission.",
          "ntUsage": 77
        },
        {
          "greek": "τέρας",
          "transliteration": "teras",
          "strongs": "G5059",
          "shortDef": "wonder (marvel, portent)",
          "nuance": "A wonder, marvel, portent. Emphasizes the astonishing nature of the event. Almost always paired with σημεῖον ('signs and wonders'). The emotional response of amazement.",
          "ntUsage": 16
        },
        {
          "greek": "δύναμις",
          "transliteration": "dynamis",
          "strongs": "G1411",
          "shortDef": "mighty work (power, miracle)",
          "nuance": "Power, might, miracle. When used for miracles, emphasizes the power displayed. 'Mighty works' done by Jesus. The synoptic Gospels prefer this term.",
          "ntUsage": 120
        },
        {
          "greek": "θαῦμα",
          "transliteration": "thauma",
          "strongs": "G2295",
          "shortDef": "wonder (astonishment)",
          "nuance": "Wonder, marvel, astonishment. The response of amazement to something extraordinary. 'No wonder' = θαυμαστόν. Related to θαυμάζω (to marvel).",
          "ntUsage": 2
        }
      ],
      "vineQuote": "Semeion emphasizes the significance of the miracle as pointing to something beyond itself. Teras emphasizes the wonder it evokes. Dynamis emphasizes the power displayed.",
      "exampleVerse": {
        "reference": "John 20:30-31",
        "greek": "πολλὰ μὲν οὖν καὶ ἄλλα σημεῖα ἐποίησεν ὁ Ἰησοῦς... ταῦτα δὲ γέγραπται ἵνα πιστεύ[σ]ητε",
        "english": "Jesus did many other signs (sēmeion)... but these are written so that you may believe",
        "wordHighlighted": "σημεῖον"
      },
      "practicalTip": "John uses σημεῖα (signs) because miracles are meant to point beyond themselves to Christ. If we marvel at the power (δύναμις) but miss the significance (σημεῖον), we've missed the point.",
      "tags": [
        "johannine",
        "synoptic",
        "christological"
      ]
    },
    {
      "id": "clothing-himation-endyma",
      "category": "clothing",
      "title": "Words for Clothing and Garments",
      "englishWord": "clothing",
      "introduction": "Greek uses different words for clothing, from outer garments to undergarments to robes. These distinctions clarify passages about dress and the metaphorical 'putting on' of virtues.",
      "words": [
        {
          "greek": "ἱμάτιον",
          "transliteration": "himation",
          "strongs": "G2440",
          "shortDef": "garment (outer cloak)",
          "nuance": "An outer garment, cloak, robe. The general word for clothing, often the outer robe. Soldiers cast lots for Jesus' ἱμάτιον. Also used metaphorically for spiritual covering.",
          "ntUsage": 60
        },
        {
          "greek": "χιτών",
          "transliteration": "chitōn",
          "strongs": "G5509",
          "shortDef": "tunic (inner garment)",
          "nuance": "A tunic, the inner garment worn next to the skin. 'If someone takes your χιτών, give him your ἱμάτιον also' - offering both inner and outer garments.",
          "ntUsage": 11
        },
        {
          "greek": "στολή",
          "transliteration": "stolē",
          "strongs": "G4749",
          "shortDef": "robe (long flowing garment)",
          "nuance": "A long robe, stately garment. Often worn by those of dignity or authority. The prodigal son received the 'best robe.' Scribes who love to walk in long robes.",
          "ntUsage": 9
        },
        {
          "greek": "ἔνδυμα",
          "transliteration": "endyma",
          "strongs": "G1742",
          "shortDef": "clothing (what is put on)",
          "nuance": "Clothing, what is put on. From ἐνδύω (to put on). General term for apparel. 'Take no thought for... what you shall put on.'",
          "ntUsage": 8
        }
      ],
      "vineQuote": "Himation is the outer garment, the cloak. Chitōn is the inner garment, the tunic. Together they represent complete clothing.",
      "exampleVerse": {
        "reference": "Colossians 3:12",
        "greek": "ἐνδύσασθε οὖν... σπλάγχνα οἰκτιρμοῦ",
        "english": "Put on (endyō) then... compassionate hearts",
        "wordHighlighted": "ἐνδύω (the verb 'to clothe')"
      },
      "practicalTip": "When Paul says 'put on' (ἐνδύω) Christ or virtues, he uses clothing language. Just as we deliberately dress each morning, we deliberately clothe ourselves with Christ-like character.",
      "tags": [
        "pauline",
        "practical",
        "metaphorical"
      ]
    },
    {
      "id": "test-peirazo-dokimazo",
      "category": "test",
      "title": "Words for Test and Temptation",
      "englishWord": "test/tempt",
      "introduction": "Greek distinguishes between testing with intent to prove (δοκιμάζω) and testing with intent to entice to sin (πειράζω). God tests but never tempts to evil.",
      "words": [
        {
          "greek": "πειράζω",
          "transliteration": "peirazō",
          "strongs": "G3985",
          "shortDef": "to test, tempt (try, prove)",
          "nuance": "To test, try, tempt. Can be neutral (testing to prove) or negative (tempting to sin). Satan 'tempts' to evil; God 'tests' to strengthen. Context determines which.",
          "ntUsage": 38
        },
        {
          "greek": "δοκιμάζω",
          "transliteration": "dokimazō",
          "strongs": "G1381",
          "shortDef": "to test, examine (approve after testing)",
          "nuance": "To test, examine, prove by testing. Always with the expectation of approval. Testing metals to prove their genuineness. 'Test everything; hold fast what is good.'",
          "ntUsage": 22
        },
        {
          "greek": "πειρασμός",
          "transliteration": "peirasmos",
          "strongs": "G3986",
          "shortDef": "trial, temptation (testing experience)",
          "nuance": "Trial, temptation, testing. The noun form of πειράζω. Can refer to trials that strengthen faith or temptations that entice to sin. 'Lead us not into temptation.'",
          "ntUsage": 21
        },
        {
          "greek": "δοκιμή",
          "transliteration": "dokimē",
          "strongs": "G1382",
          "shortDef": "proof (approved character)",
          "nuance": "Proof, test, approved character. The result of testing - proven character. 'Suffering produces endurance, and endurance produces proven character.'",
          "ntUsage": 7
        }
      ],
      "vineQuote": "Peirazo may be used in a good sense, to try or test, and in a bad sense, to tempt, to solicit to sin. Dokimazo is always used in a good sense, to prove with a view to approval.",
      "exampleVerse": {
        "reference": "James 1:13-14",
        "greek": "ὁ θεὸς ἀπείραστός ἐστιν κακῶν, πειράζει δὲ αὐτὸς οὐδένα",
        "english": "God cannot be tempted (apeirastos) with evil, and he himself tempts (peirazō) no one",
        "wordHighlighted": "πειράζω"
      },
      "practicalTip": "James clarifies: God δοκιμάζω (tests to prove) but never πειράζω (tempts to sin). Trials strengthen; temptations entice. The same situation may be God's test and Satan's temptation.",
      "tags": [
        "essential",
        "james",
        "practical"
      ]
    },
    {
      "id": "reward-misthos-antapodoma",
      "category": "reward",
      "title": "Words for Reward",
      "englishWord": "reward",
      "introduction": "Greek distinguishes between wages earned (μισθός), recompense returned (ἀνταπόδομα), and gracious gifts (χάρισμα). These clarify the relationship between works, rewards, and grace.",
      "words": [
        {
          "greek": "μισθός",
          "transliteration": "misthos",
          "strongs": "G3408",
          "shortDef": "wages, reward (due payment)",
          "nuance": "Wages, hire, reward. Payment for work done. Used both for literal wages and for divine rewards. 'Great is your reward in heaven.' The laborer deserves his wages.",
          "ntUsage": 29
        },
        {
          "greek": "μισθαποδοσία",
          "transliteration": "misthapodosia",
          "strongs": "G3405",
          "shortDef": "recompense (reward or punishment)",
          "nuance": "Recompense, the paying back of wages, reward or punishment. Can be positive or negative depending on what is deserved. God is a rewarder of those who seek Him.",
          "ntUsage": 3
        },
        {
          "greek": "ἀνταπόδομα",
          "transliteration": "antapodoma",
          "strongs": "G468",
          "shortDef": "recompense (return for action)",
          "nuance": "Recompense, requital, what is paid back. From ἀντί (in return) + ἀποδίδωμι (pay). Something given in return for what was done.",
          "ntUsage": 2
        },
        {
          "greek": "βραβεῖον",
          "transliteration": "brabeion",
          "strongs": "G1017",
          "shortDef": "prize (athletic award)",
          "nuance": "The prize awarded to victors in games. Paul uses athletic imagery: 'Run in such a way as to get the prize.' The crown awaiting faithful runners.",
          "ntUsage": 2
        }
      ],
      "vineQuote": "Misthos denotes wages, the payment due for work done. It is used of the reward which God bestows, or will bestow, upon His servants.",
      "exampleVerse": {
        "reference": "1 Corinthians 9:24",
        "greek": "οὕτως τρέχετε ἵνα καταλάβητε τὸ βραβεῖον",
        "english": "Run in such a way that you may obtain the prize (brabeion)",
        "wordHighlighted": "βραβεῖον"
      },
      "practicalTip": "Salvation is a gift (χάρισμα), not μισθός (wages). But within salvation, faithful service receives μισθός (reward). We cannot earn salvation, but we can earn crowns.",
      "tags": [
        "pauline",
        "eschatology",
        "practical"
      ]
    },
    {
      "id": "eternal-aionios-aidios",
      "category": "eternal",
      "title": "Words for Eternal/Everlasting",
      "englishWord": "eternal/everlasting",
      "introduction": "English uses 'eternal' and 'everlasting' interchangeably, but Greek has distinct terms. This distinction is crucial for understanding 'eternal life,' 'eternal punishment,' and the nature of God's existence.",
      "words": [
        {
          "greek": "αἰώνιος",
          "transliteration": "aiōnios",
          "strongs": "G166",
          "shortDef": "eternal, belonging to the age (aeon)",
          "nuance": "The primary NT word for 'eternal.' Derived from αἰών (age), it can mean 'belonging to the coming age' or 'age-long.' When applied to God or divine realities, it indicates timeless, unending existence. The word carries qualitative as well as quantitative meaning - not just endless duration but the quality of the age to come.",
          "ntUsage": 71
        },
        {
          "greek": "ἀΐδιος",
          "transliteration": "aidios",
          "strongs": "G126",
          "shortDef": "everlasting, perpetual",
          "nuance": "Rare in the NT (only twice), this word unambiguously means 'everlasting' in the sense of unending duration. It emphasizes continuous, unbroken existence without beginning or end. Used for God's eternal power (Rom 1:20) and the everlasting chains binding fallen angels (Jude 6).",
          "ntUsage": 2
        }
      ],
      "vineQuote": "Aidios is used of that which is endless in duration, while aiōnios may sometimes suggest that which is timeless in quality, belonging to the eternal order of things.",
      "exampleVerse": {
        "reference": "Romans 1:20",
        "greek": "ἥ τε ἀΐδιος αὐτοῦ δύναμις καὶ θειότης",
        "english": "His eternal (aidios) power and divine nature.",
        "wordHighlighted": "ἀΐδιος"
      },
      "practicalTip": "When you see 'eternal life' (ζωὴ αἰώνιος), remember it means not just life without end but life of a different quality - the life of the coming age, experienced now through Christ. The term points to both duration and character.",
      "tags": [
        "essential",
        "theological",
        "eschatology"
      ]
    },
    {
      "id": "covenant-diatheke-syntheke",
      "category": "covenant",
      "title": "Words for Covenant/Testament",
      "englishWord": "covenant/testament",
      "introduction": "The Greek word for 'covenant' in the NT (διαθήκη) differs from the classical word for mutual agreements (συνθήκη). This choice reveals something profound about the nature of God's relationship with His people - it is not a negotiated contract but a gracious disposition.",
      "words": [
        {
          "greek": "διαθήκη",
          "transliteration": "diathēkē",
          "strongs": "G1242",
          "shortDef": "covenant, testament, will",
          "nuance": "The NT word for God's covenant. Unlike συνθήκη (mutual agreement), διαθήκη emphasizes a unilateral disposition - like a will or testament that one party establishes. God initiates and guarantees His covenant; humans receive it. The LXX translators chose this word (not συνθήκη) to translate Hebrew בְּרִית (berith).",
          "ntUsage": 33
        },
        {
          "greek": "συνθήκη",
          "transliteration": "synthēkē",
          "strongs": "G4934",
          "shortDef": "agreement, compact (mutual)",
          "nuance": "Classical Greek word for a mutual agreement or treaty between equal parties. Significantly, the NT never uses this word for God's covenant. God does not negotiate terms with humanity; He graciously establishes His covenant. This word does not appear in the NT at all.",
          "ntUsage": 0
        }
      ],
      "vineQuote": "Diathēkē primarily signifies a disposition of property by will or otherwise. In its use in the Septuagint it is the rendering of a Hebrew word meaning a 'covenant' or agreement. The choice of this word by the LXX, instead of synthēkē, is significant: God's covenant is not a mutual compact but a sovereign disposition.",
      "exampleVerse": {
        "reference": "Hebrews 9:15",
        "greek": "διαθήκης καινῆς μεσίτης ἐστίν",
        "english": "He is the mediator of a new covenant (diathēkē).",
        "wordHighlighted": "διαθήκη"
      },
      "practicalTip": "When studying the 'new covenant' passages (Jer 31, Heb 8-10), remember that διαθήκη emphasizes God's gracious initiative. The covenant is His promise, guaranteed by His character, not a bargain we negotiate with Him.",
      "tags": [
        "essential",
        "theological",
        "hebrews"
      ]
    },
    {
      "id": "obey-hupakouo-peitho-hupotasso",
      "category": "obey",
      "title": "Words for Obey/Submit",
      "englishWord": "obey/submit",
      "introduction": "Greek has several words for obedience, each with distinct emphases. Some stress listening and responding, others emphasize persuasion and trust, and still others focus on orderly submission. Understanding these helps clarify NT commands about obedience.",
      "words": [
        {
          "greek": "ὑπακούω",
          "transliteration": "hypakouō",
          "strongs": "G5219",
          "shortDef": "to obey (by listening attentively)",
          "nuance": "Literally 'to hear under' - to listen carefully and respond accordingly. Emphasizes hearing and heeding, the obedience that comes from careful attention to what is commanded. Used for obeying parents (Eph 6:1), masters (Eph 6:5), and the gospel (Rom 10:16).",
          "ntUsage": 21
        },
        {
          "greek": "πείθω",
          "transliteration": "peithō",
          "strongs": "G3982",
          "shortDef": "to persuade, trust, obey (from conviction)",
          "nuance": "In its middle/passive forms, means 'to be persuaded, to trust, to obey.' The obedience that flows from inner conviction rather than external compulsion. Used for obeying leaders (Heb 13:17) - suggesting willing, convinced submission rather than mere compliance.",
          "ntUsage": 52
        },
        {
          "greek": "ὑποτάσσω",
          "transliteration": "hypotassō",
          "strongs": "G5293",
          "shortDef": "to submit, place under (orderly subordination)",
          "nuance": "A military term meaning to arrange under, to subordinate. Emphasizes taking one's proper place in an ordered structure. Used for wives to husbands (Eph 5:22), church to Christ (Eph 5:24), citizens to government (Rom 13:1). Often middle voice: 'to voluntarily place oneself under.'",
          "ntUsage": 38
        },
        {
          "greek": "πειθαρχέω",
          "transliteration": "peitharcheō",
          "strongs": "G3980",
          "shortDef": "to obey authority",
          "nuance": "Combines πείθω (persuade/obey) with ἀρχή (authority). Emphasizes obedience to constituted authority. Used in Acts 5:29 'We must obey God rather than men' - obedience to legitimate authority.",
          "ntUsage": 4
        }
      ],
      "vineQuote": "Hypakouō stresses the idea of hearing and responding; peithō suggests the obedience that springs from persuasion or trust; hupotassō implies the orderly arrangement of subordination.",
      "exampleVerse": {
        "reference": "Hebrews 13:17",
        "greek": "πείθεσθε τοῖς ἡγουμένοις ὑμῶν καὶ ὑπείκετε",
        "english": "Obey (peithō - be persuaded by) your leaders and submit.",
        "wordHighlighted": "πείθω"
      },
      "practicalTip": "Note that biblical obedience is never mindless compliance. ὑπακούω involves careful listening; πείθω involves conviction; ὑποτάσσω often appears in middle voice, suggesting voluntary placement. Christian obedience is intelligent, willing, and ordered.",
      "tags": [
        "essential",
        "ethics",
        "pauline"
      ]
    },
    {
      "id": "patience-makrothymia-hypomone",
      "category": "patience",
      "title": "Words for Patience/Endurance",
      "englishWord": "patience/endurance",
      "introduction": "English 'patience' covers two distinct Greek concepts: patience with people (μακροθυμία) and endurance under circumstances (ὑπομονή). Confusing them weakens our understanding of key NT virtues.",
      "words": [
        {
          "greek": "μακροθυμία",
          "transliteration": "makrothymia",
          "strongs": "G3115",
          "shortDef": "patience, long-suffering (toward people)",
          "nuance": "Literally 'long-tempered' - the opposite of quick-tempered. Patience with people who provoke, offend, or wrong us. It is not retaliating or giving up on difficult people. A fruit of the Spirit (Gal 5:22) and an attribute of God who is 'slow to anger' toward sinners.",
          "ntUsage": 14
        },
        {
          "greek": "ὑπομονή",
          "transliteration": "hypomonē",
          "strongs": "G5281",
          "shortDef": "endurance, perseverance (under circumstances)",
          "nuance": "Literally 'remaining under' - standing firm under pressure, trial, or difficulty. Not passive resignation but active, courageous endurance. The fortitude that perseveres through suffering while maintaining faith and hope. The mark of tested faith (Jas 1:3-4).",
          "ntUsage": 32
        },
        {
          "greek": "ἀνοχή",
          "transliteration": "anochē",
          "strongs": "G463",
          "shortDef": "forbearance, restraint",
          "nuance": "A holding back, restraint, forbearance. Used of God's patience in withholding judgment (Rom 2:4; 3:26). While μακροθυμία emphasizes long-suffering disposition, ἀνοχή emphasizes the restraint of deserved punishment.",
          "ntUsage": 2
        }
      ],
      "vineQuote": "Makrothumia is the quality that does not easily give up in the face of provocation by people; hupomonē is the temper that does not surrender to circumstances or succumb under trial.",
      "exampleVerse": {
        "reference": "Colossians 1:11",
        "greek": "εἰς πᾶσαν ὑπομονὴν καὶ μακροθυμίαν μετὰ χαρᾶς",
        "english": "For all endurance (hypomonē) and patience (makrothymia) with joy.",
        "wordHighlighted": "ὑπομονή and μακροθυμία"
      },
      "practicalTip": "When praying for 'patience,' be specific: Do you need μακροθυμία (patience with a difficult person) or ὑπομονή (endurance through a hard circumstance)? The distinction helps target both prayer and practice.",
      "tags": [
        "essential",
        "fruit-of-spirit",
        "suffering"
      ]
    },
    {
      "id": "comfort-parakaleo-paramytheomai",
      "category": "comfort",
      "title": "Words for Comfort/Encourage",
      "englishWord": "comfort/encourage",
      "introduction": "The NT uses several words for comfort and encouragement. The most significant is παρακαλέω (the root of 'Paraclete,' Jesus' name for the Holy Spirit). Understanding these words enriches our grasp of Christian consolation and the Spirit's ministry.",
      "words": [
        {
          "greek": "παρακαλέω",
          "transliteration": "parakaleō",
          "strongs": "G3870",
          "shortDef": "to call alongside, encourage, exhort, comfort",
          "nuance": "The richest NT word for encouragement. Literally 'to call alongside.' The range of meaning includes: exhorting (urging to action), comforting (consoling in sorrow), encouraging (strengthening resolve), and entreating (making request). Context determines emphasis. The Holy Spirit is the Paráklētos (Παράκλητος) - the One called alongside to help.",
          "ntUsage": 109
        },
        {
          "greek": "παραμυθέομαι",
          "transliteration": "paramytheomai",
          "strongs": "G3888",
          "shortDef": "to console, soothe, comfort",
          "nuance": "A tender word for consolation, especially in grief or sorrow. While παρακαλέω can include urging to action, παραμυθέομαι emphasizes gentle, sympathetic comfort. Used for comforting the bereaved (John 11:19, 31) and tender care (1 Thess 2:11; 5:14).",
          "ntUsage": 4
        },
        {
          "greek": "παρηγορία",
          "transliteration": "parēgoria",
          "strongs": "G3931",
          "shortDef": "comfort, solace",
          "nuance": "A soothing, cheering word. Only in Col 3:11 in the NT. The root of English 'paregoric' (a soothing medicine). Emphasizes the comforting, reassuring aspect rather than exhortation.",
          "ntUsage": 1
        }
      ],
      "vineQuote": "Parakaleō primarily means 'to call to one's side,' hence to comfort, exhort, entreat. Paramytheomai suggests tender comfort, especially in sorrow, a comforting that is more personal and sympathetic.",
      "exampleVerse": {
        "reference": "2 Corinthians 1:3-4",
        "greek": "ὁ θεὸς πάσης παρακλήσεως, ὁ παρακαλῶν ἡμᾶς",
        "english": "The God of all comfort (paraklēsis), who comforts (parakaleō) us.",
        "wordHighlighted": "παράκλησις and παρακαλέω"
      },
      "practicalTip": "The Holy Spirit as 'Paraclete' (John 14-16) means far more than 'Comforter.' He is the One called alongside to encourage, strengthen, convict, guide, and advocate. Every meaning of παρακαλέω applies to His ministry.",
      "tags": [
        "essential",
        "spirit",
        "johannine"
      ]
    },
    {
      "id": "good-agathos-kalos-chrestos",
      "category": "good",
      "title": "Words for Good",
      "englishWord": "good",
      "introduction": "Greek has several words for 'good,' each with distinct emphasis. Some stress inherent quality, others beauty and excellence, still others usefulness or kindness. These distinctions illuminate NT descriptions of God, people, and actions.",
      "words": [
        {
          "greek": "ἀγαθός",
          "transliteration": "agathos",
          "strongs": "G18",
          "shortDef": "good (intrinsically, beneficially)",
          "nuance": "Moral goodness that benefits others. Emphasizes intrinsic goodness and its beneficial effect. Used of God (Matt 19:17 'One is good'), good works (Eph 2:10), and the good fruit produced by believers. Often paired with καλός but emphasizes the beneficial aspect more strongly.",
          "ntUsage": 102
        },
        {
          "greek": "καλός",
          "transliteration": "kalos",
          "strongs": "G2570",
          "shortDef": "good (beautiful, excellent, noble)",
          "nuance": "Good in the sense of beautiful, noble, or excellent. Emphasizes quality, attractiveness, and fitness for purpose. Used for 'good works' that are visible and praiseworthy (Matt 5:16), 'good' soil (Mark 4:8), the 'good shepherd' (John 10:11). The aesthetic and ethical merge.",
          "ntUsage": 101
        },
        {
          "greek": "χρηστός",
          "transliteration": "chrēstos",
          "strongs": "G5543",
          "shortDef": "good (kind, gracious, useful)",
          "nuance": "Good in the sense of kind, pleasant, or serviceable. Emphasizes usefulness and kindness in dealings with others. Used of God's kindness (Rom 2:4; Eph 2:7), the 'easy' yoke of Christ (Matt 11:30), and gracious speech (Eph 4:32).",
          "ntUsage": 7
        }
      ],
      "vineQuote": "Agathos describes that which, being good in its character or constitution, is beneficial in its effect; kalos denotes that which is intrinsically good, beautiful, or honorable; chrestos suggests what is suitable, serviceable, and kind.",
      "exampleVerse": {
        "reference": "Matthew 19:17",
        "greek": "εἷς ἐστιν ὁ ἀγαθός",
        "english": "There is only One who is good (agathos).",
        "wordHighlighted": "ἀγαθός"
      },
      "practicalTip": "When Scripture says 'do good,' note which word is used: ἀγαθός emphasizes beneficial effect on others; καλός emphasizes visible excellence that glorifies God. Both are called for (Gal 6:10; Titus 3:8).",
      "tags": [
        "essential",
        "ethics",
        "theological"
      ]
    },
    {
      "id": "evil-kakos-poneros-phaulos",
      "category": "evil",
      "title": "Words for Evil/Bad",
      "englishWord": "evil/bad",
      "introduction": "As Greek distinguishes types of good, it also distinguishes types of evil. Some words emphasize harmful quality, others active malice, still others worthlessness. The 'evil one' (πονηρός) and his works are described with precision.",
      "words": [
        {
          "greek": "κακός",
          "transliteration": "kakos",
          "strongs": "G2556",
          "shortDef": "bad, evil (in quality or effect)",
          "nuance": "The general word for evil or bad, emphasizing harmful quality or effect. Can refer to moral evil (Rom 12:17) or physical harm (Acts 28:5). Often contrasted with ἀγαθός. The corresponding noun κακία means 'malice' or 'wickedness.'",
          "ntUsage": 50
        },
        {
          "greek": "πονηρός",
          "transliteration": "ponēros",
          "strongs": "G4190",
          "shortDef": "evil (actively wicked, malevolent)",
          "nuance": "Evil in an active, malignant sense - not merely bad but actively harmful and corrupting. The word used for 'the evil one' (ὁ πονηρός, Matt 13:19; 1 John 5:19). Implies a malevolent influence that spreads corruption. Used for evil eyes (Matt 6:23), evil generations (Matt 12:39), and evil hearts (Heb 3:12).",
          "ntUsage": 78
        },
        {
          "greek": "φαῦλος",
          "transliteration": "phaulos",
          "strongs": "G5337",
          "shortDef": "worthless, bad (contemptible)",
          "nuance": "Evil in the sense of worthless, trivial, or contemptible. Not so much actively malignant as base and good-for-nothing. Used for evil deeds that merit judgment (John 5:29; Rom 9:11; 2 Cor 5:10). Emphasizes the worthlessness of sin.",
          "ntUsage": 6
        }
      ],
      "vineQuote": "Kakos stands for 'bad' in character, poneros denotes what is actively evil in influence, phaulos suggests what is worthless or contemptible.",
      "exampleVerse": {
        "reference": "Matthew 6:13",
        "greek": "ῥῦσαι ἡμᾶς ἀπὸ τοῦ πονηροῦ",
        "english": "Deliver us from the evil one (ponēros).",
        "wordHighlighted": "πονηρός"
      },
      "practicalTip": "When the NT speaks of 'the evil one' (ὁ πονηρός), the word choice emphasizes Satan's actively malignant influence. He is not merely 'bad' (κακός) but aggressively corrupting and destructive.",
      "tags": [
        "essential",
        "spiritual-warfare",
        "ethics"
      ]
    },
    {
      "id": "death-life-thanatos-zoe-bios-psyche",
      "category": "death-life",
      "title": "Words for Death and Life",
      "englishWord": "death/life",
      "introduction": "The contrast between death and life runs through all Scripture. Greek provides distinct words that reveal different aspects: physical death vs. spiritual death, biological life vs. eternal life, natural life vs. soul. These distinctions are foundational for NT theology.",
      "words": [
        {
          "greek": "θάνατος",
          "transliteration": "thanatos",
          "strongs": "G2288",
          "shortDef": "death (physical or spiritual)",
          "nuance": "Death as state or power. Used for physical death (Phil 1:20), spiritual death (separation from God, Rom 6:23), and 'the second death' (Rev 20:14). Death is personified as an enemy (1 Cor 15:26) and as having lost its sting through Christ (1 Cor 15:55).",
          "ntUsage": 120
        },
        {
          "greek": "ζωή",
          "transliteration": "zōē",
          "strongs": "G2222",
          "shortDef": "life (essential, eternal)",
          "nuance": "Life in its highest sense - the life that God has in Himself and gives to believers. The word for 'eternal life' (ζωὴ αἰώνιος). Not merely biological existence but spiritual vitality, abundant life (John 10:10), the life that is in Christ (John 1:4; 14:6). The opposite of spiritual death.",
          "ntUsage": 135
        },
        {
          "greek": "βίος",
          "transliteration": "bios",
          "strongs": "G979",
          "shortDef": "life (manner, livelihood, duration)",
          "nuance": "Life in terms of its duration, manner of living, or means of subsistence. Used for livelihood/possessions (Mark 12:44; Luke 8:14), the duration of life (1 Pet 4:3), and lifestyle (1 Tim 2:2). The root of 'biology.' Distinguished from ζωή as the outward life is from the inner life principle.",
          "ntUsage": 11
        },
        {
          "greek": "ψυχή",
          "transliteration": "psychē",
          "strongs": "G5590",
          "shortDef": "soul, life, self",
          "nuance": "The soul or self - the seat of personality, emotions, and natural life. Can mean physical life (Matt 6:25), the soul as distinct from body (Matt 10:28), or the whole person (Acts 2:41 'three thousand souls'). Distinguished from πνεῦμα (spirit) as the self-conscious life is from the God-conscious spirit.",
          "ntUsage": 105
        }
      ],
      "vineQuote": "Zōē is used of life as the absolute gift of God in Christ, βίος of the period or manner of life, ψυχή of the natural life in relation to the soul and self.",
      "exampleVerse": {
        "reference": "John 11:25",
        "greek": "ἐγώ εἰμι ἡ ἀνάστασις καὶ ἡ ζωή",
        "english": "I am the resurrection and the life (zōē).",
        "wordHighlighted": "ζωή"
      },
      "practicalTip": "When Jesus offers 'life' (ζωή), He offers the very life of God - not just a longer βίος or a better ψυχή, but divine, eternal, abundant ζωή. This is the life we lost in Adam and receive in Christ.",
      "tags": [
        "essential",
        "johannine",
        "soteriology"
      ]
    },
    {
      "id": "witness-martys-martyria-martyrion",
      "category": "witness",
      "title": "Words for Witness/Testimony",
      "englishWord": "witness/testimony",
      "introduction": "Greek has several related words for witness and testimony. Understanding their distinctions helps grasp the NT emphasis on eyewitness testimony, the church's mission to testify, and ultimately, martyrdom - witness unto death.",
      "words": [
        {
          "greek": "μάρτυς",
          "transliteration": "martys",
          "strongs": "G3144",
          "shortDef": "witness (the person who testifies)",
          "nuance": "The person who bears witness - one who has firsthand knowledge and testifies to what they have seen or known. The apostles were 'witnesses' to the resurrection (Acts 1:8, 22). Later developed into 'martyr' - one who witnesses to Christ even unto death (Acts 22:20; Rev 2:13).",
          "ntUsage": 35
        },
        {
          "greek": "μαρτυρία",
          "transliteration": "martyria",
          "strongs": "G3141",
          "shortDef": "witness, testimony (the content or act)",
          "nuance": "The testimony itself - the content of what is witnessed or the act of witnessing. John's Gospel emphasizes Jesus' 'testimony' and God's testimony about the Son (John 1:7; 5:31-36; 1 John 5:9-11). The testimony establishes truth.",
          "ntUsage": 37
        },
        {
          "greek": "μαρτύριον",
          "transliteration": "martyrion",
          "strongs": "G3142",
          "shortDef": "testimony, witness, proof, evidence",
          "nuance": "Testimony as proof or evidence - often with the sense of testimony that serves as evidence against or for someone. Used for the gospel witness 'as a testimony to all nations' (Matt 24:14). Also refers to the 'tabernacle of testimony' (Acts 7:44).",
          "ntUsage": 19
        },
        {
          "greek": "μαρτυρέω",
          "transliteration": "martyreō",
          "strongs": "G3140",
          "shortDef": "to bear witness, testify",
          "nuance": "The verb form - to give testimony, to bear witness. Especially prominent in John's Gospel: John the Baptist 'came to bear witness' (John 1:7-8); Jesus bears witness to what He has seen (John 3:11, 32); the Spirit will 'bear witness' (John 15:26).",
          "ntUsage": 76
        }
      ],
      "vineQuote": "Martys denotes one who can or does give evidence concerning facts; martyria is the testimony given; martyrion is testimony with special reference to its evidential value.",
      "exampleVerse": {
        "reference": "Acts 1:8",
        "greek": "ἔσεσθέ μου μάρτυρες ἔν τε Ἰερουσαλὴμ... καὶ ἕως ἐσχάτου τῆς γῆς",
        "english": "You will be my witnesses in Jerusalem... to the ends of the earth.",
        "wordHighlighted": "μάρτυς"
      },
      "practicalTip": "The connection between 'witness' and 'martyr' is not accidental. Early Christians understood that bearing faithful witness might require dying for that testimony. When you see 'witness' in the NT, consider: What has this person seen? What are they willing to stake on it?",
      "tags": [
        "essential",
        "mission",
        "johannine"
      ]
    },
    {
      "id": "servant-doulos-diakonos-hyperetes-leitourgos",
      "category": "servant",
      "title": "Words for Servant/Slave",
      "englishWord": "servant/slave/minister",
      "introduction": "Greek distinguishes different types of service. Some emphasize bondage to a master, others table service, others official assistance, still others sacred ministry. These distinctions illuminate NT teaching on Christian service and ministry roles.",
      "words": [
        {
          "greek": "δοῦλος",
          "transliteration": "doulos",
          "strongs": "G1401",
          "shortDef": "slave, bondservant (owned by a master)",
          "nuance": "The most complete form of servitude - one who belongs entirely to another. Not merely hired but owned. Paul calls himself 'slave of Christ' (Rom 1:1; Phil 1:1). Believers are 'slaves of righteousness' (Rom 6:18) or 'slaves of sin' (Rom 6:17). Emphasizes total belonging and obedience.",
          "ntUsage": 126
        },
        {
          "greek": "διάκονος",
          "transliteration": "diakonos",
          "strongs": "G1249",
          "shortDef": "servant, minister, deacon (one who serves)",
          "nuance": "Originally one who serves at table, then more broadly any servant or minister. Less emphasis on bondage, more on active service. Used for church office 'deacon' (Phil 1:1; 1 Tim 3:8). Christ came 'not to be served but to serve' (διακονῆσαι, Mark 10:45). The root of 'deacon' and 'diaconate.'",
          "ntUsage": 29
        },
        {
          "greek": "ὑπηρέτης",
          "transliteration": "hypēretēs",
          "strongs": "G5257",
          "shortDef": "assistant, attendant, helper (under orders)",
          "nuance": "Literally an 'under-rower' (one rowing in a ship's lower tier), hence one who serves under another's direction. An attendant who carries out orders. Used for synagogue attendant (Luke 4:20), officers of the court (Matt 26:58), and ministers of the word (Luke 1:2; Acts 26:16).",
          "ntUsage": 20
        },
        {
          "greek": "λειτουργός",
          "transliteration": "leitourgos",
          "strongs": "G3011",
          "shortDef": "minister, public servant (sacred or civic)",
          "nuance": "One who performs public service, especially religious service. Used for priests (Heb 8:2), angels (Heb 1:7), governmental authorities (Rom 13:6), and Paul's ministry (Rom 15:16). The root of 'liturgy.' Emphasizes official, often sacred, service.",
          "ntUsage": 5
        }
      ],
      "vineQuote": "Doulos is one whose will is swallowed up in the will of another; diakonos is one who renders service; hypēretēs is one who acts under direction; leitourgos performs sacred or public duty.",
      "exampleVerse": {
        "reference": "Mark 10:43-44",
        "greek": "ὃς ἂν θέλῃ μέγας γενέσθαι ἐν ὑμῖν ἔσται ὑμῶν διάκονος, καὶ ὃς ἂν θέλῃ ἐν ὑμῖν εἶναι πρῶτος ἔσται πάντων δοῦλος",
        "english": "Whoever wants to be great must be your servant (diakonos), and whoever wants to be first must be slave (doulos) of all.",
        "wordHighlighted": "διάκονος and δοῦλος"
      },
      "practicalTip": "When Paul calls himself 'slave of Christ' (δοῦλος Χριστοῦ), he uses the strongest term - total belonging. When Scripture speaks of 'deacons' (διάκονοι), it emphasizes active service. Note which word is used to understand the type of service intended.",
      "tags": [
        "essential",
        "ministry",
        "ethics"
      ]
    },
    {
      "id": "power-dynamis-exousia-ischys-kratos",
      "category": "power",
      "title": "Words for Power/Authority",
      "englishWord": "power/authority/strength",
      "introduction": "English 'power' covers several Greek concepts: inherent ability, delegated authority, physical strength, and sovereign might. These distinctions illuminate NT teaching about God's power, Christ's authority, and the power available to believers.",
      "words": [
        {
          "greek": "δύναμις",
          "transliteration": "dynamis",
          "strongs": "G1411",
          "shortDef": "power, ability, mighty work, miracle",
          "nuance": "Inherent power or ability - the capacity to do something. The power resident in someone or something. Used for God's power (Rom 1:16, 20), the power of Christ's resurrection (Phil 3:10), miracles ('powers,' Matt 11:20), and the power the Spirit gives believers (Acts 1:8). Root of 'dynamite' and 'dynamic.'",
          "ntUsage": 120
        },
        {
          "greek": "ἐξουσία",
          "transliteration": "exousia",
          "strongs": "G1849",
          "shortDef": "authority, right, power (delegated or inherent)",
          "nuance": "The right or authority to do something - often delegated. Jesus taught with authority (Matt 7:29), gave disciples authority over demons (Luke 9:1), and declared 'all authority in heaven and earth is given to me' (Matt 28:18). Used for governmental authorities (Rom 13:1-3). Emphasizes legitimate right, not just ability.",
          "ntUsage": 102
        },
        {
          "greek": "ἰσχύς",
          "transliteration": "ischys",
          "strongs": "G2479",
          "shortDef": "strength, might, force (physical or otherwise)",
          "nuance": "Strength as possessed, especially physical strength or forceful might. 'Love the Lord with all your strength' (Mark 12:30). God's 'mighty strength' (Eph 1:19; 6:10). The strength exerted in action.",
          "ntUsage": 10
        },
        {
          "greek": "κράτος",
          "transliteration": "kratos",
          "strongs": "G2904",
          "shortDef": "might, dominion, ruling power",
          "nuance": "Sovereign might, ruling power, dominion. Used almost exclusively of God in NT: 'the might of His glory' (Col 1:11), 'to Him be... dominion forever' (1 Pet 5:11; Jude 25). Emphasizes supreme, conquering power. Root of '-cracy' words (democracy, theocracy).",
          "ntUsage": 12
        }
      ],
      "vineQuote": "Dynamis is ability or capability; exousia is the right to exercise power; ischys is strength as an endowment; kratos is the manifestation of power in ruling.",
      "exampleVerse": {
        "reference": "Ephesians 1:19-21",
        "greek": "τὸ ὑπερβάλλον μέγεθος τῆς δυνάμεως αὐτοῦ... κατὰ τὴν ἐνέργειαν τοῦ κράτους τῆς ἰσχύος αὐτοῦ... ὑπεράνω πάσης... ἐξουσίας",
        "english": "The surpassing greatness of His power (dynamis)... according to the working of His mighty (kratos) strength (ischys)... far above all... authority (exousia).",
        "wordHighlighted": "δύναμις, κράτος, ἰσχύς, ἐξουσία"
      },
      "practicalTip": "When promised 'power' (δύναμις) in Acts 1:8, it's enabling ability from the Spirit. When Jesus claims 'authority' (ἐξουσία) in Matt 28:18, it's rightful rule. Distinguish: Are you lacking ability (δύναμις) or authority (ἐξουσία)? God supplies both.",
      "tags": [
        "essential",
        "spirit",
        "christology"
      ]
    },
    {
      "id": "temple-hieron-naos",
      "category": "temple",
      "title": "Words for Temple/Sanctuary",
      "englishWord": "temple/sanctuary",
      "introduction": "Greek distinguishes the temple complex as a whole from the sanctuary proper. This distinction is crucial for understanding 'your body is a temple' - which word is used? - and for grasping the significance of the veil being torn.",
      "words": [
        {
          "greek": "ἱερόν",
          "transliteration": "hieron",
          "strongs": "G2411",
          "shortDef": "temple (the entire sacred precinct)",
          "nuance": "The whole temple area including all the courts - the Court of Gentiles, Court of Women, etc. The public, accessible areas where teaching occurred. Jesus 'cleansed the temple' (ἱερόν, Matt 21:12) and taught in the temple (Matt 26:55). This is where people gathered.",
          "ntUsage": 71
        },
        {
          "greek": "ναός",
          "transliteration": "naos",
          "strongs": "G3485",
          "shortDef": "sanctuary, inner shrine (the sacred dwelling)",
          "nuance": "The sanctuary proper - the sacred inner structure containing the Holy Place and Most Holy Place. Where God dwells. Only priests entered the Holy Place; only the high priest entered the Most Holy Place once yearly. Zechariah served in the ναός (Luke 1:9). The veil of the ναός was torn (Matt 27:51). Believers are the ναός of the Holy Spirit (1 Cor 3:16; 6:19).",
          "ntUsage": 45
        }
      ],
      "vineQuote": "Hieron denotes the entire building with its precincts, naos the inner sanctuary where God dwells. When Paul says the body is a temple (naos), he means God's dwelling-place, not merely a sacred precinct.",
      "exampleVerse": {
        "reference": "1 Corinthians 6:19",
        "greek": "τὸ σῶμα ὑμῶν ναὸς τοῦ ἐν ὑμῖν ἁγίου πνεύματός ἐστιν",
        "english": "Your body is a sanctuary (naos) of the Holy Spirit who is in you.",
        "wordHighlighted": "ναός"
      },
      "practicalTip": "When Paul says 'your body is a temple (ναός),' he uses the word for the sacred sanctuary - God's dwelling place. You are not merely part of a religious complex but the very dwelling of God's Spirit. This elevates the body's significance immensely.",
      "tags": [
        "essential",
        "spirit",
        "ecclesiology"
      ]
    },
    {
      "id": "clean-pure-katharos-hagnos-eilikrines",
      "category": "clean",
      "title": "Words for Clean/Pure",
      "englishWord": "clean/pure",
      "introduction": "Greek has several words for cleanness and purity, each with distinct emphasis. Some stress ceremonial cleanness, others moral purity, still others sincerity or transparency. These illuminate NT teaching on holiness and integrity.",
      "words": [
        {
          "greek": "καθαρός",
          "transliteration": "katharos",
          "strongs": "G2513",
          "shortDef": "clean, pure (ceremonially or morally)",
          "nuance": "The general word for clean or pure - free from contamination, whether ritual or moral. 'Blessed are the pure in heart' (Matt 5:8). 'You are already clean because of the word' (John 15:3). Used for ceremonial cleanness (Luke 11:41) and moral purity. The root of 'catharsis.'",
          "ntUsage": 27
        },
        {
          "greek": "ἁγνός",
          "transliteration": "hagnos",
          "strongs": "G53",
          "shortDef": "pure, holy, chaste (morally innocent)",
          "nuance": "Moral purity especially in the sense of chastity and innocence - free from defilement. Related to ἅγιος (holy). Used for sexual purity (2 Cor 11:2; 1 Tim 5:22), pure motives (Phil 1:17), and the wisdom from above (Jas 3:17). Emphasizes moral innocence.",
          "ntUsage": 8
        },
        {
          "greek": "εἰλικρινής",
          "transliteration": "eilikrinēs",
          "strongs": "G1506",
          "shortDef": "sincere, pure (judged by sunlight)",
          "nuance": "Pure in the sense of transparent, sincere, unmixed. Possibly from εἵλη (sunlight) + κρίνω (judge) - what stands the test of being examined in sunlight, revealing no flaws or mixture. Used for sincere faith (Phil 1:10) and pure minds (2 Pet 3:1). Emphasizes genuineness.",
          "ntUsage": 2
        },
        {
          "greek": "ἀμίαντος",
          "transliteration": "amiantos",
          "strongs": "G283",
          "shortDef": "undefiled, unstained (free from contamination)",
          "nuance": "Negation of 'defiled' - that which has no stain or contamination. Used for the undefiled marriage bed (Heb 13:4), undefiled religion (Jas 1:27), and Christ as undefiled high priest (Heb 7:26). Emphasizes freedom from pollution.",
          "ntUsage": 4
        }
      ],
      "vineQuote": "Katharos is the general term for clean; hagnos emphasizes moral purity and chastity; eilikrinēs stresses sincerity and genuineness tested by light; amiantos denotes freedom from pollution or stain.",
      "exampleVerse": {
        "reference": "Matthew 5:8",
        "greek": "μακάριοι οἱ καθαροὶ τῇ καρδίᾳ, ὅτι αὐτοὶ τὸν θεὸν ὄψονται",
        "english": "Blessed are the pure (katharos) in heart, for they will see God.",
        "wordHighlighted": "καθαρός"
      },
      "practicalTip": "When examining your heart, consider: Is it καθαρός (clean from contamination)? Is it ἁγνός (morally innocent)? Is it εἰλικρινής (genuine when examined in light)? Each word probes a different aspect of purity.",
      "tags": [
        "essential",
        "ethics",
        "holiness"
      ]
    },
    {
      "id": "child-son-teknon-huios-paidion",
      "category": "child",
      "title": "Words for Child/Son",
      "englishWord": "child/son",
      "introduction": "Greek distinguishes between children by birth relationship, children by legal status, and children by age. These distinctions illuminate NT teaching on believers as God's children - both born of Him and adopted as sons with full inheritance rights.",
      "words": [
        {
          "greek": "τέκνον",
          "transliteration": "teknon",
          "strongs": "G5043",
          "shortDef": "child (by birth, natural relationship)",
          "nuance": "Child in terms of origin and relationship - one born of a parent. Emphasizes the birth relationship. 'Children of God' (τέκνα θεοῦ, John 1:12) stresses being born of God, having His nature. Used for natural children and metaphorically for spiritual offspring.",
          "ntUsage": 99
        },
        {
          "greek": "υἱός",
          "transliteration": "huios",
          "strongs": "G5207",
          "shortDef": "son (with rights and status)",
          "nuance": "Son in terms of status, rights, and inheritance - the legal position. Emphasizes privilege and heirship. 'Sons of God' (υἱοὶ θεοῦ, Rom 8:14) stresses the full legal standing and inheritance rights. Used for 'Son of Man,' 'Son of God,' and believers as adopted sons.",
          "ntUsage": 377
        },
        {
          "greek": "παιδίον",
          "transliteration": "paidion",
          "strongs": "G3813",
          "shortDef": "little child, young child (by age)",
          "nuance": "A young child, emphasizing age and immaturity. Used for infants and small children (Matt 2:8 - 'the child' Jesus). Also used affectionately for disciples (John 21:5 - 'Children, have you any fish?'). Diminutive form emphasizing youth.",
          "ntUsage": 52
        },
        {
          "greek": "νήπιος",
          "transliteration": "nēpios",
          "strongs": "G3516",
          "shortDef": "infant, immature one (unable to speak)",
          "nuance": "An infant or one who cannot speak (νη- 'not' + ἔπος 'word'). Emphasizes immaturity and need for growth. Used negatively for spiritual immaturity (1 Cor 3:1; Heb 5:13) and positively for childlike receptivity (Matt 11:25). Contrasted with mature (τέλειος).",
          "ntUsage": 15
        }
      ],
      "vineQuote": "Teknon emphasizes the fact of birth; huios emphasizes dignity and character of relationship; paidion stresses age and immaturity; nēpios suggests one unable to speak, hence an infant or immature one.",
      "exampleVerse": {
        "reference": "John 1:12",
        "greek": "ἔδωκεν αὐτοῖς ἐξουσίαν τέκνα θεοῦ γενέσθαι",
        "english": "He gave them the right to become children (tekna) of God.",
        "wordHighlighted": "τέκνον"
      },
      "practicalTip": "When Scripture calls believers 'children' (τέκνα) of God, it emphasizes new birth - we share God's nature. When it calls us 'sons' (υἱοί), it emphasizes legal status - we have full inheritance rights. Both are true: born of God AND adopted as heirs.",
      "tags": [
        "essential",
        "johannine",
        "pauline",
        "adoption"
      ]
    },
    {
      "id": "age-world-aion-kosmos",
      "category": "age-world",
      "title": "Words for Age/World",
      "englishWord": "age/world",
      "introduction": "Greek distinguishes between 'age' (a period of time, an era) and 'world' (the created order or human society). This distinction is crucial for understanding 'this age' versus 'the age to come' and the believer's relationship to 'the world.'",
      "words": [
        {
          "greek": "αἰών",
          "transliteration": "aiōn",
          "strongs": "G165",
          "shortDef": "age, era, eternity, world-age",
          "nuance": "A period of time, an age or era. 'This age' (ὁ αἰὼν οὗτος) is the present evil age under Satan's influence. 'The age to come' (ὁ αἰὼν μέλλων) is the messianic age of salvation. Can mean 'forever' (εἰς τὸν αἰῶνα) or 'eternity.' The root of 'eon.' Emphasizes time dimension.",
          "ntUsage": 122
        },
        {
          "greek": "κόσμος",
          "transliteration": "kosmos",
          "strongs": "G2889",
          "shortDef": "world, universe, human society, world-system",
          "nuance": "The ordered world, universe, or human society. Has multiple senses: (1) the created universe (John 1:10a); (2) humanity (John 3:16 - God loved the world); (3) the world-system opposed to God (1 John 2:15 - do not love the world). Emphasizes space/order dimension.",
          "ntUsage": 186
        },
        {
          "greek": "οἰκουμένη",
          "transliteration": "oikoumenē",
          "strongs": "G3625",
          "shortDef": "inhabited world, Roman Empire",
          "nuance": "The inhabited earth, often the Roman world specifically. 'A decree went out from Caesar Augustus that all the world (οἰκουμένη) should be registered' (Luke 2:1). 'This gospel will be proclaimed throughout the whole world (οἰκουμένη)' (Matt 24:14). The civilized, inhabited world.",
          "ntUsage": 15
        }
      ],
      "vineQuote": "Aiōn denotes a period of time marked by spiritual or moral characteristics; kosmos represents the ordered system, whether physical creation or human society organized apart from God; oikoumenē is the inhabited earth.",
      "exampleVerse": {
        "reference": "Romans 12:2",
        "greek": "μὴ συσχηματίζεσθε τῷ αἰῶνι τούτῳ",
        "english": "Do not be conformed to this age (aiōn).",
        "wordHighlighted": "αἰών"
      },
      "practicalTip": "When Jesus says the 'world' (κόσμος) hates believers (John 15:18-19), He means human society organized against God. When Paul says not to be conformed to 'this age' (αἰών), he means the present era's values. The enemy operates through both - the world-system AND the present evil age.",
      "tags": [
        "essential",
        "eschatology",
        "johannine",
        "pauline"
      ]
    },
    {
      "id": "teach-learn-didasko-manthano-paideuo",
      "category": "teach",
      "title": "Words for Teach/Learn",
      "englishWord": "teach/learn",
      "introduction": "Greek has distinct words for teaching, learning, and training. Some emphasize instruction, others the learner's appropriation, still others discipline and correction. These illuminate NT discipleship - becoming a μαθητής (disciple/learner) of Jesus.",
      "words": [
        {
          "greek": "διδάσκω",
          "transliteration": "didaskō",
          "strongs": "G1321",
          "shortDef": "to teach, instruct (systematic instruction)",
          "nuance": "To teach, give instruction - the activity of the teacher imparting knowledge or skill. Jesus taught (ἐδίδασκεν) in synagogues and temple. The apostles devoted themselves to teaching (Acts 2:42). Emphasizes the systematic communication of truth. Root of 'didactic.'",
          "ntUsage": 97
        },
        {
          "greek": "μανθάνω",
          "transliteration": "manthanō",
          "strongs": "G3129",
          "shortDef": "to learn (by study, practice, experience)",
          "nuance": "To learn, acquire knowledge - the activity of the student receiving instruction. 'Learn from me' (Matt 11:29). The μαθητής (disciple) is literally 'a learner.' Emphasizes the student's appropriation of what is taught. Learning through experience and practice, not just hearing.",
          "ntUsage": 25
        },
        {
          "greek": "παιδεύω",
          "transliteration": "paideuō",
          "strongs": "G3811",
          "shortDef": "to train, discipline, educate, correct",
          "nuance": "To train a child (παῖς), hence to educate, discipline, or correct. Includes instruction but emphasizes formation of character through discipline. God 'disciplines' (παιδεύει) those He loves (Heb 12:6). Paul was 'educated' (πεπαιδευμένος) under Gamaliel (Acts 22:3). Root of 'pedagogy.'",
          "ntUsage": 13
        },
        {
          "greek": "κατηχέω",
          "transliteration": "katēcheō",
          "strongs": "G2727",
          "shortDef": "to instruct, inform orally (catechize)",
          "nuance": "To instruct orally, to teach by word of mouth. Theophilus was 'instructed' (κατηχήθης, Luke 1:4). Apollos was 'instructed' in the way of the Lord (Acts 18:25). The root of 'catechism' - systematic oral instruction in the faith.",
          "ntUsage": 8
        }
      ],
      "vineQuote": "Didaskō is to teach, hold discourse with others to instruct them; manthanō is to learn, increase one's knowledge by instruction or experience; paideuō is to train children, including discipline and correction; katēcheō is to sound down into the ears, to instruct orally.",
      "exampleVerse": {
        "reference": "Matthew 11:29",
        "greek": "μάθετε ἀπ᾽ ἐμοῦ, ὅτι πραΰς εἰμι",
        "english": "Learn (manthanō) from me, for I am gentle.",
        "wordHighlighted": "μανθάνω"
      },
      "practicalTip": "Being a 'disciple' (μαθητής) means being a learner - one who not only hears teaching (διδασκαλία) but learns it (μανθάνω). God also disciplines (παιδεύω) us as children. Christian formation involves all three: instruction, learning, and formative discipline.",
      "tags": [
        "essential",
        "discipleship",
        "education"
      ]
    },
    {
      "id": "rise-raise-anistemi-egeiro",
      "category": "rise",
      "title": "Words for Rise/Raise",
      "englishWord": "rise/raise",
      "introduction": "Two main Greek verbs describe resurrection: ἀνίστημι (to stand up, rise) and ἐγείρω (to wake, rouse, raise). Both are used for Christ's resurrection and believers' future resurrection, sometimes interchangeably, but with subtle differences in emphasis.",
      "words": [
        {
          "greek": "ἀνίστημι",
          "transliteration": "anistēmi",
          "strongs": "G450",
          "shortDef": "to rise, stand up, raise up",
          "nuance": "To cause to rise or to rise oneself - standing up from sitting, lying, or death. The intransitive use emphasizes the subject's own action of rising. 'He rose' (ἀνέστη, Mark 8:31; 9:31; 10:34). The noun ἀνάστασις (resurrection) comes from this verb. Emphasizes the rising action.",
          "ntUsage": 108
        },
        {
          "greek": "ἐγείρω",
          "transliteration": "egeirō",
          "strongs": "G1453",
          "shortDef": "to wake, rouse, raise up",
          "nuance": "To wake from sleep, to rouse, to raise up. Often passive for resurrection: 'He was raised' (ἠγέρθη, 1 Cor 15:4) - emphasizing God's action in raising Jesus. 'God raised Him from the dead' (Acts 3:15). The passive voice highlights divine action, the Father raising the Son.",
          "ntUsage": 141
        }
      ],
      "vineQuote": "Anistēmi signifies to cause to stand up or to stand up oneself; egeirō means to rouse from sleep or death. In resurrection contexts, anistēmi often stresses the rising, egeirō the rousing by another (God the Father).",
      "exampleVerse": {
        "reference": "1 Corinthians 15:4",
        "greek": "καὶ ὅτι ἐγήγερται τῇ ἡμέρᾳ τῇ τρίτῃ κατὰ τὰς γραφάς",
        "english": "And that He was raised (egeirō - passive) on the third day according to the Scriptures.",
        "wordHighlighted": "ἐγείρω"
      },
      "practicalTip": "When Paul says Christ 'was raised' (ἠγέρθη, passive), he emphasizes the Father's action in raising the Son. When Mark says 'He will rise' (ἀναστήσεται), the focus is on Christ's own rising. Both are true: the Father raised Him, and He rose. The resurrection is Trinitarian.",
      "tags": [
        "essential",
        "resurrection",
        "christology"
      ]
    },
    {
      "id": "will-desire-thelo-boulomai",
      "category": "will",
      "title": "Words for Will/Desire",
      "englishWord": "will/desire/wish",
      "introduction": "Greek has two main verbs for willing or wishing. Understanding their distinction helps interpret passages about God's will, human desires, and the interplay between divine sovereignty and human responsibility.",
      "words": [
        {
          "greek": "θέλω",
          "transliteration": "thelō",
          "strongs": "G2309",
          "shortDef": "to will, wish, desire (inclination)",
          "nuance": "To will, wish, or desire - often emphasizing inclination, impulse, or emotional desire. Can express strong personal desire ('I want') or deliberate choice. 'What do you want (θέλεις) me to do for you?' (Mark 10:51). 'God wills (θέλει) all people to be saved' (1 Tim 2:4). The more common word for willing.",
          "ntUsage": 208
        },
        {
          "greek": "βούλομαι",
          "transliteration": "boulomai",
          "strongs": "G1014",
          "shortDef": "to will, purpose, intend (deliberate purpose)",
          "nuance": "To will with deliberation, to purpose, to plan. Emphasizes reasoned, deliberate intention more than emotional desire. Often used for God's sovereign counsel: 'the purpose (βουλή) of His will' (Eph 1:11). 'The Lord's will (βούλημα) be done' (Acts 21:14). Suggests settled purpose.",
          "ntUsage": 37
        },
        {
          "greek": "ἐπιθυμέω",
          "transliteration": "epithymeō",
          "strongs": "G1937",
          "shortDef": "to desire earnestly, long for, lust",
          "nuance": "To set one's heart upon, to desire intensely. Can be positive ('I have earnestly desired to eat this Passover,' Luke 22:15) or negative ('do not covet,' Rom 7:7; 'the lust of the flesh,' Gal 5:16). Stronger emotional intensity than θέλω. Emphasizes passionate desire.",
          "ntUsage": 16
        }
      ],
      "vineQuote": "Thelō expresses the will that proceeds from inclination; boulomai expresses the will that proceeds from deliberation and purpose; epithymeō denotes a strong desire directed toward something, whether good or evil.",
      "exampleVerse": {
        "reference": "Ephesians 1:11",
        "greek": "κατὰ τὴν βουλὴν τοῦ θελήματος αὐτοῦ",
        "english": "According to the counsel (boulē) of His will (thelēma).",
        "wordHighlighted": "βουλή and θέλημα"
      },
      "practicalTip": "When Scripture speaks of God's 'will' (θέλημα), it often means His revealed desire - what pleases Him. When it speaks of His 'purpose' (βουλή), it often means His sovereign plan that cannot be thwarted. Both are true: God desires all to be saved (θέλει, 1 Tim 2:4), and His purposes (βουλή) always stand (Isa 46:10).",
      "tags": [
        "essential",
        "theology-proper",
        "sovereignty"
      ]
    },
    {
      "id": "heal-therapeuo-iaomai-sozo",
      "category": "heal",
      "title": "Words for Heal/Cure",
      "englishWord": "heal/cure",
      "introduction": "Greek has several words for healing, each with distinct emphasis. Some stress the process of treatment, others the instantaneous cure, and one connects physical healing to spiritual salvation. These distinctions illuminate the Gospel healing narratives.",
      "words": [
        {
          "greek": "θεραπεύω",
          "transliteration": "therapeuō",
          "strongs": "G2323",
          "shortDef": "to heal, cure, serve, treat (process of care)",
          "nuance": "To heal by treating, serving, or caring for - emphasizing the process of treatment and restoration. Originally meant 'to serve' or 'attend to.' Used for Jesus healing diseases (Matt 4:23-24; 12:15). The root of 'therapy' and 'therapeutic.' Suggests ongoing care and treatment.",
          "ntUsage": 43
        },
        {
          "greek": "ἰάομαι",
          "transliteration": "iaomai",
          "strongs": "G2390",
          "shortDef": "to heal, cure (instantaneous, complete)",
          "nuance": "To heal or cure - often emphasizing instantaneous, complete healing. The physician's term for effecting a cure. 'Your faith has healed (ἰάσατο) you' (Luke 17:19). 'By His wounds you have been healed (ἰάθητε)' (1 Pet 2:24). Can refer to physical or spiritual healing.",
          "ntUsage": 26
        },
        {
          "greek": "σῴζω",
          "transliteration": "sōzō",
          "strongs": "G4982",
          "shortDef": "to save, heal, deliver, make whole",
          "nuance": "To save, rescue, deliver - used for both spiritual salvation and physical healing. 'Your faith has saved/healed (σέσωκεν) you' (Mark 5:34; 10:52; Luke 7:50; 17:19). The overlap between 'heal' and 'save' shows the holistic nature of Jesus' ministry. Physical healing points to greater salvation.",
          "ntUsage": 106
        },
        {
          "greek": "ὑγιαίνω",
          "transliteration": "hygiainō",
          "strongs": "G5198",
          "shortDef": "to be healthy, sound, whole",
          "nuance": "To be healthy, sound, or whole - the state of health rather than the act of healing. 'Those who are well (ὑγιαίνοντες) have no need of a physician' (Luke 5:31). Used metaphorically for 'sound doctrine' (1 Tim 1:10; 2 Tim 4:3; Titus 1:9). The root of 'hygiene.'",
          "ntUsage": 12
        }
      ],
      "vineQuote": "Therapeuō emphasizes the process of healing and care; iaomai stresses the accomplished cure; sōzō connects physical healing to the broader concept of salvation and deliverance; hygiainō describes the resultant state of health.",
      "exampleVerse": {
        "reference": "Mark 5:34",
        "greek": "ἡ πίστις σου σέσωκέν σε· ὕπαγε εἰς εἰρήνην καὶ ἴσθι ὑγιὴς",
        "english": "Your faith has saved/healed (sōzō) you; go in peace and be healed/whole (hygiēs).",
        "wordHighlighted": "σῴζω and ὑγιής"
      },
      "practicalTip": "When Jesus says 'your faith has saved you' (σέσωκεν) to those He heals, the word deliberately connects physical healing to spiritual salvation. The healings are signs pointing to greater wholeness - the salvation Christ brings encompasses body and soul.",
      "tags": [
        "essential",
        "gospels",
        "miracles",
        "salvation"
      ]
    },
    {
      "id": "walk-peripateo-poreuomai-stoicheo",
      "category": "walk",
      "title": "Words for Walk/Conduct",
      "englishWord": "walk/live/conduct",
      "introduction": "Greek uses several 'walking' words metaphorically for how one lives or conducts oneself. This is especially prominent in Paul's letters: believers are to 'walk' in newness of life, by the Spirit, in love. The metaphor emphasizes daily, step-by-step living.",
      "words": [
        {
          "greek": "περιπατέω",
          "transliteration": "peripateō",
          "strongs": "G4043",
          "shortDef": "to walk, live, conduct oneself (lifestyle)",
          "nuance": "Literally to walk around; metaphorically, to conduct one's life, to live in a certain manner. Paul's characteristic term for Christian living: 'walk in newness of life' (Rom 6:4), 'walk by the Spirit' (Gal 5:16), 'walk in love' (Eph 5:2), 'walk as children of light' (Eph 5:8). Emphasizes the ongoing pattern of daily life.",
          "ntUsage": 95
        },
        {
          "greek": "πορεύομαι",
          "transliteration": "poreuomai",
          "strongs": "G4198",
          "shortDef": "to go, journey, travel, proceed",
          "nuance": "To go, travel, or journey - more directional than περιπατέω. Often literal (journeying from place to place) but also metaphorical for pursuing a course of life: 'go in peace' (Luke 7:50), 'go and sin no more' (John 8:11). Emphasizes direction and destination.",
          "ntUsage": 153
        },
        {
          "greek": "στοιχέω",
          "transliteration": "stoicheō",
          "strongs": "G4748",
          "shortDef": "to walk in line, follow, conform to",
          "nuance": "To walk in line, to keep in step - a military term for marching in formation. 'If we live by the Spirit, let us also keep in step (στοιχῶμεν) with the Spirit' (Gal 5:25). 'Walk by the same rule' (Phil 3:16). Emphasizes orderly following and conformity to a standard.",
          "ntUsage": 5
        },
        {
          "greek": "ὁδεύω",
          "transliteration": "hodeuō",
          "strongs": "G3593",
          "shortDef": "to travel, journey (on a road)",
          "nuance": "To travel on a road (ὁδός). Less common, emphasizing the road or path being traveled. 'As they were journeying' (Luke 10:38). Related to ὁδός (way/road) - Christ is 'the Way.'",
          "ntUsage": 1
        }
      ],
      "vineQuote": "Peripateō signifies one's habitual conduct or manner of life; poreuomai emphasizes the direction of one's going; stoicheō suggests walking in line, keeping step with a standard or rule.",
      "exampleVerse": {
        "reference": "Galatians 5:16, 25",
        "greek": "πνεύματι περιπατεῖτε... εἰ ζῶμεν πνεύματι, πνεύματι καὶ στοιχῶμεν",
        "english": "Walk (peripateō) by the Spirit... if we live by the Spirit, let us also keep in step (stoicheō) with the Spirit.",
        "wordHighlighted": "περιπατέω and στοιχέω"
      },
      "practicalTip": "Paul uses περιπατέω for the general lifestyle ('walk by the Spirit') and στοιχέω for the disciplined following ('keep in step'). Both are needed: general direction (περιπατέω) and moment-by-moment obedience (στοιχέω). The Christian life is a journey walked daily in step with the Spirit.",
      "tags": [
        "essential",
        "ethics",
        "pauline",
        "spirit"
      ]
    },
    {
      "id": "bless-eulogeo-makarizo",
      "category": "bless",
      "title": "Words for Bless/Blessed",
      "englishWord": "bless/blessed",
      "introduction": "Greek has two main words translated 'bless' or 'blessed,' but they have distinct meanings. One involves speaking well (blessing), the other describes a state of happiness or favor (beatitude). The Beatitudes use one; doxologies use the other.",
      "words": [
        {
          "greek": "εὐλογέω",
          "transliteration": "eulogeō",
          "strongs": "G2127",
          "shortDef": "to bless, speak well of, praise",
          "nuance": "To speak well of, to bless - either God blessing humans (conferring favor) or humans blessing God (praising). 'Blessed (εὐλογημένος) is He who comes in the name of the Lord' (Matt 21:9). 'Blessed be the God and Father' (Eph 1:3). Used at the Last Supper: Jesus 'blessed' the bread (Matt 26:26). Root of 'eulogy.'",
          "ntUsage": 41
        },
        {
          "greek": "μακαρίζω",
          "transliteration": "makarizō",
          "strongs": "G3106",
          "shortDef": "to pronounce blessed, consider fortunate",
          "nuance": "To pronounce or consider someone blessed/happy - declaring their fortunate state. 'All generations will call me blessed (μακαριοῦσιν)' (Luke 1:48). 'We count them blessed (μακαρίζομεν) who remained steadfast' (Jas 5:11). Less about conferring blessing than recognizing it.",
          "ntUsage": 2
        },
        {
          "greek": "μακάριος",
          "transliteration": "makarios",
          "strongs": "G3107",
          "shortDef": "blessed, happy, fortunate (state)",
          "nuance": "The adjective: blessed, happy, fortunate - describing a state of blessedness. The Beatitudes: 'Blessed (μακάριοι) are the poor in spirit' (Matt 5:3-11). 'Blessed is the man who...' (Ps 1:1 LXX; Rom 4:7-8). Describes the enviable condition of those favored by God.",
          "ntUsage": 50
        },
        {
          "greek": "εὐλογητός",
          "transliteration": "eulogētos",
          "strongs": "G2128",
          "shortDef": "blessed, praised, worthy of blessing",
          "nuance": "The adjective from εὐλογέω - blessed or praised. Used almost exclusively of God: 'Blessed be the God and Father of our Lord Jesus Christ' (Eph 1:3; 1 Pet 1:3). 'The blessed (εὐλογητός) God' (1 Tim 6:15). Describes God as worthy of blessing/praise.",
          "ntUsage": 8
        }
      ],
      "vineQuote": "Eulogeō means to speak well of, to bless; makarios describes a state of blessedness or happiness. When we bless God (εὐλογοῦμεν), we praise Him; when God blesses us (εὐλογεῖ), He bestows favor. The Beatitudes declare people μακάριοι - in an enviable state of divine favor.",
      "exampleVerse": {
        "reference": "Matthew 5:3",
        "greek": "μακάριοι οἱ πτωχοὶ τῷ πνεύματι",
        "english": "Blessed (makarioi) are the poor in spirit.",
        "wordHighlighted": "μακάριος"
      },
      "practicalTip": "The Beatitudes use μακάριος (a state of blessedness) not εὐλογημένος (blessed by speech). Jesus declares certain people to be in an enviable state - already blessed by God - not that He is blessing them at that moment. The difference: εὐλογέω is the act of blessing; μακάριος is the resulting state.",
      "tags": [
        "essential",
        "beatitudes",
        "worship",
        "doxology"
      ]
    },
    {
      "id": "weep-mourn-klaio-pentheo-threneo",
      "category": "weep",
      "title": "Words for Weep/Mourn/Lament",
      "englishWord": "weep/mourn/lament",
      "introduction": "Greek distinguishes between different types of sorrow and its expressions. Some words emphasize tears, others mourning rituals, still others vocal lamentation. These distinctions illuminate Gospel accounts of grief and the 'blessed' who mourn.",
      "words": [
        {
          "greek": "κλαίω",
          "transliteration": "klaiō",
          "strongs": "G2799",
          "shortDef": "to weep, cry, shed tears",
          "nuance": "To weep, cry audibly - expressing grief through tears. 'Jesus wept (ἐδάκρυσεν)' uses a different word, but κλαίω is more common: 'weep with those who weep' (Rom 12:15), Peter 'wept bitterly' (Matt 26:75), the widow of Nain was weeping (Luke 7:13). Audible, emotional weeping.",
          "ntUsage": 40
        },
        {
          "greek": "πενθέω",
          "transliteration": "pentheō",
          "strongs": "G3996",
          "shortDef": "to mourn, grieve, lament (formal mourning)",
          "nuance": "To mourn, grieve - often the formal mourning for the dead or deep grief. 'Blessed are those who mourn (πενθοῦντες)' (Matt 5:4). 'You will weep and mourn (πενθήσετε)' (John 16:20). Can include mourning rituals and outward expressions of grief.",
          "ntUsage": 10
        },
        {
          "greek": "θρηνέω",
          "transliteration": "thrēneō",
          "strongs": "G2354",
          "shortDef": "to lament, wail, sing a dirge",
          "nuance": "To lament, wail, sing a funeral song - vocal, even musical lamentation. 'We played the flute for you and you did not dance; we sang a dirge (ἐθρηνήσαμεν) and you did not mourn' (Matt 11:17). Professional mourners would thrēneō at funerals. Loud, vocal grief.",
          "ntUsage": 4
        },
        {
          "greek": "δακρύω",
          "transliteration": "dakryō",
          "strongs": "G1145",
          "shortDef": "to weep, shed tears (quietly)",
          "nuance": "To weep or shed tears - used only once: 'Jesus wept (ἐδάκρυσεν)' (John 11:35). Distinct from κλαίω in being quieter, less demonstrative. Jesus shed tears rather than wailing aloud. Deep, quiet grief.",
          "ntUsage": 1
        }
      ],
      "vineQuote": "Klaiō signifies audible weeping; pentheō is mourning, especially formal or ritual mourning for the dead; thrēneō is vocal lamentation, singing a dirge; dakryō is simply to shed tears, used of Jesus at Lazarus's tomb.",
      "exampleVerse": {
        "reference": "Matthew 5:4",
        "greek": "μακάριοι οἱ πενθοῦντες, ὅτι αὐτοὶ παρακληθήσονται",
        "english": "Blessed are those who mourn (pentheō), for they shall be comforted.",
        "wordHighlighted": "πενθέω"
      },
      "practicalTip": "When 'Jesus wept' (John 11:35) uses δακρύω rather than κλαίω, it suggests quiet tears rather than loud wailing - deeply moved yet composed. The Beatitude uses πενθέω - not just sadness but the grief that leads to God for comfort. Those who mourn over sin and suffering are blessed because they will receive divine comfort.",
      "tags": [
        "essential",
        "beatitudes",
        "gospels",
        "emotion"
      ]
    }
  ]
}